{
    "kind": "Listing",
    "data": {
        "after": "t3_72lpoq",
        "dist": 25,
        "modhash": "",
        "geo_filter": null,
        "children": [
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "Freebuild",
                    "selftext": "Freddit has become a mess. \n\n\n\n**Part 1:** Inactivity. The server is completely inactive. The most users I see everyday are 2-3, and even that's becoming rarer. Now, I get it-- it's the most inactive time of the year, but the Discord is so much more active that it really feels like the server is truly dying.\n\n\n**Part 2:** Deterioration of the server. Hovertal is gone for one, so that absolutely sucks. I missed that. The server is also completely piled with griefs. I'm serious. Just go to spawn, check it out! It's a gallery of griefs! There seems to be nothing new happening, either. I heard Sven was adding a roller coaster plugin: something he's just pulled from the shelf of Spigot, no doubt. Sounds really special, doesn't it? Instead of a cool plugin made just for us, it's just... there. Equal to any other plugin.\n\n\n**Part 3:** Staff. Let's be honest here, the staff are not very good right now. I'm not trying to mindlessly offend anyone, but it's just a fact that the current staff team is not good. I'm going to break-down all of the staff members, but instead of just offending them, I'm going to try to actually state the problems with them and how they moderate the server:\n\n1. Zoo. I'd consider Zoo the 'community owner'. That is NOT a bad thing. He monitors the community and deals with most drama situations. This is all fine, but... He's letting the server deteriorate. He's not focusing on it. He's also not all that active in my experience, but I might just think that due to our timezones.\n\n\n2. Sven. The 'server owner'. He works on the server and does what he can to improve it-- but he doesn't seem to really add all that much. And when he does, it's usually removed. He also seems to be restricted from doing anything else-- if he makes a community decision, all of staff backlash instantly.\n\n\n3. Zelda. He... doesn't really do much of anything. He's on Discord often sure, and he does solve some problems on there, but he doesn't really do much staff related... I mean, he moves people to respective channels, but... that doesn't really count.\n\n\n4. Orb. Orb seems to be the most active on the server. He likes to make cool things and work on Reversal City and Orbcorp. He does ban people sometimes, but it feels more like he uses his staff rank just to make cool things. Not saying that's bad-- but he's left and rejoined staff multiple times for a reason. He doesn't really do much of the staff stuff.\n\n\n5. Milk. Active on the Discord, and that's about it. Last time I tried to get him to do staff things he got frustrated at me. Doesn't really know how to do much either... and it doesn't really help that Mod perms are messed up. No offense to him, but certainly not really a good staff member.\n\n\n6. Random. Wait, he's staff? I keep forgetting because he suffers a similar problem: doesn't really do staff things, and he's not even on the Discord server that often, much less the actual Minecraft server. Good guy: bad staff member.\n\n\n7. Leedle. Draws very well! Doesn't do staff very well. I don't think I've ever seen him do any staff tasks at all.\n\n\n8. Gaben/ShadowKnight/LolMech. A man who goes by many names. He seems to do some staff things, and is maybe... 2nd staff most active on the server after Orb? I haven't seen him do all that much staff stuff, though. \n\n\n9. Pluff. I've seen him do some staff stuff on Discord IIRC, but I haven't seen him on the minecraft server in a long time.\n\n\n**Part 4:** Expanding the server. Users who come don't stay. They're asked 'are you new?' by staff a few times, and then they leave, never to be seen again. The server is not welcoming to new players, and there is nothing that makes them interested to stay.\n\n\n**Part 5:** 'Sexual' moments. This server has gone way too far with this. First were the fanfics. They were one thing and they certainly messed me up the first time I saw them, and that was a long time ago. I think these things have gone even more overboard, though. The fanfics were messed up for sure, but they weren't on too often, and they were certainly 100% just for comedy. However, a lot of these things are serious now. People asking for porn drawn, people talking about Ghire's Tits all the time, it's gone way overboard. And Spurr is also a large problem with this. The stories he makes up are even worse than the Fanfic Gen ever was. He goes super-overboard. I'm honestly getting sick of it-- and it's super weird. Like, these characters sorta represent the users on the server, and they're drawn fucking each other. You can NOT seriously think that that is not messed up.\n\n\n**Part 6:** There are a few more personal reasons I want to leave too. I've been thinking about these things for a long time, but I still can't really decide if I really could leave. It's sometimes the hope that things can go back to how they were in the early times, especially when I was Admin for the first time... after the elections, of course. That was probably my sweet-spot for actual being-on-Freddit time. Everything was active, things were good. and the drama hadn't really ramped up to the level it did soon after. I don't know if that time is ever gonna come back, though. I don't see it coming back, so I don't really know if I should stay, especially with how things are now. \n\n\nThat's all I have to say for now.\n\n**Edit: I might also make a 'discord server post' about people who think that the Minecraft server portion is irrelevant**\n\n",
                    "user_reports": [],
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "I'm probably quitting Freddit, and here's a couple of reasons why. (also an overall Freddit Rant)",
                    "link_flair_richtext": [],
                    "subreddit_name_prefixed": "r/Freebuild",
                    "hidden": false,
                    "pwls": null,
                    "link_flair_css_class": null,
                    "downs": 0,
                    "thumbnail_height": null,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_7bk8fw",
                    "quarantine": false,
                    "link_flair_text_color": "dark",
                    "upvote_ratio": 1.0,
                    "author_flair_background_color": "",
                    "subreddit_type": "public",
                    "ups": 4,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "thumbnail_width": null,
                    "author_flair_template_id": null,
                    "is_original_content": false,
                    "secure_media": null,
                    "is_reddit_media_domain": false,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": null,
                    "can_mod_post": false,
                    "score": 4,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "thumbnail": "self",
                    "edited": 1510134319.0,
                    "author_flair_css_class": null,
                    "gildings": {},
                    "content_categories": null,
                    "is_self": true,
                    "mod_note": null,
                    "created": 1510132752.0,
                    "link_flair_type": "text",
                    "wls": null,
                    "removed_by_category": null,
                    "banned_by": null,
                    "domain": "self.Freebuild",
                    "allow_live_comments": false,
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Freddit has become a mess. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Part 1:&lt;/strong&gt; Inactivity. The server is completely inactive. The most users I see everyday are 2-3, and even that&amp;#39;s becoming rarer. Now, I get it-- it&amp;#39;s the most inactive time of the year, but the Discord is so much more active that it really feels like the server is truly dying.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Part 2:&lt;/strong&gt; Deterioration of the server. Hovertal is gone for one, so that absolutely sucks. I missed that. The server is also completely piled with griefs. I&amp;#39;m serious. Just go to spawn, check it out! It&amp;#39;s a gallery of griefs! There seems to be nothing new happening, either. I heard Sven was adding a roller coaster plugin: something he&amp;#39;s just pulled from the shelf of Spigot, no doubt. Sounds really special, doesn&amp;#39;t it? Instead of a cool plugin made just for us, it&amp;#39;s just... there. Equal to any other plugin.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Part 3:&lt;/strong&gt; Staff. Let&amp;#39;s be honest here, the staff are not very good right now. I&amp;#39;m not trying to mindlessly offend anyone, but it&amp;#39;s just a fact that the current staff team is not good. I&amp;#39;m going to break-down all of the staff members, but instead of just offending them, I&amp;#39;m going to try to actually state the problems with them and how they moderate the server:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;Zoo. I&amp;#39;d consider Zoo the &amp;#39;community owner&amp;#39;. That is NOT a bad thing. He monitors the community and deals with most drama situations. This is all fine, but... He&amp;#39;s letting the server deteriorate. He&amp;#39;s not focusing on it. He&amp;#39;s also not all that active in my experience, but I might just think that due to our timezones.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Sven. The &amp;#39;server owner&amp;#39;. He works on the server and does what he can to improve it-- but he doesn&amp;#39;t seem to really add all that much. And when he does, it&amp;#39;s usually removed. He also seems to be restricted from doing anything else-- if he makes a community decision, all of staff backlash instantly.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Zelda. He... doesn&amp;#39;t really do much of anything. He&amp;#39;s on Discord often sure, and he does solve some problems on there, but he doesn&amp;#39;t really do much staff related... I mean, he moves people to respective channels, but... that doesn&amp;#39;t really count.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Orb. Orb seems to be the most active on the server. He likes to make cool things and work on Reversal City and Orbcorp. He does ban people sometimes, but it feels more like he uses his staff rank just to make cool things. Not saying that&amp;#39;s bad-- but he&amp;#39;s left and rejoined staff multiple times for a reason. He doesn&amp;#39;t really do much of the staff stuff.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Milk. Active on the Discord, and that&amp;#39;s about it. Last time I tried to get him to do staff things he got frustrated at me. Doesn&amp;#39;t really know how to do much either... and it doesn&amp;#39;t really help that Mod perms are messed up. No offense to him, but certainly not really a good staff member.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Random. Wait, he&amp;#39;s staff? I keep forgetting because he suffers a similar problem: doesn&amp;#39;t really do staff things, and he&amp;#39;s not even on the Discord server that often, much less the actual Minecraft server. Good guy: bad staff member.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Leedle. Draws very well! Doesn&amp;#39;t do staff very well. I don&amp;#39;t think I&amp;#39;ve ever seen him do any staff tasks at all.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Gaben/ShadowKnight/LolMech. A man who goes by many names. He seems to do some staff things, and is maybe... 2nd staff most active on the server after Orb? I haven&amp;#39;t seen him do all that much staff stuff, though. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Pluff. I&amp;#39;ve seen him do some staff stuff on Discord IIRC, but I haven&amp;#39;t seen him on the minecraft server in a long time.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;&lt;strong&gt;Part 4:&lt;/strong&gt; Expanding the server. Users who come don&amp;#39;t stay. They&amp;#39;re asked &amp;#39;are you new?&amp;#39; by staff a few times, and then they leave, never to be seen again. The server is not welcoming to new players, and there is nothing that makes them interested to stay.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Part 5:&lt;/strong&gt; &amp;#39;Sexual&amp;#39; moments. This server has gone way too far with this. First were the fanfics. They were one thing and they certainly messed me up the first time I saw them, and that was a long time ago. I think these things have gone even more overboard, though. The fanfics were messed up for sure, but they weren&amp;#39;t on too often, and they were certainly 100% just for comedy. However, a lot of these things are serious now. People asking for porn drawn, people talking about Ghire&amp;#39;s Tits all the time, it&amp;#39;s gone way overboard. And Spurr is also a large problem with this. The stories he makes up are even worse than the Fanfic Gen ever was. He goes super-overboard. I&amp;#39;m honestly getting sick of it-- and it&amp;#39;s super weird. Like, these characters sorta represent the users on the server, and they&amp;#39;re drawn fucking each other. You can NOT seriously think that that is not messed up.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Part 6:&lt;/strong&gt; There are a few more personal reasons I want to leave too. I&amp;#39;ve been thinking about these things for a long time, but I still can&amp;#39;t really decide if I really could leave. It&amp;#39;s sometimes the hope that things can go back to how they were in the early times, especially when I was Admin for the first time... after the elections, of course. That was probably my sweet-spot for actual being-on-Freddit time. Everything was active, things were good. and the drama hadn&amp;#39;t really ramped up to the level it did soon after. I don&amp;#39;t know if that time is ever gonna come back, though. I don&amp;#39;t see it coming back, so I don&amp;#39;t really know if I should stay, especially with how things are now. &lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s all I have to say for now.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Edit: I might also make a &amp;#39;discord server post&amp;#39; about people who think that the Minecraft server portion is irrelevant&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "view_count": null,
                    "archived": false,
                    "no_follow": false,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "can_gild": false,
                    "spoiler": false,
                    "locked": false,
                    "author_flair_text": null,
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_3bg30",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": "",
                    "id": "7bk8fw",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "[deleted]",
                    "discussion_type": null,
                    "num_comments": 3,
                    "send_replies": true,
                    "whitelist_status": null,
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_flair_text_color": "dark",
                    "permalink": "/r/Freebuild/comments/7bk8fw/im_probably_quitting_freddit_and_heres_a_couple/",
                    "parent_whitelist_status": null,
                    "stickied": false,
                    "url": "https://old.reddit.com/r/Freebuild/comments/7bk8fw/im_probably_quitting_freddit_and_heres_a_couple/",
                    "subreddit_subscribers": 219,
                    "created_utc": 1510132752.0,
                    "num_crossposts": 0,
                    "media": null,
                    "is_video": false
                }
            },
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "Freebuild",
                    "selftext": "",
                    "author_fullname": "t2_n4wex",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "jafcfielf 3: return of the free bird",
                    "link_flair_richtext": [],
                    "subreddit_name_prefixed": "r/Freebuild",
                    "hidden": false,
                    "pwls": null,
                    "link_flair_css_class": "",
                    "downs": 0,
                    "thumbnail_height": 105,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_7b02ec",
                    "quarantine": false,
                    "link_flair_text_color": null,
                    "upvote_ratio": 0.67,
                    "author_flair_background_color": "",
                    "subreddit_type": "public",
                    "ups": 2,
                    "total_awards_received": 0,
                    "media_embed": {
                        "content": "&lt;iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/qu3eV_mLIqc?feature=oembed&amp;enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"jafcfielf 3: return of the free bird\"&gt;&lt;/iframe&gt;",
                        "width": 356,
                        "scrolling": false,
                        "height": 200
                    },
                    "thumbnail_width": 140,
                    "author_flair_template_id": null,
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": {
                        "type": "youtube.com",
                        "oembed": {
                            "provider_url": "https://www.youtube.com/",
                            "version": "1.0",
                            "title": "jafcfielf 3: return of the free bird",
                            "type": "video",
                            "thumbnail_width": 480,
                            "height": 200,
                            "width": 356,
                            "html": "&lt;iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/qu3eV_mLIqc?feature=oembed&amp;enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"jafcfielf 3: return of the free bird\"&gt;&lt;/iframe&gt;",
                            "author_name": "DedicatedGraph6",
                            "provider_name": "YouTube",
                            "thumbnail_url": "https://i.ytimg.com/vi/qu3eV_mLIqc/hqdefault.jpg",
                            "thumbnail_height": 360,
                            "author_url": "https://www.youtube.com/@DedicatedGraph6"
                        }
                    },
                    "is_reddit_media_domain": false,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {
                        "content": "&lt;iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/qu3eV_mLIqc?feature=oembed&amp;enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"jafcfielf 3: return of the free bird\"&gt;&lt;/iframe&gt;",
                        "width": 356,
                        "scrolling": false,
                        "media_domain_url": "https://www.redditmedia.com/mediaembed/7b02ec",
                        "height": 200
                    },
                    "link_flair_text": "ART",
                    "can_mod_post": false,
                    "score": 2,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "https://b.thumbs.redditmedia.com/5xNnUYW5vijlp3zsTxrajHHWd6U8S_XT041yIGw9aOs.jpg",
                    "edited": false,
                    "author_flair_css_class": "",
                    "author_flair_richtext": [],
                    "gildings": {},
                    "post_hint": "rich:video",
                    "content_categories": null,
                    "is_self": false,
                    "mod_note": null,
                    "created": 1509913446.0,
                    "link_flair_type": "text",
                    "wls": null,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "text",
                    "domain": "youtube.com",
                    "allow_live_comments": false,
                    "selftext_html": null,
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "url_overridden_by_dest": "https://www.youtube.com/watch?v=qu3eV_mLIqc",
                    "view_count": null,
                    "archived": false,
                    "no_follow": false,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "preview": {
                        "images": [
                            {
                                "source": {
                                    "url": "https://external-preview.redd.it/e_hazIU1XaiJJPGKPWfViXZzXncX-Goy9mjkoeMoWoA.jpg?auto=webp&amp;s=a541009d0afa05cf7a383bfd873cf05695497baa",
                                    "width": 480,
                                    "height": 360
                                },
                                "resolutions": [
                                    {
                                        "url": "https://external-preview.redd.it/e_hazIU1XaiJJPGKPWfViXZzXncX-Goy9mjkoeMoWoA.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=992e82c7b915d8caf81353b6e07abcfdb3a62507",
                                        "width": 108,
                                        "height": 81
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/e_hazIU1XaiJJPGKPWfViXZzXncX-Goy9mjkoeMoWoA.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=728df1c541d6ffa5af5b14336d8693e126e10794",
                                        "width": 216,
                                        "height": 162
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/e_hazIU1XaiJJPGKPWfViXZzXncX-Goy9mjkoeMoWoA.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=06d6e441e2fdb758b91e4cbff6d37039923187bd",
                                        "width": 320,
                                        "height": 240
                                    }
                                ],
                                "variants": {},
                                "id": "-C75tJtgNQBXufJDzdY6qb3zVtPz2UQ9bLD3rmcBtwI"
                            }
                        ],
                        "enabled": false
                    },
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "can_gild": false,
                    "spoiler": false,
                    "locked": false,
                    "author_flair_text": "JAFC YOU LAZY BIRD",
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_3bg30",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": null,
                    "id": "7b02ec",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "DedicatedGraph",
                    "discussion_type": null,
                    "num_comments": 1,
                    "send_replies": true,
                    "whitelist_status": null,
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": "dark",
                    "permalink": "/r/Freebuild/comments/7b02ec/jafcfielf_3_return_of_the_free_bird/",
                    "parent_whitelist_status": null,
                    "stickied": false,
                    "url": "https://www.youtube.com/watch?v=qu3eV_mLIqc",
                    "subreddit_subscribers": 219,
                    "created_utc": 1509913446.0,
                    "num_crossposts": 0,
                    "media": {
                        "type": "youtube.com",
                        "oembed": {
                            "provider_url": "https://www.youtube.com/",
                            "version": "1.0",
                            "title": "jafcfielf 3: return of the free bird",
                            "type": "video",
                            "thumbnail_width": 480,
                            "height": 200,
                            "width": 356,
                            "html": "&lt;iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/qu3eV_mLIqc?feature=oembed&amp;enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"jafcfielf 3: return of the free bird\"&gt;&lt;/iframe&gt;",
                            "author_name": "DedicatedGraph6",
                            "provider_name": "YouTube",
                            "thumbnail_url": "https://i.ytimg.com/vi/qu3eV_mLIqc/hqdefault.jpg",
                            "thumbnail_height": 360,
                            "author_url": "https://www.youtube.com/@DedicatedGraph6"
                        }
                    },
                    "is_video": false
                }
            },
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "Freebuild",
                    "selftext": "So, as you may have heard, Ballonz_ got released today after 561 days. PFFFFFFFFFFFFF. It's finally here. In the plot, Orb creates a project and calls it the Mechanic Project, and never works on it for 5 months. At the end, [Just A Friendly Computer reminds Orb of his Mechanic Project.](https://www.dropbox.com/sh/h045f490mmunmic/AADKGa_6kpVYQmcUFWZEbRq4a?dl=0&amp;preview=73.png)\n\n\n\n\n\n\n\n\n\n\n\n\nJust A Friendly Computer's words inspire Orb to get back to work and stop being such a lazy lazy goose.\n\n\n\n\n\n\n\n\n\n\n\nHere's my theory: It hit me, while I was at the movies seeing Thor: Ragnarok (it was fucking funny go see it), and I realized: Just A Friendly Computer's words sounded all too similar to Psy's lack of motivation to finish Ballonz_. Like how he left his projects behind. I think that the meaning behind this first episode of Ballonz_ is Psy basically saying: *It's not dead yet.* It's then that Orb goes to Psy and says he's gonna bring it to life. This, in my opinion, symbolizes basically Psy saying: *Okay, I'm gonna do this.* This comic is telling us that Ballonz_ is gonna be brought to life. This comic means that Psy's found motivation; He's about to show us what he's got. Let's just see where this goes next.",
                    "author_fullname": "t2_y6opy",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "BALLONZ_ THEORY: The meaning behind it (SPOILERS)",
                    "link_flair_richtext": [],
                    "subreddit_name_prefixed": "r/Freebuild",
                    "hidden": false,
                    "pwls": null,
                    "link_flair_css_class": null,
                    "downs": 0,
                    "thumbnail_height": null,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_7aurko",
                    "quarantine": false,
                    "link_flair_text_color": "dark",
                    "upvote_ratio": 1.0,
                    "author_flair_background_color": "",
                    "subreddit_type": "public",
                    "ups": 2,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "thumbnail_width": null,
                    "author_flair_template_id": null,
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": null,
                    "is_reddit_media_domain": false,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": null,
                    "can_mod_post": false,
                    "score": 2,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "spoiler",
                    "edited": 1509845454.0,
                    "author_flair_css_class": "",
                    "author_flair_richtext": [],
                    "gildings": {},
                    "post_hint": "self",
                    "content_categories": null,
                    "is_self": true,
                    "mod_note": null,
                    "created": 1509845274.0,
                    "link_flair_type": "text",
                    "wls": null,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "text",
                    "domain": "self.Freebuild",
                    "allow_live_comments": false,
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So, as you may have heard, Ballonz_ got released today after 561 days. PFFFFFFFFFFFFF. It&amp;#39;s finally here. In the plot, Orb creates a project and calls it the Mechanic Project, and never works on it for 5 months. At the end, &lt;a href=\"https://www.dropbox.com/sh/h045f490mmunmic/AADKGa_6kpVYQmcUFWZEbRq4a?dl=0&amp;amp;preview=73.png\"&gt;Just A Friendly Computer reminds Orb of his Mechanic Project.&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Just A Friendly Computer&amp;#39;s words inspire Orb to get back to work and stop being such a lazy lazy goose.&lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s my theory: It hit me, while I was at the movies seeing Thor: Ragnarok (it was fucking funny go see it), and I realized: Just A Friendly Computer&amp;#39;s words sounded all too similar to Psy&amp;#39;s lack of motivation to finish Ballonz&lt;em&gt;. Like how he left his projects behind. I think that the meaning behind this first episode of Ballonz&lt;/em&gt; is Psy basically saying: &lt;em&gt;It&amp;#39;s not dead yet.&lt;/em&gt; It&amp;#39;s then that Orb goes to Psy and says he&amp;#39;s gonna bring it to life. This, in my opinion, symbolizes basically Psy saying: &lt;em&gt;Okay, I&amp;#39;m gonna do this.&lt;/em&gt; This comic is telling us that Ballonz_ is gonna be brought to life. This comic means that Psy&amp;#39;s found motivation; He&amp;#39;s about to show us what he&amp;#39;s got. Let&amp;#39;s just see where this goes next.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "view_count": null,
                    "archived": false,
                    "no_follow": false,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "preview": {
                        "images": [
                            {
                                "source": {
                                    "url": "https://external-preview.redd.it/TvkcJbPb4g3bfVw1VZxAWRZsTGcb2ebTA3Zb1XQpZug.jpg?auto=webp&amp;s=0940524bf5093abacd15a0397f0860f087855518",
                                    "width": 214,
                                    "height": 200
                                },
                                "resolutions": [
                                    {
                                        "url": "https://external-preview.redd.it/TvkcJbPb4g3bfVw1VZxAWRZsTGcb2ebTA3Zb1XQpZug.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=9218826f37cf6d109d1ce7cc62cc7db59a164cf0",
                                        "width": 108,
                                        "height": 100
                                    }
                                ],
                                "variants": {
                                    "obfuscated": {
                                        "source": {
                                            "url": "https://external-preview.redd.it/TvkcJbPb4g3bfVw1VZxAWRZsTGcb2ebTA3Zb1XQpZug.jpg?blur=40&amp;format=pjpg&amp;auto=webp&amp;s=a30bcc750eaf9402858da2f2030c0fe2dccbde54",
                                            "width": 214,
                                            "height": 200
                                        },
                                        "resolutions": [
                                            {
                                                "url": "https://external-preview.redd.it/TvkcJbPb4g3bfVw1VZxAWRZsTGcb2ebTA3Zb1XQpZug.jpg?width=108&amp;crop=smart&amp;blur=10&amp;format=pjpg&amp;auto=webp&amp;s=0cdb8193fa5cf7702902d8d76f7e027a0f94b1a0",
                                                "width": 108,
                                                "height": 100
                                            }
                                        ]
                                    }
                                },
                                "id": "oBvWbmqIqOUtK1BQDdGCT8B01GJ2hixxE3ydsWaBgWw"
                            }
                        ],
                        "enabled": false
                    },
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "can_gild": false,
                    "spoiler": true,
                    "locked": false,
                    "author_flair_text": "Oldfag",
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_3bg30",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": "",
                    "id": "7aurko",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "DrydonTheAlt",
                    "discussion_type": null,
                    "num_comments": 9,
                    "send_replies": true,
                    "whitelist_status": null,
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": "dark",
                    "permalink": "/r/Freebuild/comments/7aurko/ballonz_theory_the_meaning_behind_it_spoilers/",
                    "parent_whitelist_status": null,
                    "stickied": false,
                    "url": "https://old.reddit.com/r/Freebuild/comments/7aurko/ballonz_theory_the_meaning_behind_it_spoilers/",
                    "subreddit_subscribers": 219,
                    "created_utc": 1509845274.0,
                    "num_crossposts": 0,
                    "media": null,
                    "is_video": false
                }
            },
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "Freebuild",
                    "selftext": "",
                    "author_fullname": "t2_kdd3f",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "Ballonz_",
                    "link_flair_richtext": [],
                    "subreddit_name_prefixed": "r/Freebuild",
                    "hidden": false,
                    "pwls": null,
                    "link_flair_css_class": "",
                    "downs": 0,
                    "thumbnail_height": 73,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_7ascih",
                    "quarantine": false,
                    "link_flair_text_color": null,
                    "upvote_ratio": 0.6,
                    "author_flair_background_color": "",
                    "subreddit_type": "public",
                    "ups": 3,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "thumbnail_width": 140,
                    "author_flair_template_id": null,
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": null,
                    "is_reddit_media_domain": false,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": "HOLY SHIT",
                    "can_mod_post": false,
                    "score": 3,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "https://b.thumbs.redditmedia.com/ff8aVeoYyFWF6UdrfqoretG17M_-jQL-xUw2rHpsvbY.jpg",
                    "edited": false,
                    "author_flair_css_class": "",
                    "author_flair_richtext": [],
                    "gildings": {},
                    "post_hint": "link",
                    "content_categories": null,
                    "is_self": false,
                    "mod_note": null,
                    "created": 1509820001.0,
                    "link_flair_type": "text",
                    "wls": null,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "text",
                    "domain": "dropbox.com",
                    "allow_live_comments": false,
                    "selftext_html": null,
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "url_overridden_by_dest": "https://www.dropbox.com/sh/h045f490mmunmic/AADKGa_6kpVYQmcUFWZEbRq4a?dl=0",
                    "view_count": null,
                    "archived": false,
                    "no_follow": false,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "preview": {
                        "images": [
                            {
                                "source": {
                                    "url": "https://external-preview.redd.it/-TVxgyJdtvEdWNkakv359UsN57QfGVZjcKm9vDnTDKk.jpg?auto=webp&amp;s=b4389c7fde51647046286a18b582dc849b3536bd",
                                    "width": 1200,
                                    "height": 630
                                },
                                "resolutions": [
                                    {
                                        "url": "https://external-preview.redd.it/-TVxgyJdtvEdWNkakv359UsN57QfGVZjcKm9vDnTDKk.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=6b78f16426e9e5af0ae59bb5ded0b51400acf3c1",
                                        "width": 108,
                                        "height": 56
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/-TVxgyJdtvEdWNkakv359UsN57QfGVZjcKm9vDnTDKk.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=790f62d66a4c3e37933cf1931ab651306ffaa186",
                                        "width": 216,
                                        "height": 113
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/-TVxgyJdtvEdWNkakv359UsN57QfGVZjcKm9vDnTDKk.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=0b518a9dc7eb81631982637d479fc5dba3d4b289",
                                        "width": 320,
                                        "height": 168
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/-TVxgyJdtvEdWNkakv359UsN57QfGVZjcKm9vDnTDKk.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=8b00c977e2602450c6bbc42e63a1f315cdb9536f",
                                        "width": 640,
                                        "height": 336
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/-TVxgyJdtvEdWNkakv359UsN57QfGVZjcKm9vDnTDKk.jpg?width=960&amp;crop=smart&amp;auto=webp&amp;s=b99f399f867fa2a6155b48512495c1994759d297",
                                        "width": 960,
                                        "height": 504
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/-TVxgyJdtvEdWNkakv359UsN57QfGVZjcKm9vDnTDKk.jpg?width=1080&amp;crop=smart&amp;auto=webp&amp;s=7ff0e2f906b63d6b623ec79489457ee12580471f",
                                        "width": 1080,
                                        "height": 567
                                    }
                                ],
                                "variants": {},
                                "id": "0t81auQfG-oTG2SFkYpA1C4Wm5HrCKgz_eoNNgs3ysg"
                            }
                        ],
                        "enabled": false
                    },
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "can_gild": false,
                    "spoiler": false,
                    "locked": false,
                    "author_flair_text": "Head-owner++",
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_3bg30",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": null,
                    "id": "7ascih",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "Ballonz_Boy",
                    "discussion_type": null,
                    "num_comments": 1,
                    "send_replies": true,
                    "whitelist_status": null,
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": "dark",
                    "permalink": "/r/Freebuild/comments/7ascih/ballonz/",
                    "parent_whitelist_status": null,
                    "stickied": false,
                    "url": "https://www.dropbox.com/sh/h045f490mmunmic/AADKGa_6kpVYQmcUFWZEbRq4a?dl=0",
                    "subreddit_subscribers": 219,
                    "created_utc": 1509820001.0,
                    "num_crossposts": 0,
                    "media": null,
                    "is_video": false
                }
            },
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "Freebuild",
                    "selftext": "",
                    "author_fullname": "t2_kdd3f",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "Psy and JAFT - Episode 1",
                    "link_flair_richtext": [],
                    "subreddit_name_prefixed": "r/Freebuild",
                    "hidden": false,
                    "pwls": null,
                    "link_flair_css_class": "",
                    "downs": 0,
                    "thumbnail_height": 73,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_7aqv43",
                    "quarantine": false,
                    "link_flair_text_color": null,
                    "upvote_ratio": 0.58,
                    "author_flair_background_color": "",
                    "subreddit_type": "public",
                    "ups": 2,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "thumbnail_width": 140,
                    "author_flair_template_id": null,
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": null,
                    "is_reddit_media_domain": false,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": "COMIC",
                    "can_mod_post": false,
                    "score": 2,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "https://b.thumbs.redditmedia.com/YbKzcAPOaCfTr3gkKTHis9sVnm0fPUaVE418z2o2y-I.jpg",
                    "edited": false,
                    "author_flair_css_class": "",
                    "author_flair_richtext": [],
                    "gildings": {},
                    "post_hint": "link",
                    "content_categories": null,
                    "is_self": false,
                    "mod_note": null,
                    "created": 1509804993.0,
                    "link_flair_type": "text",
                    "wls": null,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "text",
                    "domain": "dropbox.com",
                    "allow_live_comments": false,
                    "selftext_html": null,
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "url_overridden_by_dest": "https://www.dropbox.com/sh/uq2dum3azbkjh9z/AABFnK09q-yuu8QEw-aSStKXa?dl=0",
                    "view_count": null,
                    "archived": false,
                    "no_follow": false,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "preview": {
                        "images": [
                            {
                                "source": {
                                    "url": "https://external-preview.redd.it/IO_BdoatG-8oNzkuFKVqb8hIlU-64hSipHaJr2mLxRw.jpg?auto=webp&amp;s=3b4754523fa6a4dc8508f089a1ffdb97482d2e5c",
                                    "width": 1200,
                                    "height": 630
                                },
                                "resolutions": [
                                    {
                                        "url": "https://external-preview.redd.it/IO_BdoatG-8oNzkuFKVqb8hIlU-64hSipHaJr2mLxRw.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=2103d989f676795808fa5141069076014a9087b4",
                                        "width": 108,
                                        "height": 56
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/IO_BdoatG-8oNzkuFKVqb8hIlU-64hSipHaJr2mLxRw.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=11f981ef16ad3308763573ca4b4808c4a48e3697",
                                        "width": 216,
                                        "height": 113
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/IO_BdoatG-8oNzkuFKVqb8hIlU-64hSipHaJr2mLxRw.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=ec440d55bbdecb5f022fb5ba270fb41af5b06eba",
                                        "width": 320,
                                        "height": 168
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/IO_BdoatG-8oNzkuFKVqb8hIlU-64hSipHaJr2mLxRw.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=7c8343fd0faf2df3ee9498b132621c4896c75025",
                                        "width": 640,
                                        "height": 336
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/IO_BdoatG-8oNzkuFKVqb8hIlU-64hSipHaJr2mLxRw.jpg?width=960&amp;crop=smart&amp;auto=webp&amp;s=739b4cff4369d7f864d20f7d917a340bd39c9965",
                                        "width": 960,
                                        "height": 504
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/IO_BdoatG-8oNzkuFKVqb8hIlU-64hSipHaJr2mLxRw.jpg?width=1080&amp;crop=smart&amp;auto=webp&amp;s=d0e594b232e6b17fa44ec4c215e922cfeaf5a9dc",
                                        "width": 1080,
                                        "height": 567
                                    }
                                ],
                                "variants": {},
                                "id": "0t81auQfG-oTG2SFkYpA1C4Wm5HrCKgz_eoNNgs3ysg"
                            }
                        ],
                        "enabled": false
                    },
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "can_gild": false,
                    "spoiler": false,
                    "locked": false,
                    "author_flair_text": "Head-owner++",
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_3bg30",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": null,
                    "id": "7aqv43",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "Ballonz_Boy",
                    "discussion_type": null,
                    "num_comments": 2,
                    "send_replies": true,
                    "whitelist_status": null,
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": "dark",
                    "permalink": "/r/Freebuild/comments/7aqv43/psy_and_jaft_episode_1/",
                    "parent_whitelist_status": null,
                    "stickied": false,
                    "url": "https://www.dropbox.com/sh/uq2dum3azbkjh9z/AABFnK09q-yuu8QEw-aSStKXa?dl=0",
                    "subreddit_subscribers": 219,
                    "created_utc": 1509804993.0,
                    "num_crossposts": 0,
                    "media": null,
                    "is_video": false
                }
            },
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "Freebuild",
                    "selftext": "",
                    "author_fullname": "t2_kdd3f",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "PARADOX - 01",
                    "link_flair_richtext": [],
                    "subreddit_name_prefixed": "r/Freebuild",
                    "hidden": false,
                    "pwls": null,
                    "link_flair_css_class": "",
                    "downs": 0,
                    "thumbnail_height": 73,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_7ahjjl",
                    "quarantine": false,
                    "link_flair_text_color": null,
                    "upvote_ratio": 0.58,
                    "author_flair_background_color": "",
                    "subreddit_type": "public",
                    "ups": 2,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "thumbnail_width": 140,
                    "author_flair_template_id": null,
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": null,
                    "is_reddit_media_domain": false,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": "COMIC!!!!!!!",
                    "can_mod_post": false,
                    "score": 2,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "https://b.thumbs.redditmedia.com/79qDWhCNnbuPM8YZzZevlKPjlvZbjDXtOT331G66-ko.jpg",
                    "edited": false,
                    "author_flair_css_class": "",
                    "author_flair_richtext": [],
                    "gildings": {},
                    "post_hint": "link",
                    "content_categories": null,
                    "is_self": false,
                    "mod_note": null,
                    "created": 1509688611.0,
                    "link_flair_type": "text",
                    "wls": null,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "text",
                    "domain": "dropbox.com",
                    "allow_live_comments": false,
                    "selftext_html": null,
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "url_overridden_by_dest": "https://www.dropbox.com/sh/uuxm8l7earr20ae/AACNMDGCyGlIOTi3aNi7g-yJa?dl=0",
                    "view_count": null,
                    "archived": false,
                    "no_follow": false,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "preview": {
                        "images": [
                            {
                                "source": {
                                    "url": "https://external-preview.redd.it/IO_BdoatG-8oNzkuFKVqb8hIlU-64hSipHaJr2mLxRw.jpg?auto=webp&amp;s=3b4754523fa6a4dc8508f089a1ffdb97482d2e5c",
                                    "width": 1200,
                                    "height": 630
                                },
                                "resolutions": [
                                    {
                                        "url": "https://external-preview.redd.it/IO_BdoatG-8oNzkuFKVqb8hIlU-64hSipHaJr2mLxRw.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=2103d989f676795808fa5141069076014a9087b4",
                                        "width": 108,
                                        "height": 56
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/IO_BdoatG-8oNzkuFKVqb8hIlU-64hSipHaJr2mLxRw.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=11f981ef16ad3308763573ca4b4808c4a48e3697",
                                        "width": 216,
                                        "height": 113
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/IO_BdoatG-8oNzkuFKVqb8hIlU-64hSipHaJr2mLxRw.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=ec440d55bbdecb5f022fb5ba270fb41af5b06eba",
                                        "width": 320,
                                        "height": 168
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/IO_BdoatG-8oNzkuFKVqb8hIlU-64hSipHaJr2mLxRw.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=7c8343fd0faf2df3ee9498b132621c4896c75025",
                                        "width": 640,
                                        "height": 336
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/IO_BdoatG-8oNzkuFKVqb8hIlU-64hSipHaJr2mLxRw.jpg?width=960&amp;crop=smart&amp;auto=webp&amp;s=739b4cff4369d7f864d20f7d917a340bd39c9965",
                                        "width": 960,
                                        "height": 504
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/IO_BdoatG-8oNzkuFKVqb8hIlU-64hSipHaJr2mLxRw.jpg?width=1080&amp;crop=smart&amp;auto=webp&amp;s=d0e594b232e6b17fa44ec4c215e922cfeaf5a9dc",
                                        "width": 1080,
                                        "height": 567
                                    }
                                ],
                                "variants": {},
                                "id": "0t81auQfG-oTG2SFkYpA1C4Wm5HrCKgz_eoNNgs3ysg"
                            }
                        ],
                        "enabled": false
                    },
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "can_gild": false,
                    "spoiler": false,
                    "locked": false,
                    "author_flair_text": "Head-owner++",
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_3bg30",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": null,
                    "id": "7ahjjl",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "Ballonz_Boy",
                    "discussion_type": null,
                    "num_comments": 3,
                    "send_replies": true,
                    "whitelist_status": null,
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": "dark",
                    "permalink": "/r/Freebuild/comments/7ahjjl/paradox_01/",
                    "parent_whitelist_status": null,
                    "stickied": false,
                    "url": "https://www.dropbox.com/sh/uuxm8l7earr20ae/AACNMDGCyGlIOTi3aNi7g-yJa?dl=0",
                    "subreddit_subscribers": 219,
                    "created_utc": 1509688611.0,
                    "num_crossposts": 0,
                    "media": null,
                    "is_video": false
                }
            },
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "Freebuild",
                    "selftext": "You may be thinking here, *what is this doing here*? Well, I'd like to introduce to you: The Psylore Package. A 3-day release schedule of comic releases, all by me and all in Psylore. Starting tonight, Day 1 will release, tomorrow will be Day 2, and so forth.\n\n#[DAY 1](https://i.imgur.com/gtG6xTP.png)       \n*There's something lurking across time and space. He discovered it, and he has to find a way to fix it.*\n\n*How? Through traveling across time.*\n\nParadox (also originally known as Freddit: Paradox) is a miniseries documenting a time travel adventure around Freddit. A time machine test session goes horribly wrong as Psy arrives in the future, discovering a threat to the server.\nThe only way to help fix it is to gather Fredditors from all time periods, to build something huge.\n\n[PARADOX - 01](https://www.dropbox.com/sh/uuxm8l7earr20ae/AACNMDGCyGlIOTi3aNi7g-yJa?dl=0)\n#DAY 2 - Psy and JAFT\n*You didn't expect this one, did you?*\n\n[Psy and JAFT](https://www.dropbox.com/sh/uq2dum3azbkjh9z/AABFnK09q-yuu8QEw-aSStKXa?dl=0)\n#DAY 3 - Ballonz_\n[No explanation needed](https://www.dropbox.com/sh/h045f490mmunmic/AADKGa_6kpVYQmcUFWZEbRq4a?dl=0)\n\nStay tuned for daily updates.\n\nThese are all coming to their dedicated release dates, no delays or cancellations.\n\n^^^^^^^^Also ^^^^^^^^Dry ^^^^^^^^told ^^^^^^^^me ^^^^^^^^if ^^^^^^^^I ^^^^^^^^didn't ^^^^^^^^release ^^^^^^^^these ^^^^^^^^on ^^^^^^^^time ^^^^^^^^I ^^^^^^^^would ^^^^^^^^have ^^^^^^^^to ^^^^^^^^record ^^^^^^^^myself ^^^^^^^^dabbing ^^^^^^^^until ^^^^^^^^I ^^^^^^^^pass ^^^^^^^^out",
                    "author_fullname": "t2_kdd3f",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "The Psylore Package",
                    "link_flair_richtext": [],
                    "subreddit_name_prefixed": "r/Freebuild",
                    "hidden": false,
                    "pwls": null,
                    "link_flair_css_class": "",
                    "downs": 0,
                    "thumbnail_height": null,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_7ac8xi",
                    "quarantine": false,
                    "link_flair_text_color": null,
                    "upvote_ratio": 1.0,
                    "author_flair_background_color": "",
                    "subreddit_type": "public",
                    "ups": 2,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "thumbnail_width": null,
                    "author_flair_template_id": null,
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": null,
                    "is_reddit_media_domain": false,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": "COMIC",
                    "can_mod_post": false,
                    "score": 2,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "self",
                    "edited": 1509820346.0,
                    "author_flair_css_class": "",
                    "author_flair_richtext": [],
                    "gildings": {},
                    "post_hint": "self",
                    "content_categories": null,
                    "is_self": true,
                    "mod_note": null,
                    "created": 1509636463.0,
                    "link_flair_type": "text",
                    "wls": null,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "text",
                    "domain": "self.Freebuild",
                    "allow_live_comments": false,
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;You may be thinking here, &lt;em&gt;what is this doing here&lt;/em&gt;? Well, I&amp;#39;d like to introduce to you: The Psylore Package. A 3-day release schedule of comic releases, all by me and all in Psylore. Starting tonight, Day 1 will release, tomorrow will be Day 2, and so forth.&lt;/p&gt;\n\n&lt;h1&gt;&lt;a href=\"https://i.imgur.com/gtG6xTP.png\"&gt;DAY 1&lt;/a&gt;&lt;/h1&gt;\n\n&lt;p&gt;&lt;em&gt;There&amp;#39;s something lurking across time and space. He discovered it, and he has to find a way to fix it.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;How? Through traveling across time.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Paradox (also originally known as Freddit: Paradox) is a miniseries documenting a time travel adventure around Freddit. A time machine test session goes horribly wrong as Psy arrives in the future, discovering a threat to the server.\nThe only way to help fix it is to gather Fredditors from all time periods, to build something huge.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.dropbox.com/sh/uuxm8l7earr20ae/AACNMDGCyGlIOTi3aNi7g-yJa?dl=0\"&gt;PARADOX - 01&lt;/a&gt;&lt;/p&gt;\n\n&lt;h1&gt;DAY 2 - Psy and JAFT&lt;/h1&gt;\n\n&lt;p&gt;&lt;em&gt;You didn&amp;#39;t expect this one, did you?&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.dropbox.com/sh/uq2dum3azbkjh9z/AABFnK09q-yuu8QEw-aSStKXa?dl=0\"&gt;Psy and JAFT&lt;/a&gt;&lt;/p&gt;\n\n&lt;h1&gt;DAY 3 - Ballonz_&lt;/h1&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.dropbox.com/sh/h045f490mmunmic/AADKGa_6kpVYQmcUFWZEbRq4a?dl=0\"&gt;No explanation needed&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Stay tuned for daily updates.&lt;/p&gt;\n\n&lt;p&gt;These are all coming to their dedicated release dates, no delays or cancellations.&lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;Also&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;Dry&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;told&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;me&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;if&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;I&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;didn&amp;#39;t&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;release&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;these&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;on&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;time&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;I&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;would&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;have&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;to&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;record&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;myself&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;dabbing&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;until&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;I&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;pass&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;out&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "view_count": null,
                    "archived": false,
                    "no_follow": false,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "preview": {
                        "images": [
                            {
                                "source": {
                                    "url": "https://external-preview.redd.it/n4uYrifzqP_7-cGdBGJDfs523BFgqvqg4J_S196bCGU.png?auto=webp&amp;s=05cbe684ab01a8c3271b46cb02cfda2274ae6bc2",
                                    "width": 1593,
                                    "height": 1541
                                },
                                "resolutions": [
                                    {
                                        "url": "https://external-preview.redd.it/n4uYrifzqP_7-cGdBGJDfs523BFgqvqg4J_S196bCGU.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=a03f673b66f2662971d698b0b779e8190c9fe762",
                                        "width": 108,
                                        "height": 104
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/n4uYrifzqP_7-cGdBGJDfs523BFgqvqg4J_S196bCGU.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=c4d12afdc05c1dd1d163f80a3fb8ddddc952e933",
                                        "width": 216,
                                        "height": 208
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/n4uYrifzqP_7-cGdBGJDfs523BFgqvqg4J_S196bCGU.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=ff31ab224757cf4effaad1a4ba41da6dd6e88250",
                                        "width": 320,
                                        "height": 309
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/n4uYrifzqP_7-cGdBGJDfs523BFgqvqg4J_S196bCGU.png?width=640&amp;crop=smart&amp;auto=webp&amp;s=dd7fde596848fbee4bd86fe2c5dcb804cb9c6cd8",
                                        "width": 640,
                                        "height": 619
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/n4uYrifzqP_7-cGdBGJDfs523BFgqvqg4J_S196bCGU.png?width=960&amp;crop=smart&amp;auto=webp&amp;s=4bca6e6a41b34dba937362ef7bb424011ad3c93a",
                                        "width": 960,
                                        "height": 928
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/n4uYrifzqP_7-cGdBGJDfs523BFgqvqg4J_S196bCGU.png?width=1080&amp;crop=smart&amp;auto=webp&amp;s=f49c99f363d06a24f7269e22d1c896015faf44a7",
                                        "width": 1080,
                                        "height": 1044
                                    }
                                ],
                                "variants": {},
                                "id": "BkZCIxjelVNZNEkUtJS8LhEsYONaHZ1zJxR6OUErE0c"
                            }
                        ],
                        "enabled": false
                    },
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "can_gild": false,
                    "spoiler": false,
                    "locked": false,
                    "author_flair_text": "Head-owner++",
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_3bg30",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": null,
                    "id": "7ac8xi",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "Ballonz_Boy",
                    "discussion_type": null,
                    "num_comments": 3,
                    "send_replies": true,
                    "whitelist_status": null,
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": "dark",
                    "permalink": "/r/Freebuild/comments/7ac8xi/the_psylore_package/",
                    "parent_whitelist_status": null,
                    "stickied": false,
                    "url": "https://old.reddit.com/r/Freebuild/comments/7ac8xi/the_psylore_package/",
                    "subreddit_subscribers": 219,
                    "created_utc": 1509636463.0,
                    "num_crossposts": 0,
                    "media": null,
                    "is_video": false
                }
            },
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "Freebuild",
                    "selftext": "chris said it was unfair for jafc and waving to ask for pseudowner and they got an opinion collector megathread thing so he wants me to do this chris please let my family go i did it i posted this you can let them go now thanks\n\nalso, here's the campaign video https://www.youtube.com/watch?v=C32FsBhX7SU\n\nthoughts below",
                    "author_fullname": "t2_hsaxm",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "megathread 2 i guess",
                    "link_flair_richtext": [],
                    "subreddit_name_prefixed": "r/Freebuild",
                    "hidden": false,
                    "pwls": null,
                    "link_flair_css_class": null,
                    "downs": 0,
                    "thumbnail_height": null,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_78yblv",
                    "quarantine": false,
                    "link_flair_text_color": "dark",
                    "upvote_ratio": 0.67,
                    "author_flair_background_color": "",
                    "subreddit_type": "public",
                    "ups": 2,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "thumbnail_width": null,
                    "author_flair_template_id": null,
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": null,
                    "is_reddit_media_domain": false,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": null,
                    "can_mod_post": false,
                    "score": 2,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "self",
                    "edited": false,
                    "author_flair_css_class": null,
                    "author_flair_richtext": [],
                    "gildings": {},
                    "post_hint": "self",
                    "content_categories": null,
                    "is_self": true,
                    "mod_note": null,
                    "created": 1509049541.0,
                    "link_flair_type": "text",
                    "wls": null,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "text",
                    "domain": "self.Freebuild",
                    "allow_live_comments": false,
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;chris said it was unfair for jafc and waving to ask for pseudowner and they got an opinion collector megathread thing so he wants me to do this chris please let my family go i did it i posted this you can let them go now thanks&lt;/p&gt;\n\n&lt;p&gt;also, here&amp;#39;s the campaign video &lt;a href=\"https://www.youtube.com/watch?v=C32FsBhX7SU\"&gt;https://www.youtube.com/watch?v=C32FsBhX7SU&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;thoughts below&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "view_count": null,
                    "archived": false,
                    "no_follow": false,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "preview": {
                        "images": [
                            {
                                "source": {
                                    "url": "https://external-preview.redd.it/DOh2YkgP5QhEscs1qnzQGecNQs9vvouMae9mGTxQYYA.jpg?auto=webp&amp;s=30ab1fada758c3041b754cbb905d952a97022cd5",
                                    "width": 480,
                                    "height": 360
                                },
                                "resolutions": [
                                    {
                                        "url": "https://external-preview.redd.it/DOh2YkgP5QhEscs1qnzQGecNQs9vvouMae9mGTxQYYA.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=327ea6d81282c16bbabb38ad0446c6b4a0d2a58d",
                                        "width": 108,
                                        "height": 81
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/DOh2YkgP5QhEscs1qnzQGecNQs9vvouMae9mGTxQYYA.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=d59ac56737093fe422eeb57de2e653288ca491b4",
                                        "width": 216,
                                        "height": 162
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/DOh2YkgP5QhEscs1qnzQGecNQs9vvouMae9mGTxQYYA.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=78bed0d6a751d71f5cc33af0c84f29c472a5e821",
                                        "width": 320,
                                        "height": 240
                                    }
                                ],
                                "variants": {},
                                "id": "2yUybFyhgbOKQ2wCFJLt7vBCmj7nEnfKfCrQEehziBk"
                            }
                        ],
                        "enabled": false
                    },
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "can_gild": false,
                    "spoiler": false,
                    "locked": false,
                    "author_flair_text": "T.B.C",
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_3bg30",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": "",
                    "id": "78yblv",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "Zoocanadanda",
                    "discussion_type": null,
                    "num_comments": 5,
                    "send_replies": true,
                    "whitelist_status": null,
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": "dark",
                    "permalink": "/r/Freebuild/comments/78yblv/megathread_2_i_guess/",
                    "parent_whitelist_status": null,
                    "stickied": false,
                    "url": "https://old.reddit.com/r/Freebuild/comments/78yblv/megathread_2_i_guess/",
                    "subreddit_subscribers": 219,
                    "created_utc": 1509049541.0,
                    "num_crossposts": 0,
                    "media": null,
                    "is_video": false
                }
            },
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "Freebuild",
                    "selftext": "I know I terroized the server yesterdasy. But I have changed. I like to eat potatoes. I'm a nice, holy person. I do my homeworlk every night. Please let me back on the server.  My best friend went on my computewr and did the trolling. It wasn't me. Please let me appeal. :) :)",
                    "author_fullname": "t2_1m8owx",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "I apeeal now",
                    "link_flair_richtext": [],
                    "subreddit_name_prefixed": "r/Freebuild",
                    "hidden": false,
                    "pwls": null,
                    "link_flair_css_class": null,
                    "downs": 0,
                    "thumbnail_height": null,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_78yg5t",
                    "quarantine": false,
                    "link_flair_text_color": "dark",
                    "upvote_ratio": 0.43,
                    "author_flair_background_color": null,
                    "subreddit_type": "public",
                    "ups": 0,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "thumbnail_width": null,
                    "author_flair_template_id": null,
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": null,
                    "is_reddit_media_domain": false,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": null,
                    "can_mod_post": false,
                    "score": 0,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "self",
                    "edited": false,
                    "author_flair_css_class": null,
                    "author_flair_richtext": [],
                    "gildings": {},
                    "content_categories": null,
                    "is_self": true,
                    "mod_note": null,
                    "created": 1509050668.0,
                    "link_flair_type": "text",
                    "wls": null,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "text",
                    "domain": "self.Freebuild",
                    "allow_live_comments": false,
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I know I terroized the server yesterdasy. But I have changed. I like to eat potatoes. I&amp;#39;m a nice, holy person. I do my homeworlk every night. Please let me back on the server.  My best friend went on my computewr and did the trolling. It wasn&amp;#39;t me. Please let me appeal. :) :)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "view_count": null,
                    "archived": false,
                    "no_follow": true,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "can_gild": false,
                    "spoiler": false,
                    "locked": false,
                    "author_flair_text": null,
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_3bg30",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": "",
                    "id": "78yg5t",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "BreaddieReturned",
                    "discussion_type": null,
                    "num_comments": 1,
                    "send_replies": false,
                    "whitelist_status": null,
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": null,
                    "permalink": "/r/Freebuild/comments/78yg5t/i_apeeal_now/",
                    "parent_whitelist_status": null,
                    "stickied": false,
                    "url": "https://old.reddit.com/r/Freebuild/comments/78yg5t/i_apeeal_now/",
                    "subreddit_subscribers": 219,
                    "created_utc": 1509050668.0,
                    "num_crossposts": 0,
                    "media": null,
                    "is_video": false
                }
            },
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "Freebuild",
                    "selftext": "Myn friend came over to my house. He used my account to troll and grief. Please appeal me. This is the true story.",
                    "author_fullname": "t2_1m8owx",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "The True Story of Yesterday",
                    "link_flair_richtext": [],
                    "subreddit_name_prefixed": "r/Freebuild",
                    "hidden": false,
                    "pwls": null,
                    "link_flair_css_class": null,
                    "downs": 0,
                    "thumbnail_height": null,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_78yl8x",
                    "quarantine": false,
                    "link_flair_text_color": "dark",
                    "upvote_ratio": 0.33,
                    "author_flair_background_color": null,
                    "subreddit_type": "public",
                    "ups": 0,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "thumbnail_width": null,
                    "author_flair_template_id": null,
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": null,
                    "is_reddit_media_domain": false,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": null,
                    "can_mod_post": false,
                    "score": 0,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "self",
                    "edited": false,
                    "author_flair_css_class": null,
                    "author_flair_richtext": [],
                    "gildings": {},
                    "content_categories": null,
                    "is_self": true,
                    "mod_note": null,
                    "created": 1509051894.0,
                    "link_flair_type": "text",
                    "wls": null,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "text",
                    "domain": "self.Freebuild",
                    "allow_live_comments": false,
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Myn friend came over to my house. He used my account to troll and grief. Please appeal me. This is the true story.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "view_count": null,
                    "archived": false,
                    "no_follow": true,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "can_gild": false,
                    "spoiler": false,
                    "locked": false,
                    "author_flair_text": null,
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_3bg30",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": "",
                    "id": "78yl8x",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "BreaddieReturned",
                    "discussion_type": null,
                    "num_comments": 4,
                    "send_replies": false,
                    "whitelist_status": null,
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": null,
                    "permalink": "/r/Freebuild/comments/78yl8x/the_true_story_of_yesterday/",
                    "parent_whitelist_status": null,
                    "stickied": false,
                    "url": "https://old.reddit.com/r/Freebuild/comments/78yl8x/the_true_story_of_yesterday/",
                    "subreddit_subscribers": 219,
                    "created_utc": 1509051894.0,
                    "num_crossposts": 0,
                    "media": null,
                    "is_video": false
                }
            },
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "Freebuild",
                    "selftext": "[JAFC and Waving's suggestion](https://pastebin.com/Gh1hgRCQ)\n\n[my thoughts + further explanation](https://imgur.com/25Lgdvx)\n\nPost your thoughts here instead of #general because it's getting too clogged up!\n\n**EDIT**: To clarify, this isnt happening unless a lot of people want Waving and JAFC as \"pseudowners\" then the arrangements will be done. **This is merely an opinion collector thing**. Aka a fucking megathread why did i even edit this shit",
                    "author_fullname": "t2_hsaxm",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "megathread i guess",
                    "link_flair_richtext": [],
                    "subreddit_name_prefixed": "r/Freebuild",
                    "hidden": false,
                    "pwls": null,
                    "link_flair_css_class": null,
                    "downs": 0,
                    "thumbnail_height": null,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_78rgcx",
                    "quarantine": false,
                    "link_flair_text_color": "dark",
                    "upvote_ratio": 0.83,
                    "author_flair_background_color": "",
                    "subreddit_type": "public",
                    "ups": 4,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "thumbnail_width": null,
                    "author_flair_template_id": null,
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": null,
                    "is_reddit_media_domain": false,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": null,
                    "can_mod_post": false,
                    "score": 4,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "self",
                    "edited": 1508972409.0,
                    "author_flair_css_class": null,
                    "author_flair_richtext": [],
                    "gildings": {},
                    "post_hint": "self",
                    "content_categories": null,
                    "is_self": true,
                    "mod_note": null,
                    "created": 1508972132.0,
                    "link_flair_type": "text",
                    "wls": null,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "text",
                    "domain": "self.Freebuild",
                    "allow_live_comments": false,
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"https://pastebin.com/Gh1hgRCQ\"&gt;JAFC and Waving&amp;#39;s suggestion&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://imgur.com/25Lgdvx\"&gt;my thoughts + further explanation&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Post your thoughts here instead of #general because it&amp;#39;s getting too clogged up!&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;EDIT&lt;/strong&gt;: To clarify, this isnt happening unless a lot of people want Waving and JAFC as &amp;quot;pseudowners&amp;quot; then the arrangements will be done. &lt;strong&gt;This is merely an opinion collector thing&lt;/strong&gt;. Aka a fucking megathread why did i even edit this shit&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "view_count": null,
                    "archived": false,
                    "no_follow": false,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "preview": {
                        "images": [
                            {
                                "source": {
                                    "url": "https://external-preview.redd.it/KhrUMhG076AVpuJhRlpIIO3TuX0K3ltanS7kDE3LR04.jpg?auto=webp&amp;s=837d295f6c9db48bc6ede7a400c37bb1aacb0d29",
                                    "width": 710,
                                    "height": 433
                                },
                                "resolutions": [
                                    {
                                        "url": "https://external-preview.redd.it/KhrUMhG076AVpuJhRlpIIO3TuX0K3ltanS7kDE3LR04.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=1ad857c99e5172c34b9de84668519a8f38618245",
                                        "width": 108,
                                        "height": 65
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/KhrUMhG076AVpuJhRlpIIO3TuX0K3ltanS7kDE3LR04.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=c24babd6a510eeea1b70271a9e262880f9deb840",
                                        "width": 216,
                                        "height": 131
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/KhrUMhG076AVpuJhRlpIIO3TuX0K3ltanS7kDE3LR04.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=36f34a35b7c6be6a5ae2148b2eb9cf3897255793",
                                        "width": 320,
                                        "height": 195
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/KhrUMhG076AVpuJhRlpIIO3TuX0K3ltanS7kDE3LR04.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=49e53dc3576d825c09486835f176c2184e108f5d",
                                        "width": 640,
                                        "height": 390
                                    }
                                ],
                                "variants": {},
                                "id": "RWeadAyEdxSHT3AyS0MEV18AIvFmi9jbtHyGCb3knaY"
                            }
                        ],
                        "enabled": false
                    },
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "can_gild": false,
                    "spoiler": false,
                    "locked": false,
                    "author_flair_text": "T.B.C",
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_3bg30",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": "",
                    "id": "78rgcx",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "Zoocanadanda",
                    "discussion_type": null,
                    "num_comments": 17,
                    "send_replies": true,
                    "whitelist_status": null,
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": "dark",
                    "permalink": "/r/Freebuild/comments/78rgcx/megathread_i_guess/",
                    "parent_whitelist_status": null,
                    "stickied": false,
                    "url": "https://old.reddit.com/r/Freebuild/comments/78rgcx/megathread_i_guess/",
                    "subreddit_subscribers": 219,
                    "created_utc": 1508972132.0,
                    "num_crossposts": 0,
                    "media": null,
                    "is_video": false
                }
            },
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "Freebuild",
                    "selftext": "",
                    "author_fullname": "t2_kdd3f",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "Time is running out",
                    "link_flair_richtext": [],
                    "subreddit_name_prefixed": "r/Freebuild",
                    "hidden": false,
                    "pwls": null,
                    "link_flair_css_class": "",
                    "downs": 0,
                    "thumbnail_height": 74,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_78rpfy",
                    "quarantine": false,
                    "link_flair_text_color": null,
                    "upvote_ratio": 0.67,
                    "author_flair_background_color": "",
                    "subreddit_type": "public",
                    "ups": 2,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "thumbnail_width": 140,
                    "author_flair_template_id": null,
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": null,
                    "is_reddit_media_domain": true,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": "???",
                    "can_mod_post": false,
                    "score": 2,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "https://a.thumbs.redditmedia.com/PCvBRF8AZbYY-Ik4QF2KR3QCKqad7ub9A0ZqIuhj3m4.jpg",
                    "edited": false,
                    "author_flair_css_class": "",
                    "author_flair_richtext": [],
                    "gildings": {},
                    "post_hint": "image",
                    "content_categories": null,
                    "is_self": false,
                    "mod_note": null,
                    "created": 1508974673.0,
                    "link_flair_type": "text",
                    "wls": null,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "text",
                    "domain": "i.redd.it",
                    "allow_live_comments": false,
                    "selftext_html": null,
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "url_overridden_by_dest": "https://i.redd.it/t0jdk2sva2uz.png",
                    "view_count": null,
                    "archived": false,
                    "no_follow": false,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "preview": {
                        "images": [
                            {
                                "source": {
                                    "url": "https://preview.redd.it/t0jdk2sva2uz.png?auto=webp&amp;s=7a6cf77377df3af7bddd3ea1bfa78f7cd111bc17",
                                    "width": 1920,
                                    "height": 1017
                                },
                                "resolutions": [
                                    {
                                        "url": "https://preview.redd.it/t0jdk2sva2uz.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=41a76703cc6c5b972760fca1aa3e541dd7a9698f",
                                        "width": 108,
                                        "height": 57
                                    },
                                    {
                                        "url": "https://preview.redd.it/t0jdk2sva2uz.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=08b57d0e091a2db9a3d0f95e78375606db335d58",
                                        "width": 216,
                                        "height": 114
                                    },
                                    {
                                        "url": "https://preview.redd.it/t0jdk2sva2uz.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=0c7d4f60aa724ec264d0d26913417e71a3f76c0c",
                                        "width": 320,
                                        "height": 169
                                    },
                                    {
                                        "url": "https://preview.redd.it/t0jdk2sva2uz.png?width=640&amp;crop=smart&amp;auto=webp&amp;s=d3f2aa2b4d3d77a23e50e3bfe863c294e3d894db",
                                        "width": 640,
                                        "height": 339
                                    },
                                    {
                                        "url": "https://preview.redd.it/t0jdk2sva2uz.png?width=960&amp;crop=smart&amp;auto=webp&amp;s=1652d2e3e3eddff991c8cc4b00b82f7a0df9d636",
                                        "width": 960,
                                        "height": 508
                                    },
                                    {
                                        "url": "https://preview.redd.it/t0jdk2sva2uz.png?width=1080&amp;crop=smart&amp;auto=webp&amp;s=f0880abafee3a05da8c70624378c885b086b0ac3",
                                        "width": 1080,
                                        "height": 572
                                    }
                                ],
                                "variants": {},
                                "id": "EKYb7VDzCVULsuarwNkSWMAQ4hIBMrlgYMQw9rg-4K0"
                            }
                        ],
                        "enabled": true
                    },
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "can_gild": false,
                    "spoiler": false,
                    "locked": false,
                    "author_flair_text": "Head-owner++",
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_3bg30",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": null,
                    "id": "78rpfy",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "Ballonz_Boy",
                    "discussion_type": null,
                    "num_comments": 4,
                    "send_replies": true,
                    "whitelist_status": null,
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": "dark",
                    "permalink": "/r/Freebuild/comments/78rpfy/time_is_running_out/",
                    "parent_whitelist_status": null,
                    "stickied": false,
                    "url": "https://i.redd.it/t0jdk2sva2uz.png",
                    "subreddit_subscribers": 219,
                    "created_utc": 1508974673.0,
                    "num_crossposts": 0,
                    "media": null,
                    "is_video": false
                }
            },
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "Freebuild",
                    "selftext": "",
                    "author_fullname": "t2_kdd3f",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "See the bigger picture",
                    "link_flair_richtext": [],
                    "subreddit_name_prefixed": "r/Freebuild",
                    "hidden": false,
                    "pwls": null,
                    "link_flair_css_class": "",
                    "downs": 0,
                    "thumbnail_height": 74,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_78smmx",
                    "quarantine": false,
                    "link_flair_text_color": null,
                    "upvote_ratio": 0.6,
                    "author_flair_background_color": "",
                    "subreddit_type": "public",
                    "ups": 1,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "thumbnail_width": 140,
                    "author_flair_template_id": null,
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": null,
                    "is_reddit_media_domain": true,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": "???",
                    "can_mod_post": false,
                    "score": 1,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "https://b.thumbs.redditmedia.com/cvJg-k4dETp87btjg1XrzAL4gzinEfgnE0l90_TwhsM.jpg",
                    "edited": false,
                    "author_flair_css_class": "",
                    "author_flair_richtext": [],
                    "gildings": {},
                    "post_hint": "image",
                    "content_categories": null,
                    "is_self": false,
                    "mod_note": null,
                    "created": 1508984354.0,
                    "link_flair_type": "text",
                    "wls": null,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "text",
                    "domain": "i.redd.it",
                    "allow_live_comments": false,
                    "selftext_html": null,
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "url_overridden_by_dest": "https://i.redd.it/yo796ywn33uz.png",
                    "view_count": null,
                    "archived": false,
                    "no_follow": true,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "preview": {
                        "images": [
                            {
                                "source": {
                                    "url": "https://preview.redd.it/yo796ywn33uz.png?auto=webp&amp;s=eb817589bd1e5b7d1e1c7ae5c28d95f9df819249",
                                    "width": 1920,
                                    "height": 1017
                                },
                                "resolutions": [
                                    {
                                        "url": "https://preview.redd.it/yo796ywn33uz.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=ef5bc079c39c15b0dd15ad104d88788420509aa8",
                                        "width": 108,
                                        "height": 57
                                    },
                                    {
                                        "url": "https://preview.redd.it/yo796ywn33uz.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=9066662791204dbb9c2fce0b4e35fb33e2ff23fe",
                                        "width": 216,
                                        "height": 114
                                    },
                                    {
                                        "url": "https://preview.redd.it/yo796ywn33uz.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=567e197250339f50f02795a94ee8eb4fb740a5d5",
                                        "width": 320,
                                        "height": 169
                                    },
                                    {
                                        "url": "https://preview.redd.it/yo796ywn33uz.png?width=640&amp;crop=smart&amp;auto=webp&amp;s=10a21b8e9e6d2630672508be590caab045a7ac78",
                                        "width": 640,
                                        "height": 339
                                    },
                                    {
                                        "url": "https://preview.redd.it/yo796ywn33uz.png?width=960&amp;crop=smart&amp;auto=webp&amp;s=d160beb3a548d374df43415ce3d4a1dde0304924",
                                        "width": 960,
                                        "height": 508
                                    },
                                    {
                                        "url": "https://preview.redd.it/yo796ywn33uz.png?width=1080&amp;crop=smart&amp;auto=webp&amp;s=1f01d3ca1a08048aee3617b524b71c5b7d729d04",
                                        "width": 1080,
                                        "height": 572
                                    }
                                ],
                                "variants": {},
                                "id": "-k5pCE-booL8mAqN5VH_JJ9638NEXVLy6Fh50d7ol7s"
                            }
                        ],
                        "enabled": true
                    },
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "can_gild": false,
                    "spoiler": false,
                    "locked": false,
                    "author_flair_text": "Head-owner++",
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_3bg30",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": null,
                    "id": "78smmx",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "Ballonz_Boy",
                    "discussion_type": null,
                    "num_comments": 1,
                    "send_replies": true,
                    "whitelist_status": null,
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": "dark",
                    "permalink": "/r/Freebuild/comments/78smmx/see_the_bigger_picture/",
                    "parent_whitelist_status": null,
                    "stickied": false,
                    "url": "https://i.redd.it/yo796ywn33uz.png",
                    "subreddit_subscribers": 219,
                    "created_utc": 1508984354.0,
                    "num_crossposts": 0,
                    "media": null,
                    "is_video": false
                }
            },
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "Freebuild",
                    "selftext": "I want to specify why I left the staff team because of coinciding events that merely just affirmed my final decision.\n\n1) No one ever follows the rules, and I feel as if anyone lower than Owner cannot properly do their jobs because of precedents set by bad examples. NSFW talks still persist in the normal channels despite a specific channel existing solely for those types of chats.\n\n2) No one will ever stop fighting on this server. There is always a constant flow of salt on the server, from town wars to company wars. It just continues no matter what.\n\n3) No one stays banned forever, especially when the banned players delete all the worlds on the server, setting back progress by months. This makes players believe that whatever they do has no bad consequence. If we unbanned a player that deleted worlds, then why keep a player that ruined a build banned? Why keep a player that spammed chat banned? What even is the point of banning players at this point? At this point, players like Rick/Ass/Cam or Faz should be unbanned.\n\n4) I had no chance of being Owner. I wanted to climb the ranks of staff to the highest I could go. Had I been Owner, I would have likely resigned after a month or so because there would be no more ranks to ascend. Seeing as how I was being demoted to a lower rank anyways, I personally believed I may as well start over from the beginning, before I became staff.\n\n5) I have thought that, many times, some players were attempting to use me in a plan against the server. I grew paranoid of anyone that I knew or thought I knew was part of either a secret anti-server group or a sole attacker. This had eventually subsided, but has played an important part in my resignation.\n\n6) I do not want to worry about having to verify new players anymore. It is a simple process that could easily be automated. In fact, the whole process is practically ignored and nonexistent. Often, there are no staff members on the server at all, meaning new players either leave the server after waiting in spawn too long or they find out how to get out of spawn and either carry on and build or destroy other builds.\n\n7) I should also give mention to Spurr's abuse of power when he banned me. The context was that I wanted to actually unify Arab, Spurr, and Woger into actually agreeing over something instead of bickering over virtual LEGO government systems that rule over no one. I had falsely claimed that I was going to remove Jarab, Wogtown, and Faztown and build a new theme park over it. The moment I joined, Spurr joined in and banned me. This resulted in his demotion but has been the first incident where I would question my willingness to continue being part of staff.\n\n8) I simply want to give others a chance at staff. I have taken up a spot as admin for a long while now, and I want to free up a space for future members of staff who may do a better job than I ever could. Of course, new members of staff may as well be former members of staff, but I am hopeful that, in due course of time, new players will take on the ranks of staff and do a better job than any member of staff, former or current, could ever do.\n\n9) I want to work on other things and being staff has interfered with their progress. I have yet to finish my currently on-going works because of my position as staff. There are also real-life matters that I have and have had to tend to, which will and has impacted my activity. I have felt as if I am not as active as I formerly was.\n\nThe events that have finalized my decision of resignation are only the tiny cherries on the world's worst dessert. The relevance of those events are minuscule and my choice would remain the same should they have not occurred. They have about as much of an impact as an average troller or greifer, being only tiny thorns compared to the more prevailing reasons.\n\nIf you do not wish to read these walls of texts, then don't. I am not staff anymore so I am not responsible for your personal conducts any longer. I will respond to criticisms that directly change my views on any of these matters, but the main purpose of this post is to clarify and cement my reasoning.",
                    "author_fullname": "t2_n4wex",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "Why I Resigned",
                    "link_flair_richtext": [],
                    "subreddit_name_prefixed": "r/Freebuild",
                    "hidden": false,
                    "pwls": null,
                    "link_flair_css_class": null,
                    "downs": 0,
                    "thumbnail_height": null,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_780t9v",
                    "quarantine": false,
                    "link_flair_text_color": "dark",
                    "upvote_ratio": 1.0,
                    "author_flair_background_color": "",
                    "subreddit_type": "public",
                    "ups": 6,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "thumbnail_width": null,
                    "author_flair_template_id": null,
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": null,
                    "is_reddit_media_domain": false,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": null,
                    "can_mod_post": false,
                    "score": 6,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "self",
                    "edited": false,
                    "author_flair_css_class": "",
                    "author_flair_richtext": [],
                    "gildings": {},
                    "content_categories": null,
                    "is_self": true,
                    "mod_note": null,
                    "created": 1508685975.0,
                    "link_flair_type": "text",
                    "wls": null,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "text",
                    "domain": "self.Freebuild",
                    "allow_live_comments": false,
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I want to specify why I left the staff team because of coinciding events that merely just affirmed my final decision.&lt;/p&gt;\n\n&lt;p&gt;1) No one ever follows the rules, and I feel as if anyone lower than Owner cannot properly do their jobs because of precedents set by bad examples. NSFW talks still persist in the normal channels despite a specific channel existing solely for those types of chats.&lt;/p&gt;\n\n&lt;p&gt;2) No one will ever stop fighting on this server. There is always a constant flow of salt on the server, from town wars to company wars. It just continues no matter what.&lt;/p&gt;\n\n&lt;p&gt;3) No one stays banned forever, especially when the banned players delete all the worlds on the server, setting back progress by months. This makes players believe that whatever they do has no bad consequence. If we unbanned a player that deleted worlds, then why keep a player that ruined a build banned? Why keep a player that spammed chat banned? What even is the point of banning players at this point? At this point, players like Rick/Ass/Cam or Faz should be unbanned.&lt;/p&gt;\n\n&lt;p&gt;4) I had no chance of being Owner. I wanted to climb the ranks of staff to the highest I could go. Had I been Owner, I would have likely resigned after a month or so because there would be no more ranks to ascend. Seeing as how I was being demoted to a lower rank anyways, I personally believed I may as well start over from the beginning, before I became staff.&lt;/p&gt;\n\n&lt;p&gt;5) I have thought that, many times, some players were attempting to use me in a plan against the server. I grew paranoid of anyone that I knew or thought I knew was part of either a secret anti-server group or a sole attacker. This had eventually subsided, but has played an important part in my resignation.&lt;/p&gt;\n\n&lt;p&gt;6) I do not want to worry about having to verify new players anymore. It is a simple process that could easily be automated. In fact, the whole process is practically ignored and nonexistent. Often, there are no staff members on the server at all, meaning new players either leave the server after waiting in spawn too long or they find out how to get out of spawn and either carry on and build or destroy other builds.&lt;/p&gt;\n\n&lt;p&gt;7) I should also give mention to Spurr&amp;#39;s abuse of power when he banned me. The context was that I wanted to actually unify Arab, Spurr, and Woger into actually agreeing over something instead of bickering over virtual LEGO government systems that rule over no one. I had falsely claimed that I was going to remove Jarab, Wogtown, and Faztown and build a new theme park over it. The moment I joined, Spurr joined in and banned me. This resulted in his demotion but has been the first incident where I would question my willingness to continue being part of staff.&lt;/p&gt;\n\n&lt;p&gt;8) I simply want to give others a chance at staff. I have taken up a spot as admin for a long while now, and I want to free up a space for future members of staff who may do a better job than I ever could. Of course, new members of staff may as well be former members of staff, but I am hopeful that, in due course of time, new players will take on the ranks of staff and do a better job than any member of staff, former or current, could ever do.&lt;/p&gt;\n\n&lt;p&gt;9) I want to work on other things and being staff has interfered with their progress. I have yet to finish my currently on-going works because of my position as staff. There are also real-life matters that I have and have had to tend to, which will and has impacted my activity. I have felt as if I am not as active as I formerly was.&lt;/p&gt;\n\n&lt;p&gt;The events that have finalized my decision of resignation are only the tiny cherries on the world&amp;#39;s worst dessert. The relevance of those events are minuscule and my choice would remain the same should they have not occurred. They have about as much of an impact as an average troller or greifer, being only tiny thorns compared to the more prevailing reasons.&lt;/p&gt;\n\n&lt;p&gt;If you do not wish to read these walls of texts, then don&amp;#39;t. I am not staff anymore so I am not responsible for your personal conducts any longer. I will respond to criticisms that directly change my views on any of these matters, but the main purpose of this post is to clarify and cement my reasoning.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "view_count": null,
                    "archived": false,
                    "no_follow": false,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "can_gild": false,
                    "spoiler": false,
                    "locked": false,
                    "author_flair_text": "JAFC YOU LAZY BIRD",
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_3bg30",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": "",
                    "id": "780t9v",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "DedicatedGraph",
                    "discussion_type": null,
                    "num_comments": 2,
                    "send_replies": true,
                    "whitelist_status": null,
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": "dark",
                    "permalink": "/r/Freebuild/comments/780t9v/why_i_resigned/",
                    "parent_whitelist_status": null,
                    "stickied": false,
                    "url": "https://old.reddit.com/r/Freebuild/comments/780t9v/why_i_resigned/",
                    "subreddit_subscribers": 219,
                    "created_utc": 1508685975.0,
                    "num_crossposts": 0,
                    "media": null,
                    "is_video": false
                }
            },
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "Freebuild",
                    "selftext": "whats up my pimps its yo boy xx_zoo_eats_ass_xx back again with the epic memes, today there's some new stuff and it's neat but it's not plugins so don't get hyped up for coasterbuilder. and no its not survival either.\n\n---\n\n#Staff changes\n\nStaff application megathread has closed and ShadowKnight355 aka LolMech is the new helper. Welcome aboard!\n\nAdopolis will be demoted due to inactivity and not being much participative in staff matters. Dedicated was demoted from Admin to Mod due to some shit with Nepeta and Cuck, but then he resigned from staff entirely.\n\nTo replace Dedi, Orb was promoted to Admin. \n\n# JAFC and Psy will be unbanned on Minecraft\n\nThe [poll](https://imgur.com/4XQjGLV) happened and they will be unbanned on Minecraft. \n\n#Rick's unban or not ban\n\nThat's right, another banned user is pleading for an unban. THE LINK TO VOTE IS ON THE DISCORD!\n\n#Waving's unban on Minecraft\n\nWaving will most likely have a trial or a QNA session like JAFC and Psy. Stay tuned for that.\n\n#UnusualSlurp/gnomey/herpes \n\nA friend of axe might stop by the discord for a while to talk to some users. Due to axe using his friend's accounts in the past to spy on the server, he's forbidden to be on the server, but we'll probably allow him for a time to talk with some peeps. \n\n---\n\nThink that's it, peeps. Thanks for reading! Peace out.\n\n- Zoo",
                    "author_fullname": "t2_hsaxm",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "FREDDIT MAJOR UPDATE",
                    "link_flair_richtext": [],
                    "subreddit_name_prefixed": "r/Freebuild",
                    "hidden": false,
                    "pwls": null,
                    "link_flair_css_class": null,
                    "downs": 0,
                    "thumbnail_height": null,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_77x8a9",
                    "quarantine": false,
                    "link_flair_text_color": "dark",
                    "upvote_ratio": 1.0,
                    "author_flair_background_color": "",
                    "subreddit_type": "public",
                    "ups": 5,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "thumbnail_width": null,
                    "author_flair_template_id": null,
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": null,
                    "is_reddit_media_domain": false,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": null,
                    "can_mod_post": false,
                    "score": 5,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "self",
                    "edited": 1508633764.0,
                    "author_flair_css_class": null,
                    "author_flair_richtext": [],
                    "gildings": {},
                    "post_hint": "self",
                    "content_categories": null,
                    "is_self": true,
                    "mod_note": null,
                    "created": 1508633399.0,
                    "link_flair_type": "text",
                    "wls": null,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "text",
                    "domain": "self.Freebuild",
                    "allow_live_comments": false,
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;whats up my pimps its yo boy xx_zoo_eats_ass_xx back again with the epic memes, today there&amp;#39;s some new stuff and it&amp;#39;s neat but it&amp;#39;s not plugins so don&amp;#39;t get hyped up for coasterbuilder. and no its not survival either.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;h1&gt;Staff changes&lt;/h1&gt;\n\n&lt;p&gt;Staff application megathread has closed and ShadowKnight355 aka LolMech is the new helper. Welcome aboard!&lt;/p&gt;\n\n&lt;p&gt;Adopolis will be demoted due to inactivity and not being much participative in staff matters. Dedicated was demoted from Admin to Mod due to some shit with Nepeta and Cuck, but then he resigned from staff entirely.&lt;/p&gt;\n\n&lt;p&gt;To replace Dedi, Orb was promoted to Admin. &lt;/p&gt;\n\n&lt;h1&gt;JAFC and Psy will be unbanned on Minecraft&lt;/h1&gt;\n\n&lt;p&gt;The &lt;a href=\"https://imgur.com/4XQjGLV\"&gt;poll&lt;/a&gt; happened and they will be unbanned on Minecraft. &lt;/p&gt;\n\n&lt;h1&gt;Rick&amp;#39;s unban or not ban&lt;/h1&gt;\n\n&lt;p&gt;That&amp;#39;s right, another banned user is pleading for an unban. THE LINK TO VOTE IS ON THE DISCORD!&lt;/p&gt;\n\n&lt;h1&gt;Waving&amp;#39;s unban on Minecraft&lt;/h1&gt;\n\n&lt;p&gt;Waving will most likely have a trial or a QNA session like JAFC and Psy. Stay tuned for that.&lt;/p&gt;\n\n&lt;h1&gt;UnusualSlurp/gnomey/herpes&lt;/h1&gt;\n\n&lt;p&gt;A friend of axe might stop by the discord for a while to talk to some users. Due to axe using his friend&amp;#39;s accounts in the past to spy on the server, he&amp;#39;s forbidden to be on the server, but we&amp;#39;ll probably allow him for a time to talk with some peeps. &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Think that&amp;#39;s it, peeps. Thanks for reading! Peace out.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Zoo&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "view_count": null,
                    "archived": false,
                    "no_follow": false,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "preview": {
                        "images": [
                            {
                                "source": {
                                    "url": "https://external-preview.redd.it/miwqUCbs3pWdkOi-M9WkRR7z7xSp3deoIOAK_yl0ZYs.jpg?auto=webp&amp;s=e7dd491c141fd75d29098721c4afd1d556446079",
                                    "width": 693,
                                    "height": 332
                                },
                                "resolutions": [
                                    {
                                        "url": "https://external-preview.redd.it/miwqUCbs3pWdkOi-M9WkRR7z7xSp3deoIOAK_yl0ZYs.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=6c44b50cc1735012d38f72f4429de7803fa9647d",
                                        "width": 108,
                                        "height": 51
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/miwqUCbs3pWdkOi-M9WkRR7z7xSp3deoIOAK_yl0ZYs.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=b64f09375601a4c587352c5b8e8046bbcc7c5945",
                                        "width": 216,
                                        "height": 103
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/miwqUCbs3pWdkOi-M9WkRR7z7xSp3deoIOAK_yl0ZYs.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=e9e783de41751a1423f550badb6c283b90a298b5",
                                        "width": 320,
                                        "height": 153
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/miwqUCbs3pWdkOi-M9WkRR7z7xSp3deoIOAK_yl0ZYs.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=f3c030dcbc2e1d43af0f585c32ba8395a272bcd9",
                                        "width": 640,
                                        "height": 306
                                    }
                                ],
                                "variants": {},
                                "id": "CVTL_NRdud6UlqHJDNn2gy34dknB__uXOshCweUm3As"
                            }
                        ],
                        "enabled": false
                    },
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "can_gild": false,
                    "spoiler": false,
                    "locked": false,
                    "author_flair_text": "T.B.C",
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_3bg30",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": "",
                    "id": "77x8a9",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "Zoocanadanda",
                    "discussion_type": null,
                    "num_comments": 9,
                    "send_replies": true,
                    "whitelist_status": null,
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": "dark",
                    "permalink": "/r/Freebuild/comments/77x8a9/freddit_major_update/",
                    "parent_whitelist_status": null,
                    "stickied": false,
                    "url": "https://old.reddit.com/r/Freebuild/comments/77x8a9/freddit_major_update/",
                    "subreddit_subscribers": 219,
                    "created_utc": 1508633399.0,
                    "num_crossposts": 0,
                    "media": null,
                    "is_video": false
                }
            },
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "Freebuild",
                    "selftext": "- _\"I can ban this server\"_\n\n~ lukevader13\n\n---\n\nAnyone unbanned can apply.\n\n**If you didn't get the job last time, doesn't mean you won't now!** A LOT of people apply and we think about hiring them, but then we don't have space. Some of them give up, _don't_.\n\nKeep applying, as always we will ALWAYS read your apps.\n\n---\n\n**Username:**\n\n**Alias** (which name/nickname (not username) are you most known for?):\n\n**Age:**\n \n**Staff rank you're aiming for** (This is just your suggestion, you can get a different rank you were aiming for):\n\n**Do you have a way for us to contact you outside Minecraft? If yes, elaborate how** (discord, skype, etc):\n\n**Future activity** (how active you'll be in the near future):\n\n**Prior experience:**\n\n**Notable skills:**\n\n**What are your plans for when you become staff?:**\n\n**In what ways can you help the server once you get staff?:**\n\n**What Minecraft staff commands do you know beforehand?:**\n\n**Why should you be staff?** (This is a more personal question. Just say your peace here without having to follow parameters.):\n\n---\n\nOk. Does anyone read anything besides the parameters even?\n\nAlso, a reminder! **All apps will be read regardless if you got accepted or not, regardless if someone replied to it!** We will all read each app carefully, so put your work into making a good one.\n\n#UPVOTES AND DOWNVOTES DO NOT PARTAKE IN WHO GETS STAFF OR NOT\n\n**Good luck!**",
                    "author_fullname": "t2_hsaxm",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "STAFF APPLICATION MEGATHREAD: THE SEQUEL SEQUEL SEQUEL SEQUEL SEQUEL SEQUEL SEQUEL",
                    "link_flair_richtext": [],
                    "subreddit_name_prefixed": "r/Freebuild",
                    "hidden": false,
                    "pwls": null,
                    "link_flair_css_class": "",
                    "downs": 0,
                    "thumbnail_height": null,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_74ve6o",
                    "quarantine": false,
                    "link_flair_text_color": null,
                    "upvote_ratio": 1.0,
                    "author_flair_background_color": "",
                    "subreddit_type": "public",
                    "ups": 2,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "thumbnail_width": null,
                    "author_flair_template_id": null,
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": null,
                    "is_reddit_media_domain": false,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": "CLOSED",
                    "can_mod_post": false,
                    "score": 2,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "self",
                    "edited": false,
                    "author_flair_css_class": null,
                    "author_flair_richtext": [],
                    "gildings": {},
                    "content_categories": null,
                    "is_self": true,
                    "mod_note": null,
                    "created": 1507389172.0,
                    "link_flair_type": "text",
                    "wls": null,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "text",
                    "domain": "self.Freebuild",
                    "allow_live_comments": false,
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;ul&gt;\n&lt;li&gt;&lt;em&gt;&amp;quot;I can ban this server&amp;quot;&lt;/em&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;~ lukevader13&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Anyone unbanned can apply.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;If you didn&amp;#39;t get the job last time, doesn&amp;#39;t mean you won&amp;#39;t now!&lt;/strong&gt; A LOT of people apply and we think about hiring them, but then we don&amp;#39;t have space. Some of them give up, &lt;em&gt;don&amp;#39;t&lt;/em&gt;.&lt;/p&gt;\n\n&lt;p&gt;Keep applying, as always we will ALWAYS read your apps.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;Username:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Alias&lt;/strong&gt; (which name/nickname (not username) are you most known for?):&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Age:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Staff rank you&amp;#39;re aiming for&lt;/strong&gt; (This is just your suggestion, you can get a different rank you were aiming for):&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Do you have a way for us to contact you outside Minecraft? If yes, elaborate how&lt;/strong&gt; (discord, skype, etc):&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Future activity&lt;/strong&gt; (how active you&amp;#39;ll be in the near future):&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Prior experience:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Notable skills:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;What are your plans for when you become staff?:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;In what ways can you help the server once you get staff?:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;What Minecraft staff commands do you know beforehand?:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Why should you be staff?&lt;/strong&gt; (This is a more personal question. Just say your peace here without having to follow parameters.):&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Ok. Does anyone read anything besides the parameters even?&lt;/p&gt;\n\n&lt;p&gt;Also, a reminder! &lt;strong&gt;All apps will be read regardless if you got accepted or not, regardless if someone replied to it!&lt;/strong&gt; We will all read each app carefully, so put your work into making a good one.&lt;/p&gt;\n\n&lt;h1&gt;UPVOTES AND DOWNVOTES DO NOT PARTAKE IN WHO GETS STAFF OR NOT&lt;/h1&gt;\n\n&lt;p&gt;&lt;strong&gt;Good luck!&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "view_count": null,
                    "archived": false,
                    "no_follow": false,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "can_gild": false,
                    "spoiler": false,
                    "locked": true,
                    "author_flair_text": "T.B.C",
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_3bg30",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": null,
                    "id": "74ve6o",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "Zoocanadanda",
                    "discussion_type": null,
                    "num_comments": 17,
                    "send_replies": true,
                    "whitelist_status": null,
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": "dark",
                    "permalink": "/r/Freebuild/comments/74ve6o/staff_application_megathread_the_sequel_sequel/",
                    "parent_whitelist_status": null,
                    "stickied": false,
                    "url": "https://old.reddit.com/r/Freebuild/comments/74ve6o/staff_application_megathread_the_sequel_sequel/",
                    "subreddit_subscribers": 219,
                    "created_utc": 1507389172.0,
                    "num_crossposts": 0,
                    "media": null,
                    "is_video": false
                }
            },
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "Freebuild",
                    "selftext": "I need to know, is he on this server? I would also expect to know about any whereabouts of him if he is not on this server.",
                    "author_fullname": "t2_ghi4d57",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "Is DolphinJtaro17 on this server?",
                    "link_flair_richtext": [],
                    "subreddit_name_prefixed": "r/Freebuild",
                    "hidden": false,
                    "pwls": null,
                    "link_flair_css_class": null,
                    "downs": 0,
                    "thumbnail_height": null,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_74vns0",
                    "quarantine": false,
                    "link_flair_text_color": "dark",
                    "upvote_ratio": 0.67,
                    "author_flair_background_color": null,
                    "subreddit_type": "public",
                    "ups": 1,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "thumbnail_width": null,
                    "author_flair_template_id": null,
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": null,
                    "is_reddit_media_domain": false,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": null,
                    "can_mod_post": false,
                    "score": 1,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "self",
                    "edited": false,
                    "author_flair_css_class": null,
                    "author_flair_richtext": [],
                    "gildings": {},
                    "content_categories": null,
                    "is_self": true,
                    "mod_note": null,
                    "created": 1507391989.0,
                    "link_flair_type": "text",
                    "wls": null,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "text",
                    "domain": "self.Freebuild",
                    "allow_live_comments": false,
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I need to know, is he on this server? I would also expect to know about any whereabouts of him if he is not on this server.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "view_count": null,
                    "archived": false,
                    "no_follow": true,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "can_gild": false,
                    "spoiler": false,
                    "locked": false,
                    "author_flair_text": null,
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_3bg30",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": "",
                    "id": "74vns0",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "DIO_TheWorld21",
                    "discussion_type": null,
                    "num_comments": 8,
                    "send_replies": true,
                    "whitelist_status": null,
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": null,
                    "permalink": "/r/Freebuild/comments/74vns0/is_dolphinjtaro17_on_this_server/",
                    "parent_whitelist_status": null,
                    "stickied": false,
                    "url": "https://old.reddit.com/r/Freebuild/comments/74vns0/is_dolphinjtaro17_on_this_server/",
                    "subreddit_subscribers": 219,
                    "created_utc": 1507391989.0,
                    "num_crossposts": 0,
                    "media": null,
                    "is_video": false
                }
            },
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "Freebuild",
                    "selftext": "Dearest Reeda,\n\nhttps://pastebin.com/tePeRMLV\n\nSincerely, \n\nMr. Blanats Sphere",
                    "author_fullname": "t2_kdd3f",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "Epistle Zero",
                    "link_flair_richtext": [],
                    "subreddit_name_prefixed": "r/Freebuild",
                    "hidden": false,
                    "pwls": null,
                    "link_flair_css_class": null,
                    "downs": 0,
                    "thumbnail_height": null,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_74t2ma",
                    "quarantine": false,
                    "link_flair_text_color": "dark",
                    "upvote_ratio": 0.83,
                    "author_flair_background_color": "",
                    "subreddit_type": "public",
                    "ups": 4,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "thumbnail_width": null,
                    "author_flair_template_id": null,
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": null,
                    "is_reddit_media_domain": false,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": null,
                    "can_mod_post": false,
                    "score": 4,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "nsfw",
                    "edited": false,
                    "author_flair_css_class": "",
                    "author_flair_richtext": [],
                    "gildings": {},
                    "post_hint": "self",
                    "content_categories": null,
                    "is_self": true,
                    "mod_note": null,
                    "created": 1507353382.0,
                    "link_flair_type": "text",
                    "wls": null,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "text",
                    "domain": "self.Freebuild",
                    "allow_live_comments": false,
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Dearest Reeda,&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://pastebin.com/tePeRMLV\"&gt;https://pastebin.com/tePeRMLV&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Sincerely, &lt;/p&gt;\n\n&lt;p&gt;Mr. Blanats Sphere&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "view_count": null,
                    "archived": false,
                    "no_follow": false,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": true,
                    "preview": {
                        "images": [
                            {
                                "source": {
                                    "url": "https://external-preview.redd.it/apn0jimBDcu7v5NrQv4_AjqWqHWQMnATxOAbLbDgyQw.jpg?auto=webp&amp;s=fe7abb3ae0c8be0d3d9905987e5f8442ae661e3c",
                                    "width": 250,
                                    "height": 250
                                },
                                "resolutions": [
                                    {
                                        "url": "https://external-preview.redd.it/apn0jimBDcu7v5NrQv4_AjqWqHWQMnATxOAbLbDgyQw.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=5367be8e7095cf04498ec9ba39774b325c032522",
                                        "width": 108,
                                        "height": 108
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/apn0jimBDcu7v5NrQv4_AjqWqHWQMnATxOAbLbDgyQw.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=fe4baf0e8c438821877b890882970151a18df315",
                                        "width": 216,
                                        "height": 216
                                    }
                                ],
                                "variants": {
                                    "obfuscated": {
                                        "source": {
                                            "url": "https://external-preview.redd.it/apn0jimBDcu7v5NrQv4_AjqWqHWQMnATxOAbLbDgyQw.jpg?blur=40&amp;format=pjpg&amp;auto=webp&amp;s=74c7b3f9c56d6e5dea71abc3203dde9422518373",
                                            "width": 250,
                                            "height": 250
                                        },
                                        "resolutions": [
                                            {
                                                "url": "https://external-preview.redd.it/apn0jimBDcu7v5NrQv4_AjqWqHWQMnATxOAbLbDgyQw.jpg?width=108&amp;crop=smart&amp;blur=10&amp;format=pjpg&amp;auto=webp&amp;s=fce51caefb8f89c2eb5e8cb4dfd7997bc2f2e500",
                                                "width": 108,
                                                "height": 108
                                            },
                                            {
                                                "url": "https://external-preview.redd.it/apn0jimBDcu7v5NrQv4_AjqWqHWQMnATxOAbLbDgyQw.jpg?width=216&amp;crop=smart&amp;blur=21&amp;format=pjpg&amp;auto=webp&amp;s=874792e72693ea28fa4889b39a823e7e78127b06",
                                                "width": 216,
                                                "height": 216
                                            }
                                        ]
                                    },
                                    "nsfw": {
                                        "source": {
                                            "url": "https://external-preview.redd.it/apn0jimBDcu7v5NrQv4_AjqWqHWQMnATxOAbLbDgyQw.jpg?blur=40&amp;format=pjpg&amp;auto=webp&amp;s=74c7b3f9c56d6e5dea71abc3203dde9422518373",
                                            "width": 250,
                                            "height": 250
                                        },
                                        "resolutions": [
                                            {
                                                "url": "https://external-preview.redd.it/apn0jimBDcu7v5NrQv4_AjqWqHWQMnATxOAbLbDgyQw.jpg?width=108&amp;crop=smart&amp;blur=10&amp;format=pjpg&amp;auto=webp&amp;s=fce51caefb8f89c2eb5e8cb4dfd7997bc2f2e500",
                                                "width": 108,
                                                "height": 108
                                            },
                                            {
                                                "url": "https://external-preview.redd.it/apn0jimBDcu7v5NrQv4_AjqWqHWQMnATxOAbLbDgyQw.jpg?width=216&amp;crop=smart&amp;blur=21&amp;format=pjpg&amp;auto=webp&amp;s=874792e72693ea28fa4889b39a823e7e78127b06",
                                                "width": 216,
                                                "height": 216
                                            }
                                        ]
                                    }
                                },
                                "id": "tEFaKdpbTuSBBWpWQ-kmQ1l_KwNUpQtPpUtOwmLiL-A"
                            }
                        ],
                        "enabled": false
                    },
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "can_gild": false,
                    "spoiler": true,
                    "locked": false,
                    "author_flair_text": "Head-owner++",
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_3bg30",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": "",
                    "id": "74t2ma",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "Ballonz_Boy",
                    "discussion_type": null,
                    "num_comments": 1,
                    "send_replies": true,
                    "whitelist_status": null,
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": "dark",
                    "permalink": "/r/Freebuild/comments/74t2ma/epistle_zero/",
                    "parent_whitelist_status": null,
                    "stickied": false,
                    "url": "https://old.reddit.com/r/Freebuild/comments/74t2ma/epistle_zero/",
                    "subreddit_subscribers": 219,
                    "created_utc": 1507353382.0,
                    "num_crossposts": 0,
                    "media": null,
                    "is_video": false
                }
            },
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "Freebuild",
                    "selftext": "",
                    "author_fullname": "t2_149mdbh",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "heroes never dye (except if ur already dead lol)",
                    "link_flair_richtext": [],
                    "subreddit_name_prefixed": "r/Freebuild",
                    "hidden": false,
                    "pwls": null,
                    "link_flair_css_class": "",
                    "downs": 0,
                    "thumbnail_height": 75,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_73uotz",
                    "quarantine": false,
                    "link_flair_text_color": null,
                    "upvote_ratio": 1.0,
                    "author_flair_background_color": "",
                    "subreddit_type": "public",
                    "ups": 2,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "thumbnail_width": 140,
                    "author_flair_template_id": null,
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": null,
                    "is_reddit_media_domain": false,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": "IMAGE",
                    "can_mod_post": false,
                    "score": 2,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "https://b.thumbs.redditmedia.com/lppQzhNU7NxQJhOvf2YlYJQCQquvYUA5Zqi-eFGUKqw.jpg",
                    "edited": false,
                    "author_flair_css_class": "",
                    "author_flair_richtext": [],
                    "gildings": {},
                    "post_hint": "image",
                    "content_categories": null,
                    "is_self": false,
                    "mod_note": null,
                    "created": 1506969270.0,
                    "link_flair_type": "text",
                    "wls": null,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "text",
                    "domain": "i.imgur.com",
                    "allow_live_comments": false,
                    "selftext_html": null,
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "url_overridden_by_dest": "https://i.imgur.com/00keoaD.jpg",
                    "view_count": null,
                    "archived": false,
                    "no_follow": true,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "preview": {
                        "images": [
                            {
                                "source": {
                                    "url": "https://external-preview.redd.it/aT1bIa8EpkHGpG9wtj04w5Bar24WEiQ1RFrQqz6fshc.jpg?auto=webp&amp;s=3cc0155bfb52c136752055317e004cdaf80bbec4",
                                    "width": 2560,
                                    "height": 1378
                                },
                                "resolutions": [
                                    {
                                        "url": "https://external-preview.redd.it/aT1bIa8EpkHGpG9wtj04w5Bar24WEiQ1RFrQqz6fshc.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=013d1a3fb32440049b8ab6b39d1f2058283323b3",
                                        "width": 108,
                                        "height": 58
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/aT1bIa8EpkHGpG9wtj04w5Bar24WEiQ1RFrQqz6fshc.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=f942bd27b155361faabee6fb87c765bc9605d250",
                                        "width": 216,
                                        "height": 116
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/aT1bIa8EpkHGpG9wtj04w5Bar24WEiQ1RFrQqz6fshc.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=d02cc638aa436513c1704c5b6a281ef831226a33",
                                        "width": 320,
                                        "height": 172
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/aT1bIa8EpkHGpG9wtj04w5Bar24WEiQ1RFrQqz6fshc.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=bd874d7a692b3ef2e06222d2614d7f1faf16a71b",
                                        "width": 640,
                                        "height": 344
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/aT1bIa8EpkHGpG9wtj04w5Bar24WEiQ1RFrQqz6fshc.jpg?width=960&amp;crop=smart&amp;auto=webp&amp;s=96dbdf1c045f162d151f160e118d98004950f43e",
                                        "width": 960,
                                        "height": 516
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/aT1bIa8EpkHGpG9wtj04w5Bar24WEiQ1RFrQqz6fshc.jpg?width=1080&amp;crop=smart&amp;auto=webp&amp;s=558c8ab55579141a2fcf803f56281cd1988ee6b3",
                                        "width": 1080,
                                        "height": 581
                                    }
                                ],
                                "variants": {},
                                "id": "DAUo5p9XrzVy2z133UDqAluFWCrWkUikO1XvbMvuMeQ"
                            }
                        ],
                        "enabled": true
                    },
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "can_gild": false,
                    "spoiler": false,
                    "locked": false,
                    "author_flair_text": "Curropt",
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_3bg30",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": null,
                    "id": "73uotz",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "TheoricalPhysicist",
                    "discussion_type": null,
                    "num_comments": 0,
                    "send_replies": true,
                    "whitelist_status": null,
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": "dark",
                    "permalink": "/r/Freebuild/comments/73uotz/heroes_never_dye_except_if_ur_already_dead_lol/",
                    "parent_whitelist_status": null,
                    "stickied": false,
                    "url": "https://i.imgur.com/00keoaD.jpg",
                    "subreddit_subscribers": 219,
                    "created_utc": 1506969270.0,
                    "num_crossposts": 0,
                    "media": null,
                    "is_video": false
                }
            },
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "Freebuild",
                    "selftext": "",
                    "author_fullname": "t2_y6opy",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "SAY MY NAME",
                    "link_flair_richtext": [],
                    "subreddit_name_prefixed": "r/Freebuild",
                    "hidden": false,
                    "pwls": null,
                    "link_flair_css_class": null,
                    "downs": 0,
                    "thumbnail_height": 87,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_73fy63",
                    "quarantine": false,
                    "link_flair_text_color": "dark",
                    "upvote_ratio": 1.0,
                    "author_flair_background_color": "",
                    "subreddit_type": "public",
                    "ups": 2,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "thumbnail_width": 140,
                    "author_flair_template_id": null,
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": null,
                    "is_reddit_media_domain": false,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": null,
                    "can_mod_post": false,
                    "score": 2,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "https://b.thumbs.redditmedia.com/4RTuI7BZAvPha78l8hHV8aeUecsPNJA52BmTcOT1BwU.jpg",
                    "edited": false,
                    "author_flair_css_class": "",
                    "author_flair_richtext": [],
                    "gildings": {},
                    "post_hint": "image",
                    "content_categories": null,
                    "is_self": false,
                    "mod_note": null,
                    "created": 1506789757.0,
                    "link_flair_type": "text",
                    "wls": null,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "text",
                    "domain": "i.imgur.com",
                    "allow_live_comments": false,
                    "selftext_html": null,
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "url_overridden_by_dest": "https://i.imgur.com/cawL1cC.png",
                    "view_count": null,
                    "archived": false,
                    "no_follow": false,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "preview": {
                        "images": [
                            {
                                "source": {
                                    "url": "https://external-preview.redd.it/D636mzei6GAnLBL2WmCannrWyeGW7vx-JRzEmkGyrO8.png?auto=webp&amp;s=5f9382c66a20b38560d09eaf3f4b983cb7e073c4",
                                    "width": 2560,
                                    "height": 1600
                                },
                                "resolutions": [
                                    {
                                        "url": "https://external-preview.redd.it/D636mzei6GAnLBL2WmCannrWyeGW7vx-JRzEmkGyrO8.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=b5ac8504bf0337694ce4624de81c6cd518318375",
                                        "width": 108,
                                        "height": 67
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/D636mzei6GAnLBL2WmCannrWyeGW7vx-JRzEmkGyrO8.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=e0d2adafc6237fb2479a02bf32d0426a622e7911",
                                        "width": 216,
                                        "height": 135
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/D636mzei6GAnLBL2WmCannrWyeGW7vx-JRzEmkGyrO8.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=0d6d5815e2eed59d7387b93c852aab5fcb5a3d3e",
                                        "width": 320,
                                        "height": 200
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/D636mzei6GAnLBL2WmCannrWyeGW7vx-JRzEmkGyrO8.png?width=640&amp;crop=smart&amp;auto=webp&amp;s=45cb6057a8df479b054c095fc98719cf3841c9c5",
                                        "width": 640,
                                        "height": 400
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/D636mzei6GAnLBL2WmCannrWyeGW7vx-JRzEmkGyrO8.png?width=960&amp;crop=smart&amp;auto=webp&amp;s=b4fdcb66dc066bfe39315f2e01f6536f10681291",
                                        "width": 960,
                                        "height": 600
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/D636mzei6GAnLBL2WmCannrWyeGW7vx-JRzEmkGyrO8.png?width=1080&amp;crop=smart&amp;auto=webp&amp;s=5d4279eed076e015590033478b07052855d542b5",
                                        "width": 1080,
                                        "height": 675
                                    }
                                ],
                                "variants": {},
                                "id": "ByVYH1JqkNLGR3ac4Z8y9yUnqnYGs_zw4i7Bm0qXKnk"
                            }
                        ],
                        "enabled": true
                    },
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "can_gild": false,
                    "spoiler": false,
                    "locked": false,
                    "author_flair_text": "Oldfag",
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_3bg30",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": "",
                    "id": "73fy63",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "DrydonTheAlt",
                    "discussion_type": null,
                    "num_comments": 0,
                    "send_replies": true,
                    "whitelist_status": null,
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": "dark",
                    "permalink": "/r/Freebuild/comments/73fy63/say_my_name/",
                    "parent_whitelist_status": null,
                    "stickied": false,
                    "url": "https://i.imgur.com/cawL1cC.png",
                    "subreddit_subscribers": 219,
                    "created_utc": 1506789757.0,
                    "num_crossposts": 0,
                    "media": null,
                    "is_video": false
                }
            },
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "Freebuild",
                    "selftext": "",
                    "author_fullname": "t2_y6opy",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "CRYSTAL CLEAR",
                    "link_flair_richtext": [],
                    "subreddit_name_prefixed": "r/Freebuild",
                    "hidden": false,
                    "pwls": null,
                    "link_flair_css_class": null,
                    "downs": 0,
                    "thumbnail_height": 87,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_73cjt8",
                    "quarantine": false,
                    "link_flair_text_color": "dark",
                    "upvote_ratio": 1.0,
                    "author_flair_background_color": "",
                    "subreddit_type": "public",
                    "ups": 2,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "thumbnail_width": 140,
                    "author_flair_template_id": null,
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": null,
                    "is_reddit_media_domain": false,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": null,
                    "can_mod_post": false,
                    "score": 2,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "https://b.thumbs.redditmedia.com/DMdyLQOF1ooB58qV6J7HtScSgGCG0f7VC14UsLt-SHk.jpg",
                    "edited": false,
                    "author_flair_css_class": "",
                    "author_flair_richtext": [],
                    "gildings": {},
                    "post_hint": "image",
                    "content_categories": null,
                    "is_self": false,
                    "mod_note": null,
                    "created": 1506739290.0,
                    "link_flair_type": "text",
                    "wls": null,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "text",
                    "domain": "i.imgur.com",
                    "allow_live_comments": false,
                    "selftext_html": null,
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "url_overridden_by_dest": "https://i.imgur.com/4VmL9YG.png",
                    "view_count": null,
                    "archived": false,
                    "no_follow": false,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "preview": {
                        "images": [
                            {
                                "source": {
                                    "url": "https://external-preview.redd.it/4c1tYF54LsH8w16naYtmoGgtdCyHS32WbLA7RZs0-iU.png?auto=webp&amp;s=5fc285b57c80d8cab0fb721a5da239c604c2fe7c",
                                    "width": 2560,
                                    "height": 1600
                                },
                                "resolutions": [
                                    {
                                        "url": "https://external-preview.redd.it/4c1tYF54LsH8w16naYtmoGgtdCyHS32WbLA7RZs0-iU.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=29ed548d354e13ff9af94d7e97942067087503ea",
                                        "width": 108,
                                        "height": 67
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/4c1tYF54LsH8w16naYtmoGgtdCyHS32WbLA7RZs0-iU.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=b03be473b03dfe85ada7faf9c098f5222291fdb5",
                                        "width": 216,
                                        "height": 135
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/4c1tYF54LsH8w16naYtmoGgtdCyHS32WbLA7RZs0-iU.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=72b22bd56b9ac7dde444dbda6ca678bf75b5cfaa",
                                        "width": 320,
                                        "height": 200
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/4c1tYF54LsH8w16naYtmoGgtdCyHS32WbLA7RZs0-iU.png?width=640&amp;crop=smart&amp;auto=webp&amp;s=b10a72fe203c19ebb92ca567183f0a3e82d67832",
                                        "width": 640,
                                        "height": 400
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/4c1tYF54LsH8w16naYtmoGgtdCyHS32WbLA7RZs0-iU.png?width=960&amp;crop=smart&amp;auto=webp&amp;s=df3629a464128e88ac89c3423883ca951e5eac89",
                                        "width": 960,
                                        "height": 600
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/4c1tYF54LsH8w16naYtmoGgtdCyHS32WbLA7RZs0-iU.png?width=1080&amp;crop=smart&amp;auto=webp&amp;s=b4a6cea0f4dffddbb4106c93aa42feb9d565fc05",
                                        "width": 1080,
                                        "height": 675
                                    }
                                ],
                                "variants": {},
                                "id": "Qb-xIHUzd0r0areqS8w4Nx4sSqukKyYmCA5WiqKFFOU"
                            }
                        ],
                        "enabled": true
                    },
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "can_gild": false,
                    "spoiler": false,
                    "locked": false,
                    "author_flair_text": "Oldfag",
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_3bg30",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": "",
                    "id": "73cjt8",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "DrydonTheAlt",
                    "discussion_type": null,
                    "num_comments": 1,
                    "send_replies": true,
                    "whitelist_status": null,
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": "dark",
                    "permalink": "/r/Freebuild/comments/73cjt8/crystal_clear/",
                    "parent_whitelist_status": null,
                    "stickied": false,
                    "url": "https://i.imgur.com/4VmL9YG.png",
                    "subreddit_subscribers": 219,
                    "created_utc": 1506739290.0,
                    "num_crossposts": 0,
                    "media": null,
                    "is_video": false
                }
            },
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "Freebuild",
                    "selftext": "",
                    "author_fullname": "t2_y6opy",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "AMAZING Indefreddit Day poster by LEEDLEMAN",
                    "link_flair_richtext": [],
                    "subreddit_name_prefixed": "r/Freebuild",
                    "hidden": false,
                    "pwls": null,
                    "link_flair_css_class": null,
                    "downs": 0,
                    "thumbnail_height": 140,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_733l3s",
                    "quarantine": false,
                    "link_flair_text_color": "dark",
                    "upvote_ratio": 1.0,
                    "author_flair_background_color": "",
                    "subreddit_type": "public",
                    "ups": 5,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "thumbnail_width": 140,
                    "author_flair_template_id": null,
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": null,
                    "is_reddit_media_domain": false,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": null,
                    "can_mod_post": false,
                    "score": 5,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "https://b.thumbs.redditmedia.com/mUjlw8zY1t8zMpAbtvjfyC33GOhfIyfYuiAZre4lcNc.jpg",
                    "edited": false,
                    "author_flair_css_class": "",
                    "author_flair_richtext": [],
                    "gildings": {},
                    "post_hint": "image",
                    "content_categories": null,
                    "is_self": false,
                    "mod_note": null,
                    "created": 1506637354.0,
                    "link_flair_type": "text",
                    "wls": null,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "text",
                    "domain": "i.imgur.com",
                    "allow_live_comments": false,
                    "selftext_html": null,
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "url_overridden_by_dest": "https://i.imgur.com/seBR0a2.png",
                    "view_count": null,
                    "archived": false,
                    "no_follow": false,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "preview": {
                        "images": [
                            {
                                "source": {
                                    "url": "https://external-preview.redd.it/KtiFXkd4LUNzv3_UlNWxeBq_sNy1Az0Ssz574yfVg8w.png?auto=webp&amp;s=c7dbf36611d0efa473ff4ad947698538d6453af9",
                                    "width": 457,
                                    "height": 600
                                },
                                "resolutions": [
                                    {
                                        "url": "https://external-preview.redd.it/KtiFXkd4LUNzv3_UlNWxeBq_sNy1Az0Ssz574yfVg8w.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=1695268a0714d05577773380db39b01b17299edb",
                                        "width": 108,
                                        "height": 141
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/KtiFXkd4LUNzv3_UlNWxeBq_sNy1Az0Ssz574yfVg8w.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=f4e932201d30c007a767e10ca7bb65e3d1513ecd",
                                        "width": 216,
                                        "height": 283
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/KtiFXkd4LUNzv3_UlNWxeBq_sNy1Az0Ssz574yfVg8w.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=8c8c59a2d84142ffd59f297760b15ff088a0a48e",
                                        "width": 320,
                                        "height": 420
                                    }
                                ],
                                "variants": {},
                                "id": "d8xzmxs8aoqtUGKr15L6bObEwqp0Xd9_Jc1_JNlcMkA"
                            }
                        ],
                        "enabled": true
                    },
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "can_gild": false,
                    "spoiler": false,
                    "locked": false,
                    "author_flair_text": "Oldfag",
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_3bg30",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": "",
                    "id": "733l3s",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "DrydonTheAlt",
                    "discussion_type": null,
                    "num_comments": 1,
                    "send_replies": true,
                    "whitelist_status": null,
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": "dark",
                    "permalink": "/r/Freebuild/comments/733l3s/amazing_indefreddit_day_poster_by_leedleman/",
                    "parent_whitelist_status": null,
                    "stickied": false,
                    "url": "https://i.imgur.com/seBR0a2.png",
                    "subreddit_subscribers": 219,
                    "created_utc": 1506637354.0,
                    "num_crossposts": 0,
                    "media": null,
                    "is_video": false
                }
            },
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "Freebuild",
                    "selftext": "",
                    "author_fullname": "t2_y6opy",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "Freddit Files - Indefreddit Day CLIP - GRAND DAD",
                    "link_flair_richtext": [],
                    "subreddit_name_prefixed": "r/Freebuild",
                    "hidden": false,
                    "pwls": null,
                    "link_flair_css_class": null,
                    "downs": 0,
                    "thumbnail_height": 105,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_73338k",
                    "quarantine": false,
                    "link_flair_text_color": "dark",
                    "upvote_ratio": 0.78,
                    "author_flair_background_color": "",
                    "subreddit_type": "public",
                    "ups": 5,
                    "total_awards_received": 0,
                    "media_embed": {
                        "content": "&lt;iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/6CXzie7iCRk?feature=oembed&amp;enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"The Freddit Files Movie - Indefreddit Day (UPDATED SNEAK PEEK)\"&gt;&lt;/iframe&gt;",
                        "width": 356,
                        "scrolling": false,
                        "height": 200
                    },
                    "thumbnail_width": 140,
                    "author_flair_template_id": null,
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": {
                        "type": "youtube.com",
                        "oembed": {
                            "provider_url": "https://www.youtube.com/",
                            "version": "1.0",
                            "title": "The Freddit Files Movie - Indefreddit Day (UPDATED SNEAK PEEK)",
                            "type": "video",
                            "thumbnail_width": 480,
                            "height": 200,
                            "width": 356,
                            "html": "&lt;iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/6CXzie7iCRk?feature=oembed&amp;enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"The Freddit Files Movie - Indefreddit Day (UPDATED SNEAK PEEK)\"&gt;&lt;/iframe&gt;",
                            "author_name": "Drydon",
                            "provider_name": "YouTube",
                            "thumbnail_url": "https://i.ytimg.com/vi/6CXzie7iCRk/hqdefault.jpg",
                            "thumbnail_height": 360,
                            "author_url": "https://www.youtube.com/@drydon3382"
                        }
                    },
                    "is_reddit_media_domain": false,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {
                        "content": "&lt;iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/6CXzie7iCRk?feature=oembed&amp;enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"The Freddit Files Movie - Indefreddit Day (UPDATED SNEAK PEEK)\"&gt;&lt;/iframe&gt;",
                        "width": 356,
                        "scrolling": false,
                        "media_domain_url": "https://www.redditmedia.com/mediaembed/73338k",
                        "height": 200
                    },
                    "link_flair_text": null,
                    "can_mod_post": false,
                    "score": 5,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "https://b.thumbs.redditmedia.com/LfTjDZpwE805JeP72lYeL4I3MRluBiZyIrMerCNeX0g.jpg",
                    "edited": false,
                    "author_flair_css_class": "",
                    "author_flair_richtext": [],
                    "gildings": {},
                    "post_hint": "rich:video",
                    "content_categories": null,
                    "is_self": false,
                    "mod_note": null,
                    "created": 1506632631.0,
                    "link_flair_type": "text",
                    "wls": null,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "text",
                    "domain": "youtube.com",
                    "allow_live_comments": false,
                    "selftext_html": null,
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "url_overridden_by_dest": "https://www.youtube.com/watch?v=6CXzie7iCRk",
                    "view_count": null,
                    "archived": false,
                    "no_follow": false,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "preview": {
                        "images": [
                            {
                                "source": {
                                    "url": "https://external-preview.redd.it/smKvcRvE80uF5bQv8viFpYSK6foWCAAT_2G6HMMOBPg.jpg?auto=webp&amp;s=3ebfb60e7093db07b241966236121f143f65e823",
                                    "width": 480,
                                    "height": 360
                                },
                                "resolutions": [
                                    {
                                        "url": "https://external-preview.redd.it/smKvcRvE80uF5bQv8viFpYSK6foWCAAT_2G6HMMOBPg.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=4246586b225f24f3ffa154962e44ea8b07fa4dc7",
                                        "width": 108,
                                        "height": 81
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/smKvcRvE80uF5bQv8viFpYSK6foWCAAT_2G6HMMOBPg.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=c206257b2f154e26411d616411e86b547c0f8314",
                                        "width": 216,
                                        "height": 162
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/smKvcRvE80uF5bQv8viFpYSK6foWCAAT_2G6HMMOBPg.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=7de1cb113d370e7f26b3e16a0345c65acb628075",
                                        "width": 320,
                                        "height": 240
                                    }
                                ],
                                "variants": {},
                                "id": "x3l65lsn72AP6v90n_7KH2i9U28yuDcHFmLefgdm4kc"
                            }
                        ],
                        "enabled": false
                    },
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "can_gild": false,
                    "spoiler": false,
                    "locked": false,
                    "author_flair_text": "Oldfag",
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_3bg30",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": "",
                    "id": "73338k",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "DrydonTheAlt",
                    "discussion_type": null,
                    "num_comments": 0,
                    "send_replies": true,
                    "whitelist_status": null,
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": "dark",
                    "permalink": "/r/Freebuild/comments/73338k/freddit_files_indefreddit_day_clip_grand_dad/",
                    "parent_whitelist_status": null,
                    "stickied": false,
                    "url": "https://www.youtube.com/watch?v=6CXzie7iCRk",
                    "subreddit_subscribers": 219,
                    "created_utc": 1506632631.0,
                    "num_crossposts": 0,
                    "media": {
                        "type": "youtube.com",
                        "oembed": {
                            "provider_url": "https://www.youtube.com/",
                            "version": "1.0",
                            "title": "The Freddit Files Movie - Indefreddit Day (UPDATED SNEAK PEEK)",
                            "type": "video",
                            "thumbnail_width": 480,
                            "height": 200,
                            "width": 356,
                            "html": "&lt;iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/6CXzie7iCRk?feature=oembed&amp;enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"The Freddit Files Movie - Indefreddit Day (UPDATED SNEAK PEEK)\"&gt;&lt;/iframe&gt;",
                            "author_name": "Drydon",
                            "provider_name": "YouTube",
                            "thumbnail_url": "https://i.ytimg.com/vi/6CXzie7iCRk/hqdefault.jpg",
                            "thumbnail_height": 360,
                            "author_url": "https://www.youtube.com/@drydon3382"
                        }
                    },
                    "is_video": false
                }
            },
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "Freebuild",
                    "selftext": "",
                    "author_fullname": "t2_azk9f",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "Glad to be a part of this community.",
                    "link_flair_richtext": [],
                    "subreddit_name_prefixed": "r/Freebuild",
                    "hidden": false,
                    "pwls": null,
                    "link_flair_css_class": "",
                    "downs": 0,
                    "thumbnail_height": 140,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_72s21c",
                    "quarantine": false,
                    "link_flair_text_color": null,
                    "upvote_ratio": 0.67,
                    "author_flair_background_color": null,
                    "subreddit_type": "public",
                    "ups": 3,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "thumbnail_width": 140,
                    "author_flair_template_id": "380f2bc0-e572-11e6-8991-0eee6de7faf4",
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": null,
                    "is_reddit_media_domain": true,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": "ART",
                    "can_mod_post": false,
                    "score": 3,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "https://b.thumbs.redditmedia.com/59207jq8kDHL7k1p5ZmW1jRcXzOaRYVjS9YcuXOLkVM.jpg",
                    "edited": false,
                    "author_flair_css_class": null,
                    "author_flair_richtext": [],
                    "gildings": {},
                    "post_hint": "image",
                    "content_categories": null,
                    "is_self": false,
                    "mod_note": null,
                    "created": 1506516887.0,
                    "link_flair_type": "text",
                    "wls": null,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "text",
                    "domain": "i.redd.it",
                    "allow_live_comments": false,
                    "selftext_html": null,
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "url_overridden_by_dest": "https://i.redd.it/7rtn62plafoz.png",
                    "view_count": null,
                    "archived": false,
                    "no_follow": false,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "preview": {
                        "images": [
                            {
                                "source": {
                                    "url": "https://preview.redd.it/7rtn62plafoz.png?auto=webp&amp;s=dbcd036942e3136666daa31dde9802d956187a0c",
                                    "width": 2500,
                                    "height": 4000
                                },
                                "resolutions": [
                                    {
                                        "url": "https://preview.redd.it/7rtn62plafoz.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=eb7a3ace96a3dd0ac4e019f3a9eb843bc411de1b",
                                        "width": 108,
                                        "height": 172
                                    },
                                    {
                                        "url": "https://preview.redd.it/7rtn62plafoz.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=543cdab776816ece88fe29645da728daa0ef06b4",
                                        "width": 216,
                                        "height": 345
                                    },
                                    {
                                        "url": "https://preview.redd.it/7rtn62plafoz.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=ab1e82eb7d9f5b7ddf247e6772aa97adbcfe82de",
                                        "width": 320,
                                        "height": 512
                                    },
                                    {
                                        "url": "https://preview.redd.it/7rtn62plafoz.png?width=640&amp;crop=smart&amp;auto=webp&amp;s=b887e4ad0b0d49284b48e7a6b88edb15f2b3fef1",
                                        "width": 640,
                                        "height": 1024
                                    },
                                    {
                                        "url": "https://preview.redd.it/7rtn62plafoz.png?width=960&amp;crop=smart&amp;auto=webp&amp;s=31fd6a072565d36d21c85bcc7836e129176caf51",
                                        "width": 960,
                                        "height": 1536
                                    },
                                    {
                                        "url": "https://preview.redd.it/7rtn62plafoz.png?width=1080&amp;crop=smart&amp;auto=webp&amp;s=cabc0cad08b0305f8f5d6dc340ca9dbd146a6473",
                                        "width": 1080,
                                        "height": 1728
                                    }
                                ],
                                "variants": {},
                                "id": "qbmlfYetpshytUwT3_cfJaSvEtHy29gR636TFt7UEJ0"
                            }
                        ],
                        "enabled": true
                    },
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "can_gild": false,
                    "spoiler": false,
                    "locked": false,
                    "author_flair_text": "Fetusfag",
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_3bg30",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": null,
                    "id": "72s21c",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "LEEDLEMAN",
                    "discussion_type": null,
                    "num_comments": 1,
                    "send_replies": true,
                    "whitelist_status": null,
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": "dark",
                    "permalink": "/r/Freebuild/comments/72s21c/glad_to_be_a_part_of_this_community/",
                    "parent_whitelist_status": null,
                    "stickied": false,
                    "url": "https://i.redd.it/7rtn62plafoz.png",
                    "subreddit_subscribers": 219,
                    "created_utc": 1506516887.0,
                    "num_crossposts": 0,
                    "media": null,
                    "is_video": false
                }
            },
            {
                "kind": "t3",
                "data": {
                    "approved_at_utc": null,
                    "subreddit": "Freebuild",
                    "selftext": "In the FF finale, we see that Chris dies by taking out HNT. Then, in the final scenes, we see Dry and Psy look at a UFO through a telescope and then \"To be continued in Indefreddit Day\".\n\nThe undertones of this scene (the fact that Dry and Psy are the ones who discovered it (they're the ones in charge of Indefreddit Day at this moment)) combined with the \"TO BE CONTINUED IN INDEFREDDIT DAY\" which, by the way, can be written as T.B.C. IN INDEFREDDIT DAY so shout out to that announcement TBC is on the movie, imply heavily the story continues from the series to the movie.\n\nHere's the problem. One year ago, when Indefreddit Day was announced (lmao), we saw the best movie scene of the century. I am talking, of course, about [the KEKEKEKEK BTW I STOLE HIS CAR GRAND DAD](https://www.youtube.com/watch?v=v3czA_LI-Wo) piece of art. Here we see Chris performing the best live action movie setpiece of all time.\n\nBut, as you saw in Freddit Files finale (SPOILERS) Chris died. **This means Chris can't steal the guy's car, listen to Grand Dad and yell KEKEKEKEK on Indefreddit Day**. Which in turn means - the peak of cinema has been butchered.\n\nAfter a year of waiting, all that was hope for us was the KEKEKEKEK scene, where we could hope to see it happening, unfolding before our eyes on the big screen. It's gone now. It pains me and I'm in great agony. Today is a sad day.\n\nSo long, grand dad.",
                    "author_fullname": "t2_hsaxm",
                    "saved": false,
                    "mod_reason_title": null,
                    "gilded": 0,
                    "clicked": false,
                    "title": "what the finale of freddit files means for the best movie scene of all time (SPOILERS)",
                    "link_flair_richtext": [],
                    "subreddit_name_prefixed": "r/Freebuild",
                    "hidden": false,
                    "pwls": null,
                    "link_flair_css_class": "",
                    "downs": 0,
                    "thumbnail_height": null,
                    "top_awarded_type": null,
                    "hide_score": false,
                    "name": "t3_72lpoq",
                    "quarantine": false,
                    "link_flair_text_color": null,
                    "upvote_ratio": 1.0,
                    "author_flair_background_color": "",
                    "subreddit_type": "public",
                    "ups": 5,
                    "total_awards_received": 0,
                    "media_embed": {},
                    "thumbnail_width": null,
                    "author_flair_template_id": null,
                    "is_original_content": false,
                    "user_reports": [],
                    "secure_media": null,
                    "is_reddit_media_domain": false,
                    "is_meta": false,
                    "category": null,
                    "secure_media_embed": {},
                    "link_flair_text": "SPECULATION",
                    "can_mod_post": false,
                    "score": 5,
                    "approved_by": null,
                    "is_created_from_ads_ui": false,
                    "author_premium": false,
                    "thumbnail": "spoiler",
                    "edited": 1506445171.0,
                    "author_flair_css_class": null,
                    "author_flair_richtext": [],
                    "gildings": {},
                    "post_hint": "self",
                    "content_categories": null,
                    "is_self": true,
                    "mod_note": null,
                    "created": 1506444975.0,
                    "link_flair_type": "text",
                    "wls": null,
                    "removed_by_category": null,
                    "banned_by": null,
                    "author_flair_type": "text",
                    "domain": "self.Freebuild",
                    "allow_live_comments": false,
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In the FF finale, we see that Chris dies by taking out HNT. Then, in the final scenes, we see Dry and Psy look at a UFO through a telescope and then &amp;quot;To be continued in Indefreddit Day&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;The undertones of this scene (the fact that Dry and Psy are the ones who discovered it (they&amp;#39;re the ones in charge of Indefreddit Day at this moment)) combined with the &amp;quot;TO BE CONTINUED IN INDEFREDDIT DAY&amp;quot; which, by the way, can be written as T.B.C. IN INDEFREDDIT DAY so shout out to that announcement TBC is on the movie, imply heavily the story continues from the series to the movie.&lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s the problem. One year ago, when Indefreddit Day was announced (lmao), we saw the best movie scene of the century. I am talking, of course, about &lt;a href=\"https://www.youtube.com/watch?v=v3czA_LI-Wo\"&gt;the KEKEKEKEK BTW I STOLE HIS CAR GRAND DAD&lt;/a&gt; piece of art. Here we see Chris performing the best live action movie setpiece of all time.&lt;/p&gt;\n\n&lt;p&gt;But, as you saw in Freddit Files finale (SPOILERS) Chris died. &lt;strong&gt;This means Chris can&amp;#39;t steal the guy&amp;#39;s car, listen to Grand Dad and yell KEKEKEKEK on Indefreddit Day&lt;/strong&gt;. Which in turn means - the peak of cinema has been butchered.&lt;/p&gt;\n\n&lt;p&gt;After a year of waiting, all that was hope for us was the KEKEKEKEK scene, where we could hope to see it happening, unfolding before our eyes on the big screen. It&amp;#39;s gone now. It pains me and I&amp;#39;m in great agony. Today is a sad day.&lt;/p&gt;\n\n&lt;p&gt;So long, grand dad.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "likes": null,
                    "suggested_sort": null,
                    "banned_at_utc": null,
                    "view_count": null,
                    "archived": false,
                    "no_follow": false,
                    "is_crosspostable": false,
                    "pinned": false,
                    "over_18": false,
                    "preview": {
                        "images": [
                            {
                                "source": {
                                    "url": "https://external-preview.redd.it/U2NPWsMHb5GulFzRZ6Qq998brfRoYqXXiKvfQoD99NY.jpg?auto=webp&amp;s=925fe5d43fa82d2081d3e7f4c451a352eb02c477",
                                    "width": 480,
                                    "height": 360
                                },
                                "resolutions": [
                                    {
                                        "url": "https://external-preview.redd.it/U2NPWsMHb5GulFzRZ6Qq998brfRoYqXXiKvfQoD99NY.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=d64891f265fa41ff0a6316d6e1b2090af94b0b57",
                                        "width": 108,
                                        "height": 81
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/U2NPWsMHb5GulFzRZ6Qq998brfRoYqXXiKvfQoD99NY.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=5820b3269156fd915f914eae9c389e860b117f6a",
                                        "width": 216,
                                        "height": 162
                                    },
                                    {
                                        "url": "https://external-preview.redd.it/U2NPWsMHb5GulFzRZ6Qq998brfRoYqXXiKvfQoD99NY.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=4f46783b68295f13ea26510ac11a32b3e73430d6",
                                        "width": 320,
                                        "height": 240
                                    }
                                ],
                                "variants": {
                                    "obfuscated": {
                                        "source": {
                                            "url": "https://external-preview.redd.it/U2NPWsMHb5GulFzRZ6Qq998brfRoYqXXiKvfQoD99NY.jpg?blur=40&amp;format=pjpg&amp;auto=webp&amp;s=1176d496fc2006334d96f14e4437aca0657f52ea",
                                            "width": 480,
                                            "height": 360
                                        },
                                        "resolutions": [
                                            {
                                                "url": "https://external-preview.redd.it/U2NPWsMHb5GulFzRZ6Qq998brfRoYqXXiKvfQoD99NY.jpg?width=108&amp;crop=smart&amp;blur=10&amp;format=pjpg&amp;auto=webp&amp;s=6b02481794cdd62ed2782c3e6a4880e5c7ae618c",
                                                "width": 108,
                                                "height": 81
                                            },
                                            {
                                                "url": "https://external-preview.redd.it/U2NPWsMHb5GulFzRZ6Qq998brfRoYqXXiKvfQoD99NY.jpg?width=216&amp;crop=smart&amp;blur=21&amp;format=pjpg&amp;auto=webp&amp;s=2299e5ffe6bb17790e593a9ed1b06b84c5d43eb7",
                                                "width": 216,
                                                "height": 162
                                            },
                                            {
                                                "url": "https://external-preview.redd.it/U2NPWsMHb5GulFzRZ6Qq998brfRoYqXXiKvfQoD99NY.jpg?width=320&amp;crop=smart&amp;blur=32&amp;format=pjpg&amp;auto=webp&amp;s=135f73d06522d5ef7fcdadace24e87eaaec0af28",
                                                "width": 320,
                                                "height": 240
                                            }
                                        ]
                                    }
                                },
                                "id": "iv7IkyXbAuUTrPAe_bdch_M14UrmeZ6I9OQaQDWwsH4"
                            }
                        ],
                        "enabled": false
                    },
                    "all_awardings": [],
                    "awarders": [],
                    "media_only": false,
                    "can_gild": false,
                    "spoiler": true,
                    "locked": false,
                    "author_flair_text": "T.B.C",
                    "treatment_tags": [],
                    "visited": false,
                    "removed_by": null,
                    "num_reports": null,
                    "distinguished": null,
                    "subreddit_id": "t5_3bg30",
                    "author_is_blocked": false,
                    "mod_reason_by": null,
                    "removal_reason": null,
                    "link_flair_background_color": null,
                    "id": "72lpoq",
                    "is_robot_indexable": true,
                    "report_reasons": null,
                    "author": "Zoocanadanda",
                    "discussion_type": null,
                    "num_comments": 1,
                    "send_replies": true,
                    "whitelist_status": null,
                    "contest_mode": false,
                    "mod_reports": [],
                    "author_patreon_flair": false,
                    "author_flair_text_color": "dark",
                    "permalink": "/r/Freebuild/comments/72lpoq/what_the_finale_of_freddit_files_means_for_the/",
                    "parent_whitelist_status": null,
                    "stickied": false,
                    "url": "https://old.reddit.com/r/Freebuild/comments/72lpoq/what_the_finale_of_freddit_files_means_for_the/",
                    "subreddit_subscribers": 219,
                    "created_utc": 1506444975.0,
                    "num_crossposts": 0,
                    "media": null,
                    "is_video": false
                }
            }
        ],
        "before": "t3_7bk8fw"
    }
}