[
    {
        "kind": "Listing",
        "data": {
            "after": null,
            "dist": 1,
            "modhash": "",
            "geo_filter": "",
            "children": [
                {
                    "kind": "t3",
                    "data": {
                        "approved_at_utc": null,
                        "subreddit": "Freebuild",
                        "selftext": "The Underground has become a mess.\n\n**Entry 1:** Inactivity. The Underground is completely inactive. The most monsters I see outside everyday are 2-3, and even that's becoming rarer. Now, I get it-- it's the most inactive time of the year, but the surface is so much more active that it really feels like the Underground is truly dying.\n\n**Entry 2:** Deterioration of the kingdom. Magic is gone for one, so that absolutely sucks. I miss them. Asgore is also constantly sad. I'm serious. Just go to his castle, check it out! It's a gallery of Toriel porn! There seems to be nothing new happening, either. I heard Asgore was naming a new area: something he's just pulled from the shelf of namegeneration.com, no doubt. Sounds really special, doesn't it? Instead of a cool name made just for us, it's just... New Home. Equal to any other Gen 1 Pokemon name.\n\n**Entry 3:** Staff. Let's be honest here, the staff are not very good right now. I'm not trying to mindlessly offend anyone, but it's just a fact that the current staff team is not good. I'm going to break-down all of the royalty members, but instead of just offending them, I'm going to try to actually state the problems with them and how they moderate the server:\n\nToriel. I'd consider Peach the 'community mom'. That is NOT a bad thing. She monitors the community and deals with most drama situations. This is all fine, but... She's letting the kingdom deteriorate. She's not focusing on it. She's also constantly focused on children, but I might just think that due to our timezones.\n\nAsgore. The 'king'. He works on the kingdom and does what he can to improve it-- but he doesn't seem to really add all that much. And when he does, it's usually removed. He also seems to be restricted from doing anything else-- if he makes a community decision, all of the others backlash instantly.\n\nPapyrus. He... doesn't really do much of anything. He's hunting humans often sure, and he does solve some problems here and there, but he doesn't really do much staff related... I mean, creates puzzles for respective humans, but... that doesn't really count.\n\nMettaton. Mettaton seems to be the most active in the kingdom. He likes to make cool things and work on MTT: The Musical and MTTcorp. He does arrest people sometimes, but it feels more like he uses his celebrity rank just to make cool things. Not saying that's bad-- but he's left and rejoined as star multiple times for a reason. He doesn't really do much of the other staff stuff.\n\nAlphys. Active in the kingdom, and that's about it. Last time I tried to get her to do things she started watching anime instead. Doesn't really know how to do much either... and it doesn't really help that royal laws are messed up. No offense to her, but certainly not really a good royal scientist.\n\nSans. Wait, he's staff? I keep forgetting because he suffers a similar problem: doesn't really do staff things, and he's not even in the Underground that often, much less the Earthbound universe. Good guy: bad staff member.\n\nMuffet. Bakes very well! Doesn't do staff very well. I don't think I've ever seen her do any staff tasks at all.\n\nUndyne/The Undying/Fish Furry. A woman who goes by many names. She seems to do some staff things, and is maybe... 2nd staff most active in the kingdom after Mettaton? I haven't seen her do all that much staff stuff other than throwing spears at things and trying to be a likeable character.\n\nTemmie: hOI, go FoCK urself I'm tEM and Yuu cen eAT ShiT!!¿\n\n**Entry 4:** Expanding the Underground. People who fall in don't stay. They're asked 'are you human?' by staff a few times, and then they're killed, never to be seen again. The Underground is not welcoming to new fallers, and there is nothing that makes them interested to stay.\n\n**Entry 5:** 'Sexual' moments. The Undernet has gone way too far with this. First were the fanfics. They were one thing and they certainly messed me up the first time I saw them, and that was a long time ago. I think these things have gone even more overboard, though. The fanfics were messed up for sure, but they weren't on too often, and they were certainly 100% just for comedy. However, a lot of these things are serious now. People asking for yiff drawn, people talking about Toriel's Tits all the time, it's gone way overboard. And **JERRY** is also a large problem with this. The stories he makes up are even worse than the Fanfic Gen ever was. He goes super-overboard. I'm honestly getting sick of it-- and it's super weird. Like, these characters sorta represent the monsters in the Underground, and they're drawn fucking each other. You can NOT seriously think that that is not messed up.\n\n**Entry 6:** There are a few more personal reasons I want to leave too. I've been thinking about these things for a long time, but I still can't really decide if I really could leave. It's sometimes the hope that things can go back to how they were in the early times, especially when I was royal scientist for the first time... after the elections, of course. That was probably my sweet-spot for actual being-on-Underground time. Everything was active, things were good. and the war hadn't really ramped up to the level it did soon after. I don't know if that time is ever gonna come back, though. I don't see it coming back, so I don't really know if I should stay, especially with how things are now.\n\nThat's all I have to say for now.\n\n**Edit:** ✋ 💣✋☝☟❄ ✌☹💧⚐ 💣✌😐☜ ✌ 🕯👎✋💧👍⚐☼👎 💧☜☼✞☜☼ 🏱⚐💧❄🕯 ✌👌⚐🕆❄ 🏱☜⚐🏱☹☜ 🕈☟⚐ ❄☟✋☠😐 ❄☟✌❄ ❄☟☜ 💣✋☠☜👍☼✌☞❄ 💧☜☼✞☜☼ 🏱⚐☼❄✋⚐☠ ✋💧 ✋☼☼☜☹☜✞✌☠❄\n\n- W.D. Gaster",
                        "user_reports": [],
                        "saved": false,
                        "mod_reason_title": null,
                        "gilded": 0,
                        "clicked": false,
                        "title": "✋🕯💣 🏱☼⚐👌✌👌☹✡ ✈🕆✋❄❄✋☠☝ ☹☜✌✞✋☠☝ ❄☟☜ 🕆☠👎☜☼☝☼⚐🕆☠👎📪 ✌☠👎 ☟☜☼☜🕯💧 ✌ 👍⚐🕆🏱☹☜ ⚐☞ ☼☜✌💧⚐☠💧 🕈☟✡📬 ☎✌☹💧⚐ ✌☠ ⚐✞☜☼✌☹☹ 🕆☠👎☜☼☠☜❄ ☼✌☠❄✆",
                        "link_flair_richtext": [],
                        "subreddit_name_prefixed": "r/Freebuild",
                        "hidden": false,
                        "pwls": null,
                        "link_flair_css_class": null,
                        "downs": 0,
                        "thumbnail_height": null,
                        "top_awarded_type": null,
                        "parent_whitelist_status": null,
                        "hide_score": false,
                        "name": "t3_7blpat",
                        "quarantine": false,
                        "link_flair_text_color": "dark",
                        "upvote_ratio": 0.78,
                        "author_flair_background_color": null,
                        "subreddit_type": "public",
                        "ups": 5,
                        "total_awards_received": 0,
                        "media_embed": {},
                        "thumbnail_width": null,
                        "author_flair_template_id": null,
                        "is_original_content": false,
                        "author_fullname": "t2_ftdwb",
                        "secure_media": null,
                        "is_reddit_media_domain": false,
                        "is_meta": false,
                        "category": null,
                        "secure_media_embed": {},
                        "link_flair_text": null,
                        "can_mod_post": false,
                        "score": 5,
                        "approved_by": null,
                        "is_created_from_ads_ui": false,
                        "author_premium": false,
                        "thumbnail": "self",
                        "edited": false,
                        "author_flair_css_class": null,
                        "author_flair_richtext": [],
                        "gildings": {},
                        "content_categories": null,
                        "is_self": true,
                        "mod_note": null,
                        "created": 1510151982.0,
                        "link_flair_type": "text",
                        "wls": null,
                        "removed_by_category": null,
                        "banned_by": null,
                        "author_flair_type": "text",
                        "domain": "self.Freebuild",
                        "allow_live_comments": true,
                        "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The Underground has become a mess.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Entry 1:&lt;/strong&gt; Inactivity. The Underground is completely inactive. The most monsters I see outside everyday are 2-3, and even that&amp;#39;s becoming rarer. Now, I get it-- it&amp;#39;s the most inactive time of the year, but the surface is so much more active that it really feels like the Underground is truly dying.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Entry 2:&lt;/strong&gt; Deterioration of the kingdom. Magic is gone for one, so that absolutely sucks. I miss them. Asgore is also constantly sad. I&amp;#39;m serious. Just go to his castle, check it out! It&amp;#39;s a gallery of Toriel porn! There seems to be nothing new happening, either. I heard Asgore was naming a new area: something he&amp;#39;s just pulled from the shelf of namegeneration.com, no doubt. Sounds really special, doesn&amp;#39;t it? Instead of a cool name made just for us, it&amp;#39;s just... New Home. Equal to any other Gen 1 Pokemon name.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Entry 3:&lt;/strong&gt; Staff. Let&amp;#39;s be honest here, the staff are not very good right now. I&amp;#39;m not trying to mindlessly offend anyone, but it&amp;#39;s just a fact that the current staff team is not good. I&amp;#39;m going to break-down all of the royalty members, but instead of just offending them, I&amp;#39;m going to try to actually state the problems with them and how they moderate the server:&lt;/p&gt;\n\n&lt;p&gt;Toriel. I&amp;#39;d consider Peach the &amp;#39;community mom&amp;#39;. That is NOT a bad thing. She monitors the community and deals with most drama situations. This is all fine, but... She&amp;#39;s letting the kingdom deteriorate. She&amp;#39;s not focusing on it. She&amp;#39;s also constantly focused on children, but I might just think that due to our timezones.&lt;/p&gt;\n\n&lt;p&gt;Asgore. The &amp;#39;king&amp;#39;. He works on the kingdom and does what he can to improve it-- but he doesn&amp;#39;t seem to really add all that much. And when he does, it&amp;#39;s usually removed. He also seems to be restricted from doing anything else-- if he makes a community decision, all of the others backlash instantly.&lt;/p&gt;\n\n&lt;p&gt;Papyrus. He... doesn&amp;#39;t really do much of anything. He&amp;#39;s hunting humans often sure, and he does solve some problems here and there, but he doesn&amp;#39;t really do much staff related... I mean, creates puzzles for respective humans, but... that doesn&amp;#39;t really count.&lt;/p&gt;\n\n&lt;p&gt;Mettaton. Mettaton seems to be the most active in the kingdom. He likes to make cool things and work on MTT: The Musical and MTTcorp. He does arrest people sometimes, but it feels more like he uses his celebrity rank just to make cool things. Not saying that&amp;#39;s bad-- but he&amp;#39;s left and rejoined as star multiple times for a reason. He doesn&amp;#39;t really do much of the other staff stuff.&lt;/p&gt;\n\n&lt;p&gt;Alphys. Active in the kingdom, and that&amp;#39;s about it. Last time I tried to get her to do things she started watching anime instead. Doesn&amp;#39;t really know how to do much either... and it doesn&amp;#39;t really help that royal laws are messed up. No offense to her, but certainly not really a good royal scientist.&lt;/p&gt;\n\n&lt;p&gt;Sans. Wait, he&amp;#39;s staff? I keep forgetting because he suffers a similar problem: doesn&amp;#39;t really do staff things, and he&amp;#39;s not even in the Underground that often, much less the Earthbound universe. Good guy: bad staff member.&lt;/p&gt;\n\n&lt;p&gt;Muffet. Bakes very well! Doesn&amp;#39;t do staff very well. I don&amp;#39;t think I&amp;#39;ve ever seen her do any staff tasks at all.&lt;/p&gt;\n\n&lt;p&gt;Undyne/The Undying/Fish Furry. A woman who goes by many names. She seems to do some staff things, and is maybe... 2nd staff most active in the kingdom after Mettaton? I haven&amp;#39;t seen her do all that much staff stuff other than throwing spears at things and trying to be a likeable character.&lt;/p&gt;\n\n&lt;p&gt;Temmie: hOI, go FoCK urself I&amp;#39;m tEM and Yuu cen eAT ShiT!!¿&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Entry 4:&lt;/strong&gt; Expanding the Underground. People who fall in don&amp;#39;t stay. They&amp;#39;re asked &amp;#39;are you human?&amp;#39; by staff a few times, and then they&amp;#39;re killed, never to be seen again. The Underground is not welcoming to new fallers, and there is nothing that makes them interested to stay.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Entry 5:&lt;/strong&gt; &amp;#39;Sexual&amp;#39; moments. The Undernet has gone way too far with this. First were the fanfics. They were one thing and they certainly messed me up the first time I saw them, and that was a long time ago. I think these things have gone even more overboard, though. The fanfics were messed up for sure, but they weren&amp;#39;t on too often, and they were certainly 100% just for comedy. However, a lot of these things are serious now. People asking for yiff drawn, people talking about Toriel&amp;#39;s Tits all the time, it&amp;#39;s gone way overboard. And &lt;strong&gt;JERRY&lt;/strong&gt; is also a large problem with this. The stories he makes up are even worse than the Fanfic Gen ever was. He goes super-overboard. I&amp;#39;m honestly getting sick of it-- and it&amp;#39;s super weird. Like, these characters sorta represent the monsters in the Underground, and they&amp;#39;re drawn fucking each other. You can NOT seriously think that that is not messed up.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Entry 6:&lt;/strong&gt; There are a few more personal reasons I want to leave too. I&amp;#39;ve been thinking about these things for a long time, but I still can&amp;#39;t really decide if I really could leave. It&amp;#39;s sometimes the hope that things can go back to how they were in the early times, especially when I was royal scientist for the first time... after the elections, of course. That was probably my sweet-spot for actual being-on-Underground time. Everything was active, things were good. and the war hadn&amp;#39;t really ramped up to the level it did soon after. I don&amp;#39;t know if that time is ever gonna come back, though. I don&amp;#39;t see it coming back, so I don&amp;#39;t really know if I should stay, especially with how things are now.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s all I have to say for now.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Edit:&lt;/strong&gt; ✋ 💣✋☝☟❄ ✌☹💧⚐ 💣✌😐☜ ✌ 🕯👎✋💧👍⚐☼👎 💧☜☼✞☜☼ 🏱⚐💧❄🕯 ✌👌⚐🕆❄ 🏱☜⚐🏱☹☜ 🕈☟⚐ ❄☟✋☠😐 ❄☟✌❄ ❄☟☜ 💣✋☠☜👍☼✌☞❄ 💧☜☼✞☜☼ 🏱⚐☼❄✋⚐☠ ✋💧 ✋☼☼☜☹☜✞✌☠❄&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;W.D. Gaster&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                        "likes": null,
                        "suggested_sort": null,
                        "banned_at_utc": null,
                        "view_count": null,
                        "archived": false,
                        "no_follow": false,
                        "is_crosspostable": false,
                        "pinned": false,
                        "over_18": false,
                        "all_awardings": [],
                        "awarders": [],
                        "media_only": false,
                        "can_gild": false,
                        "spoiler": false,
                        "locked": false,
                        "author_flair_text": null,
                        "treatment_tags": [],
                        "visited": false,
                        "removed_by": null,
                        "num_reports": null,
                        "distinguished": null,
                        "subreddit_id": "t5_3bg30",
                        "author_is_blocked": false,
                        "mod_reason_by": null,
                        "removal_reason": null,
                        "link_flair_background_color": "",
                        "id": "7blpat",
                        "is_robot_indexable": true,
                        "num_duplicates": 0,
                        "report_reasons": null,
                        "author": "BloodFork",
                        "discussion_type": null,
                        "num_comments": 1,
                        "send_replies": true,
                        "media": null,
                        "contest_mode": false,
                        "author_patreon_flair": false,
                        "author_flair_text_color": null,
                        "permalink": "/r/Freebuild/comments/7blpat/_/",
                        "whitelist_status": null,
                        "stickied": false,
                        "url": "https://old.reddit.com/r/Freebuild/comments/7blpat/_/",
                        "subreddit_subscribers": 219,
                        "created_utc": 1510151982.0,
                        "num_crossposts": 0,
                        "mod_reports": [],
                        "is_video": false
                    }
                }
            ],
            "before": null
        }
    },
    {
        "kind": "Listing",
        "data": {
            "after": null,
            "dist": null,
            "modhash": "",
            "geo_filter": "",
            "children": [
                {
                    "kind": "t1",
                    "data": {
                        "subreddit_id": "t5_3bg30",
                        "approved_at_utc": null,
                        "author_is_blocked": false,
                        "comment_type": null,
                        "awarders": [],
                        "mod_reason_by": null,
                        "banned_by": null,
                        "author_flair_type": "text",
                        "total_awards_received": 0,
                        "subreddit": "Freebuild",
                        "author_flair_template_id": null,
                        "likes": null,
                        "replies": "",
                        "user_reports": [],
                        "saved": false,
                        "id": "dpj2i29",
                        "banned_at_utc": null,
                        "mod_reason_title": null,
                        "gilded": 0,
                        "archived": false,
                        "collapsed_reason_code": null,
                        "no_follow": true,
                        "author": "PigLadAl",
                        "can_mod_post": false,
                        "created_utc": 1510159154.0,
                        "send_replies": true,
                        "parent_id": "t3_7blpat",
                        "score": 1,
                        "author_fullname": "t2_erfid",
                        "approved_by": null,
                        "mod_note": null,
                        "all_awardings": [],
                        "collapsed": false,
                        "body": "shut up sans",
                        "edited": false,
                        "top_awarded_type": null,
                        "author_flair_css_class": "",
                        "name": "t1_dpj2i29",
                        "is_submitter": false,
                        "downs": 0,
                        "author_flair_richtext": [],
                        "author_patreon_flair": false,
                        "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;shut up sans&lt;/p&gt;\n&lt;/div&gt;",
                        "removal_reason": null,
                        "collapsed_reason": null,
                        "distinguished": null,
                        "associated_award": null,
                        "stickied": false,
                        "author_premium": false,
                        "can_gild": false,
                        "gildings": {},
                        "unrepliable_reason": null,
                        "author_flair_text_color": "dark",
                        "score_hidden": false,
                        "permalink": "/r/Freebuild/comments/7blpat/_/dpj2i29/",
                        "subreddit_type": "public",
                        "locked": false,
                        "report_reasons": null,
                        "created": 1510159154.0,
                        "author_flair_text": "Beaned",
                        "treatment_tags": [],
                        "link_id": "t3_7blpat",
                        "subreddit_name_prefixed": "r/Freebuild",
                        "controversiality": 0,
                        "depth": 0,
                        "author_flair_background_color": "",
                        "collapsed_because_crowd_control": null,
                        "mod_reports": [],
                        "num_reports": null,
                        "ups": 1
                    }
                }
            ],
            "before": null
        }
    }
]