[
    {
        "kind": "Listing",
        "data": {
            "after": null,
            "dist": 1,
            "modhash": "",
            "geo_filter": "",
            "children": [
                {
                    "kind": "t3",
                    "data": {
                        "approved_at_utc": null,
                        "subreddit": "Freebuild",
                        "selftext": "There comes a time, in everybody's life, what truly honestly, is important. Sometimes in the world, you can see the darkness in this life. The darkness in the world. Today? No. That is not today. Not today, not here, not now in any way shape or form. Are we going to let the darkness of this world overtake the one true source of light we have left in this life? Yes. It's true. I am of course talking about The Freddit Meme Awards of 2018. Yours truly, Greg Thanos, has been nominated for meme of the year. We must all do our part in this fight whether we feel like we're a part of it or not. Because the truth is, this affects all of us. Every single one of us. Every single one of us needs to fight harder than we've ever fought before when the darkness seems overwhelmingly grim. That's when we must truly, truly dig harder then you've ever dug before. In the comments there is a link to the Meme Awards poll. I recommend you go there immediately right now, don't wait, don't hesitate, don't do anything that you wouldn't ordinarily do on a good day like today. \n\nAnd make sure you vote now because there is NOTHING more important in this world than what we are doing today. I am going to use my ONE ABILITY, MY ONE TALENT, my ONE GOD-GIVEN strength ability to speak endlessly to make sure you understand the importance of what we are doing here today. With your mouse device, you can scroll down to the comments below and you can click that link to go to the Meme Awards poll page and vote for a Greg Thanos meme. Blanket, Me pretending to be Thanos for an actual 5 months, the GTA V saga--Doesn't matter. You will have done your part. But the fight doesn't end there, oh no no no. The message must be spread as far as possible. You can do MORE than pressing that donate button. If you have already donated, you need to know now, that you can tell everybody--Your neighbors, your friends, your family members, even your enemies. Because even our enemies need to do something in this fight.\nI remember a long time ago when I was a child. A man once spoke to me, before I could understand what he was talking about, he said to me--\"SON! Someday. You will be called upon. You will be called upon, and you will KNOW. You will KNOW, with the certainty of a fire of a thousand suns, you will KNOW that you must do your part.\" I said to him \"NAY, GOOD SIR! I am just a poor boy, with no GTA V! I don't know what my part is!\" But NO! Today I know. Today I finally know. And you know now.\nDO. YOUR. PART. This isn't just about YOU, this isnt just about ME. This is about what's right. What needs to be done for Freddit. This is about respect. And I RESPECT the fact that I have been nominated for the Meme Awards. I RESPECT that people think I am a dank memer. So go vote for me on the Meme Awards page. Do your part. If your watching this, and you're not on the voting page right now, you need to this immediately. If you don't have a Google account, you need to create one. You need to create one right now. Because never has there been anything important than what I am saying right now. IGNORE THE GTA 5 BLACK BARS THING. What we talked about today doesn't even matter EVEN A LITTLE BIT REMOTELY to what we're doing right here, right now, today in this moment.\nDig deep. Look inside yourself. See the true purpose of your life and know that this, right now is the ONE TRUE CALLING of Freddit's entire existence.\n\nTHIS DAY, more than any other. matters. Because on this day there might even be no coming back. There might be no coming back from this one. IF YOU DON'T GO TO Freddit's Meme Awards and vote for a Greg Thanos meme, there will be no coming back. The darkness will win. The darkness will win, and we cannot have that. We CAN'T HAVE THAT. Not today. Not ever. I remember something my computer engineering dad told me a long time ago. He took me out in the woods, and he said \"Son, one day. You'll have a calling in your life. You'll know that Freddit Freebuild will need. And if you see something even remotely related to something looking like a Faz, and anything looking like a star, YOU WILL KNOW! THE FACE OF EVIL.\"\n\n\nYou know what age he was when he said that to me? I was 7 years old. I was only 7 years old. And today I am CHANNELING that 7 year old boy's wisdom through my 14 year old body. DON'T HESITATE. Don't think. Just click that link and vote for me, Gregory Thanos, also known as Alfred Molina and Tom Holland's whore. You have to vote for a Dry meme. For everyone on Freddit. For everyone around you. I don't want to live in a world where not a single Dry meme wins the Meme Awards. Do you?\n\n\n\n\n\n\nThis is Gregory \"Dry\" Thanos/Alfred Molina/Tom Holland's Bitch/Drydon, signing off. Keep meming my bruddas, kno da wae!",
                        "user_reports": [],
                        "saved": false,
                        "mod_reason_title": null,
                        "gilded": 0,
                        "clicked": false,
                        "title": "Greg Thanos: My Campaign Speech.",
                        "link_flair_richtext": [],
                        "subreddit_name_prefixed": "r/Freebuild",
                        "hidden": false,
                        "pwls": null,
                        "link_flair_css_class": null,
                        "downs": 0,
                        "thumbnail_height": null,
                        "top_awarded_type": null,
                        "parent_whitelist_status": null,
                        "hide_score": false,
                        "name": "t3_ae9lim",
                        "quarantine": false,
                        "link_flair_text_color": "dark",
                        "upvote_ratio": 1.0,
                        "author_flair_background_color": "",
                        "subreddit_type": "public",
                        "ups": 2,
                        "total_awards_received": 0,
                        "media_embed": {},
                        "thumbnail_width": null,
                        "author_flair_template_id": null,
                        "is_original_content": false,
                        "author_fullname": "t2_y6opy",
                        "secure_media": null,
                        "is_reddit_media_domain": false,
                        "is_meta": false,
                        "category": null,
                        "secure_media_embed": {},
                        "link_flair_text": null,
                        "can_mod_post": false,
                        "score": 2,
                        "approved_by": null,
                        "is_created_from_ads_ui": false,
                        "author_premium": false,
                        "thumbnail": "self",
                        "edited": 1547059692.0,
                        "author_flair_css_class": "",
                        "author_flair_richtext": [],
                        "gildings": {},
                        "content_categories": null,
                        "is_self": true,
                        "mod_note": null,
                        "created": 1547057842.0,
                        "link_flair_type": "text",
                        "wls": null,
                        "removed_by_category": null,
                        "banned_by": null,
                        "author_flair_type": "text",
                        "domain": "self.Freebuild",
                        "allow_live_comments": false,
                        "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;There comes a time, in everybody&amp;#39;s life, what truly honestly, is important. Sometimes in the world, you can see the darkness in this life. The darkness in the world. Today? No. That is not today. Not today, not here, not now in any way shape or form. Are we going to let the darkness of this world overtake the one true source of light we have left in this life? Yes. It&amp;#39;s true. I am of course talking about The Freddit Meme Awards of 2018. Yours truly, Greg Thanos, has been nominated for meme of the year. We must all do our part in this fight whether we feel like we&amp;#39;re a part of it or not. Because the truth is, this affects all of us. Every single one of us. Every single one of us needs to fight harder than we&amp;#39;ve ever fought before when the darkness seems overwhelmingly grim. That&amp;#39;s when we must truly, truly dig harder then you&amp;#39;ve ever dug before. In the comments there is a link to the Meme Awards poll. I recommend you go there immediately right now, don&amp;#39;t wait, don&amp;#39;t hesitate, don&amp;#39;t do anything that you wouldn&amp;#39;t ordinarily do on a good day like today. &lt;/p&gt;\n\n&lt;p&gt;And make sure you vote now because there is NOTHING more important in this world than what we are doing today. I am going to use my ONE ABILITY, MY ONE TALENT, my ONE GOD-GIVEN strength ability to speak endlessly to make sure you understand the importance of what we are doing here today. With your mouse device, you can scroll down to the comments below and you can click that link to go to the Meme Awards poll page and vote for a Greg Thanos meme. Blanket, Me pretending to be Thanos for an actual 5 months, the GTA V saga--Doesn&amp;#39;t matter. You will have done your part. But the fight doesn&amp;#39;t end there, oh no no no. The message must be spread as far as possible. You can do MORE than pressing that donate button. If you have already donated, you need to know now, that you can tell everybody--Your neighbors, your friends, your family members, even your enemies. Because even our enemies need to do something in this fight.\nI remember a long time ago when I was a child. A man once spoke to me, before I could understand what he was talking about, he said to me--&amp;quot;SON! Someday. You will be called upon. You will be called upon, and you will KNOW. You will KNOW, with the certainty of a fire of a thousand suns, you will KNOW that you must do your part.&amp;quot; I said to him &amp;quot;NAY, GOOD SIR! I am just a poor boy, with no GTA V! I don&amp;#39;t know what my part is!&amp;quot; But NO! Today I know. Today I finally know. And you know now.\nDO. YOUR. PART. This isn&amp;#39;t just about YOU, this isnt just about ME. This is about what&amp;#39;s right. What needs to be done for Freddit. This is about respect. And I RESPECT the fact that I have been nominated for the Meme Awards. I RESPECT that people think I am a dank memer. So go vote for me on the Meme Awards page. Do your part. If your watching this, and you&amp;#39;re not on the voting page right now, you need to this immediately. If you don&amp;#39;t have a Google account, you need to create one. You need to create one right now. Because never has there been anything important than what I am saying right now. IGNORE THE GTA 5 BLACK BARS THING. What we talked about today doesn&amp;#39;t even matter EVEN A LITTLE BIT REMOTELY to what we&amp;#39;re doing right here, right now, today in this moment.\nDig deep. Look inside yourself. See the true purpose of your life and know that this, right now is the ONE TRUE CALLING of Freddit&amp;#39;s entire existence.&lt;/p&gt;\n\n&lt;p&gt;THIS DAY, more than any other. matters. Because on this day there might even be no coming back. There might be no coming back from this one. IF YOU DON&amp;#39;T GO TO Freddit&amp;#39;s Meme Awards and vote for a Greg Thanos meme, there will be no coming back. The darkness will win. The darkness will win, and we cannot have that. We CAN&amp;#39;T HAVE THAT. Not today. Not ever. I remember something my computer engineering dad told me a long time ago. He took me out in the woods, and he said &amp;quot;Son, one day. You&amp;#39;ll have a calling in your life. You&amp;#39;ll know that Freddit Freebuild will need. And if you see something even remotely related to something looking like a Faz, and anything looking like a star, YOU WILL KNOW! THE FACE OF EVIL.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;You know what age he was when he said that to me? I was 7 years old. I was only 7 years old. And today I am CHANNELING that 7 year old boy&amp;#39;s wisdom through my 14 year old body. DON&amp;#39;T HESITATE. Don&amp;#39;t think. Just click that link and vote for me, Gregory Thanos, also known as Alfred Molina and Tom Holland&amp;#39;s whore. You have to vote for a Dry meme. For everyone on Freddit. For everyone around you. I don&amp;#39;t want to live in a world where not a single Dry meme wins the Meme Awards. Do you?&lt;/p&gt;\n\n&lt;p&gt;This is Gregory &amp;quot;Dry&amp;quot; Thanos/Alfred Molina/Tom Holland&amp;#39;s Bitch/Drydon, signing off. Keep meming my bruddas, kno da wae!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                        "likes": null,
                        "suggested_sort": null,
                        "banned_at_utc": null,
                        "view_count": null,
                        "archived": false,
                        "no_follow": false,
                        "is_crosspostable": false,
                        "pinned": false,
                        "over_18": false,
                        "all_awardings": [],
                        "awarders": [],
                        "media_only": false,
                        "can_gild": false,
                        "spoiler": false,
                        "locked": false,
                        "author_flair_text": "Oldfag",
                        "treatment_tags": [],
                        "visited": false,
                        "removed_by": null,
                        "num_reports": null,
                        "distinguished": null,
                        "subreddit_id": "t5_3bg30",
                        "author_is_blocked": false,
                        "mod_reason_by": null,
                        "removal_reason": null,
                        "link_flair_background_color": "",
                        "id": "ae9lim",
                        "is_robot_indexable": true,
                        "num_duplicates": 0,
                        "report_reasons": null,
                        "author": "DrydonTheAlt",
                        "discussion_type": null,
                        "num_comments": 1,
                        "send_replies": true,
                        "media": null,
                        "contest_mode": false,
                        "author_patreon_flair": false,
                        "author_flair_text_color": "dark",
                        "permalink": "/r/Freebuild/comments/ae9lim/greg_thanos_my_campaign_speech/",
                        "whitelist_status": null,
                        "stickied": false,
                        "url": "https://old.reddit.com/r/Freebuild/comments/ae9lim/greg_thanos_my_campaign_speech/",
                        "subreddit_subscribers": 219,
                        "created_utc": 1547057842.0,
                        "num_crossposts": 0,
                        "mod_reports": [],
                        "is_video": false
                    }
                }
            ],
            "before": null
        }
    },
    {
        "kind": "Listing",
        "data": {
            "after": null,
            "dist": null,
            "modhash": "",
            "geo_filter": "",
            "children": [],
            "before": null
        }
    }
]