[
    {
        "kind": "Listing",
        "data": {
            "after": null,
            "dist": 1,
            "modhash": "",
            "geo_filter": "",
            "children": [
                {
                    "kind": "t3",
                    "data": {
                        "approved_at_utc": null,
                        "subreddit": "Freebuild",
                        "selftext": "I'm not trying to start any hate on this, but I'm seriously annoyed. \nI've been a Vocaloid fan for a long, long time. I think now it's been about 10 years since I discovered Vocaloid and I love everything about it. But I'm sure that a lot of people have noticed by now that Miku is too damn popular. \nI don't hate Miku, do not get me wrong, but there are so many other Vocaloids out there. Where's their attention? Where are their original songs? Well, here are some topics that I want to rant about because, frankly, not many other people are going to say something. \nIn the Shops:\nWhen I go to a shop that sells anime and Vocaloid merchandise, a lot of the time the only thing I see in Vocaloid is Miku. Miku, Miku, Miku everywhere. Once and a great while I will be able to purchase a keychain or a plushie of Rin and Len and maybe a bracelet, but that's about it. Where the Hell are the others? I know that people and the stores are trying to make money and sometimes putting out one set thing is the only way to do it, but you can at least put out something for the others. \nGames:\nI have two of the games that Crypton has released for . Especially in Project Mirai, Miku has a majority of the songs in the games. Yes, there is a way to change who sings in DX, but it's still annoying. Most of the time when Miku does a duet with someone else, they are the backup singers. Anyone notice how Luka is only a backup in World's End Dancehall? My point is there. It's saddening and when I got further into the game and unlocked more songs, I wanted to throw my controller or my DS across the room. \nConcerts:\nJust like the games, Miku has a majority of the songs in the concerts. Really? REALLY? It was meant to be a VOCALOID CONCERT, not a MIKU concert. If you have the balls to call it a Vocaloid concert, then give more songs to the others. Honestly, I've been waiting to hear a duet between Luka and Kaito, or Luka and Meiko, or more Kaito and Meiko duets. Seriously? Could you please change it up a little bit?\nExpos:\nSnow Miku, Racing Miku, Miku Expo. What is the one word that is in all of those? It's pretty straight forward. Why can't there be a Crypton or Vocaloid in general expo? Why can't we have an Expo where all of the Vocaloids are showcased and not just one?\nArt/Fanart:\nThis is the one of the things that ticks me off the most. Don't get me wrong, there are many artists out there that are really good at what they do. But most of the time, whenever I see fanart of the other Vocaloids, they are being used a sex toys and porn! Meiko and Luka are shown are sluts and Len is just a shota from what I've seen. Can you people please make some legit fanart and not the girls showing off their cleavage or the guys licking popsicles? \nMMD: \nWhy is it called Miku Miku Dance? Why are you naming it after one certain person when people are making models of themselves in this program? Couldn't you name it something that is a bit better and symbolizes everyone? They make it sound like Miku is the only model you can use in MMD. \nHating on the Others:\nMost of the people I have had arguments with will always tell me that a Vocaloid's voice sucks, but they don't give a good reason. It is not the Vocaloid's fault that they may not sound right, it is the person using them. Honestly not even that. Some people are beginners and are trying to get the hang of things. Vocaloids do not make the songs themselves people! \nThe Fanbase: Youtube:\nLet's start with Youtube. Whenever I go on Youtube and look up a Miku song that another Vocaloid covers, there is at least one comment that says \"Omg Miku is totally better!\" or \"This totally sucks! Miku's cover is better!\"\n...\nReally. \nOkay, I know right now that someone is going to comment on this and say \"People have their own opinions.\" Yes, to each their own. And that's the point. If you like another Vocaloid's cover, good for you. But when you are going to comment and say that this Vocaloid is better than this, please just shut your trap, take your hands off the keyboard, and go to another video. Comments should be used for constructive criticism, not hate. If you are going to comment on a Vocaloid cover, tell that person how good their Mixing skills are or how they could improve. The old saying still stands, if you have nothing nice to say, don't say anything. \nThe Fanbase: The People:\nHere we are. The one thing that annoys me the most. People. Specifically people that practically worship Miku. These people are like twelve year olds, you can't win against them. They will always use the worst reasons to say that Miku is better than everyone. I've had so many fights with these \"Mikutards.\" Yes, I respect your opinion, but when I tell you that I prefer Meiko's cover of Common World Domination over Miku's, you don't need to shove a bunch of crap down my throat. \n\"Miku is so much better than everyone because she's so adorable and kawaii and popular!\" \n\"Umm....shouldn't you be jugding it by their voices and not their looks? For example, Meiko and Kaito were the first Japanese Vocaloids. They deserve a medal for that.\" \n\"You're so stupid! Hater! Miku is totally better!\" \nUgghhhhhhhhh. I hate speaking to these people. Vocaloid was meant to be known for their voices, not their looks. \nBefore You Read the Next Topic: \nI said it before that I don't hate Miku, I am simply annoyed that she is gaining all the popularity and none of the other Vocaloids get anything. And when I say Vocaloid, I mean VOCALOID. There are so many other companies that make Vocaloids, not just Crypton.\nMiku isn't bad at all. When she is used correctly, she can sing very well. And the same goes for every other Vocaloid. So before you move on, know that no hate is going towards Miku, it's towards Crypton and the fanbase.  \nCrypton:\nI know I'm gonna tick off quite a few people here. \nIn short, Crypton needs to stop shoving all the Vocaloids they make in the closet because Miku is taking up space. Money is a big thing, but that doesn't mean you should favour one over the others. The other's still make the money, don't they? You people should see the statistics for Kaito. He sells quite a bit. And when they speak of their fans, they speak as if everyone loves Miku. Say Vocaloid Fans, you idiots.\nDo you not remember the things you created?\nThose first sounds that each Vocaloid made when they were finally finished,\nDo you not cherish those moments? \nThose first sounds that they made,\nWeren't they beautiful?",
                        "user_reports": [],
                        "saved": false,
                        "mod_reason_title": null,
                        "gilded": 0,
                        "clicked": false,
                        "title": "THE MIKU RANT",
                        "link_flair_richtext": [],
                        "subreddit_name_prefixed": "r/Freebuild",
                        "hidden": false,
                        "pwls": null,
                        "link_flair_css_class": null,
                        "downs": 0,
                        "thumbnail_height": null,
                        "top_awarded_type": null,
                        "parent_whitelist_status": null,
                        "hide_score": false,
                        "name": "t3_hw9vky",
                        "quarantine": false,
                        "link_flair_text_color": "dark",
                        "upvote_ratio": 0.84,
                        "author_flair_background_color": "",
                        "subreddit_type": "public",
                        "ups": 4,
                        "total_awards_received": 0,
                        "media_embed": {},
                        "thumbnail_width": null,
                        "author_flair_template_id": null,
                        "is_original_content": false,
                        "author_fullname": "t2_m7sw8",
                        "secure_media": null,
                        "is_reddit_media_domain": false,
                        "is_meta": false,
                        "category": null,
                        "secure_media_embed": {},
                        "link_flair_text": null,
                        "can_mod_post": false,
                        "score": 4,
                        "approved_by": null,
                        "is_created_from_ads_ui": false,
                        "author_premium": false,
                        "thumbnail": "self",
                        "edited": false,
                        "author_flair_css_class": "",
                        "author_flair_richtext": [],
                        "gildings": {},
                        "content_categories": null,
                        "is_self": true,
                        "mod_note": null,
                        "created": 1595481457.0,
                        "link_flair_type": "text",
                        "wls": null,
                        "removed_by_category": null,
                        "banned_by": null,
                        "author_flair_type": "text",
                        "domain": "self.Freebuild",
                        "allow_live_comments": false,
                        "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not trying to start any hate on this, but I&amp;#39;m seriously annoyed. \nI&amp;#39;ve been a Vocaloid fan for a long, long time. I think now it&amp;#39;s been about 10 years since I discovered Vocaloid and I love everything about it. But I&amp;#39;m sure that a lot of people have noticed by now that Miku is too damn popular. \nI don&amp;#39;t hate Miku, do not get me wrong, but there are so many other Vocaloids out there. Where&amp;#39;s their attention? Where are their original songs? Well, here are some topics that I want to rant about because, frankly, not many other people are going to say something. \nIn the Shops:\nWhen I go to a shop that sells anime and Vocaloid merchandise, a lot of the time the only thing I see in Vocaloid is Miku. Miku, Miku, Miku everywhere. Once and a great while I will be able to purchase a keychain or a plushie of Rin and Len and maybe a bracelet, but that&amp;#39;s about it. Where the Hell are the others? I know that people and the stores are trying to make money and sometimes putting out one set thing is the only way to do it, but you can at least put out something for the others. \nGames:\nI have two of the games that Crypton has released for . Especially in Project Mirai, Miku has a majority of the songs in the games. Yes, there is a way to change who sings in DX, but it&amp;#39;s still annoying. Most of the time when Miku does a duet with someone else, they are the backup singers. Anyone notice how Luka is only a backup in World&amp;#39;s End Dancehall? My point is there. It&amp;#39;s saddening and when I got further into the game and unlocked more songs, I wanted to throw my controller or my DS across the room. \nConcerts:\nJust like the games, Miku has a majority of the songs in the concerts. Really? REALLY? It was meant to be a VOCALOID CONCERT, not a MIKU concert. If you have the balls to call it a Vocaloid concert, then give more songs to the others. Honestly, I&amp;#39;ve been waiting to hear a duet between Luka and Kaito, or Luka and Meiko, or more Kaito and Meiko duets. Seriously? Could you please change it up a little bit?\nExpos:\nSnow Miku, Racing Miku, Miku Expo. What is the one word that is in all of those? It&amp;#39;s pretty straight forward. Why can&amp;#39;t there be a Crypton or Vocaloid in general expo? Why can&amp;#39;t we have an Expo where all of the Vocaloids are showcased and not just one?\nArt/Fanart:\nThis is the one of the things that ticks me off the most. Don&amp;#39;t get me wrong, there are many artists out there that are really good at what they do. But most of the time, whenever I see fanart of the other Vocaloids, they are being used a sex toys and porn! Meiko and Luka are shown are sluts and Len is just a shota from what I&amp;#39;ve seen. Can you people please make some legit fanart and not the girls showing off their cleavage or the guys licking popsicles? \nMMD: \nWhy is it called Miku Miku Dance? Why are you naming it after one certain person when people are making models of themselves in this program? Couldn&amp;#39;t you name it something that is a bit better and symbolizes everyone? They make it sound like Miku is the only model you can use in MMD. \nHating on the Others:\nMost of the people I have had arguments with will always tell me that a Vocaloid&amp;#39;s voice sucks, but they don&amp;#39;t give a good reason. It is not the Vocaloid&amp;#39;s fault that they may not sound right, it is the person using them. Honestly not even that. Some people are beginners and are trying to get the hang of things. Vocaloids do not make the songs themselves people! \nThe Fanbase: Youtube:\nLet&amp;#39;s start with Youtube. Whenever I go on Youtube and look up a Miku song that another Vocaloid covers, there is at least one comment that says &amp;quot;Omg Miku is totally better!&amp;quot; or &amp;quot;This totally sucks! Miku&amp;#39;s cover is better!&amp;quot;\n...\nReally. \nOkay, I know right now that someone is going to comment on this and say &amp;quot;People have their own opinions.&amp;quot; Yes, to each their own. And that&amp;#39;s the point. If you like another Vocaloid&amp;#39;s cover, good for you. But when you are going to comment and say that this Vocaloid is better than this, please just shut your trap, take your hands off the keyboard, and go to another video. Comments should be used for constructive criticism, not hate. If you are going to comment on a Vocaloid cover, tell that person how good their Mixing skills are or how they could improve. The old saying still stands, if you have nothing nice to say, don&amp;#39;t say anything. \nThe Fanbase: The People:\nHere we are. The one thing that annoys me the most. People. Specifically people that practically worship Miku. These people are like twelve year olds, you can&amp;#39;t win against them. They will always use the worst reasons to say that Miku is better than everyone. I&amp;#39;ve had so many fights with these &amp;quot;Mikutards.&amp;quot; Yes, I respect your opinion, but when I tell you that I prefer Meiko&amp;#39;s cover of Common World Domination over Miku&amp;#39;s, you don&amp;#39;t need to shove a bunch of crap down my throat. \n&amp;quot;Miku is so much better than everyone because she&amp;#39;s so adorable and kawaii and popular!&amp;quot; \n&amp;quot;Umm....shouldn&amp;#39;t you be jugding it by their voices and not their looks? For example, Meiko and Kaito were the first Japanese Vocaloids. They deserve a medal for that.&amp;quot; \n&amp;quot;You&amp;#39;re so stupid! Hater! Miku is totally better!&amp;quot; \nUgghhhhhhhhh. I hate speaking to these people. Vocaloid was meant to be known for their voices, not their looks. \nBefore You Read the Next Topic: \nI said it before that I don&amp;#39;t hate Miku, I am simply annoyed that she is gaining all the popularity and none of the other Vocaloids get anything. And when I say Vocaloid, I mean VOCALOID. There are so many other companies that make Vocaloids, not just Crypton.\nMiku isn&amp;#39;t bad at all. When she is used correctly, she can sing very well. And the same goes for every other Vocaloid. So before you move on, know that no hate is going towards Miku, it&amp;#39;s towards Crypton and the fanbase.&lt;br/&gt;\nCrypton:\nI know I&amp;#39;m gonna tick off quite a few people here. \nIn short, Crypton needs to stop shoving all the Vocaloids they make in the closet because Miku is taking up space. Money is a big thing, but that doesn&amp;#39;t mean you should favour one over the others. The other&amp;#39;s still make the money, don&amp;#39;t they? You people should see the statistics for Kaito. He sells quite a bit. And when they speak of their fans, they speak as if everyone loves Miku. Say Vocaloid Fans, you idiots.\nDo you not remember the things you created?\nThose first sounds that each Vocaloid made when they were finally finished,\nDo you not cherish those moments? \nThose first sounds that they made,\nWeren&amp;#39;t they beautiful?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                        "likes": null,
                        "suggested_sort": null,
                        "banned_at_utc": null,
                        "view_count": null,
                        "archived": false,
                        "no_follow": false,
                        "is_crosspostable": false,
                        "pinned": false,
                        "over_18": false,
                        "all_awardings": [],
                        "awarders": [],
                        "media_only": false,
                        "can_gild": false,
                        "spoiler": false,
                        "locked": false,
                        "author_flair_text": "Oldfag",
                        "treatment_tags": [],
                        "visited": false,
                        "removed_by": null,
                        "num_reports": null,
                        "distinguished": null,
                        "subreddit_id": "t5_3bg30",
                        "author_is_blocked": false,
                        "mod_reason_by": null,
                        "removal_reason": null,
                        "link_flair_background_color": "",
                        "id": "hw9vky",
                        "is_robot_indexable": true,
                        "num_duplicates": 0,
                        "report_reasons": null,
                        "author": "WafflePikachu",
                        "discussion_type": null,
                        "num_comments": 0,
                        "send_replies": true,
                        "media": null,
                        "contest_mode": false,
                        "author_patreon_flair": false,
                        "author_flair_text_color": "dark",
                        "permalink": "/r/Freebuild/comments/hw9vky/the_miku_rant/",
                        "whitelist_status": null,
                        "stickied": false,
                        "url": "https://old.reddit.com/r/Freebuild/comments/hw9vky/the_miku_rant/",
                        "subreddit_subscribers": 219,
                        "created_utc": 1595481457.0,
                        "num_crossposts": 0,
                        "mod_reports": [],
                        "is_video": false
                    }
                }
            ],
            "before": null
        }
    },
    {
        "kind": "Listing",
        "data": {
            "after": null,
            "dist": null,
            "modhash": "",
            "geo_filter": "",
            "children": [],
            "before": null
        }
    }
]