[
    {
        "kind": "Listing",
        "data": {
            "after": null,
            "dist": 1,
            "modhash": "",
            "geo_filter": "",
            "children": [
                {
                    "kind": "t3",
                    "data": {
                        "approved_at_utc": null,
                        "subreddit": "Freebuild",
                        "selftext": "I think this goes without saying, but, I'll admit, I fucked up. Although I feel like I'm on good terms with Zoo and Dante, there's no changing what I did.   \n\n\nThis isn't an appeal, this is an apology, and.. an update, I guess. It's far too early for me to make an appeal and I'm not sure if I even want to make one.   \n\n\nFreddit matters to me. It's an place for me to just be myself, talk with friends, post art, etc. It's such a unique little community, and there's else like it. Some of the people here are really nice, while some.. aren't.   \n\n\nI know that I'm generally talked about in a more negative light in the server, and I know that there are a select few who tend to bring me up when it's not necessarily relevant. Malka and Moth specifically. My point is, you know who you are. I'm not mad about it, since it's completely out of my control, and right now I don't exactly care much about Freddit in general. You people have your reasons.   \n\n\nI'm sorry for what I've done. WorldSMP I didn't handle very well, and, because of that I got into multiple arguments about it and said some things I wasn't proud of. One time I even insulted someone for reporting a portal without even knowing who they were. I mean, if that's not toxic behavior, what is? After Malka had blown up my base, which, was something that was completely allowed within the rules of the smp. Moth went on to trap my spawn location. During this time, I insulted Zoo, insulted Dante, and came back into the vc to further insult Dante, and everyone else in the vc. I've apologized to both Dante and Zoo, and again I believe we're on good terms right now. They're good people and I shouldn't've said what I said. I even made a short animatic showing what happened between me and Zoo, and, although I didn't mean for it to come off mean spirited, it did. It was insensitive for me to make it in the first place. Christ I even genuinely gas-lit Zoo for basically no reason..   \n\n\nMy point is, I'm sorry. To those of you who I was friends with on Freddit, Kirb, Orb, Tangy, Kirb, Magee, etc. You know who you are, and, I'm sorry if your image of me has changed. You guys are great and I love all of you.   \n\n\nDuring my ban I've been trying to catch up with my schoolwork as well as write DiamondLore. Currently I have a Discord server where I post my lore, and a Twitter account where I post Diamondlore updates regularly. If anyone ever needs to reach me, My discord @ is Forever Nailo#2447. My DMs are always open, and you can always talk to me in my lore discord, or even on Twitter.   \n\n\n [discord.gg/eG8f2qcUUQ](https://t.co/G6l7q31jrb?amp=1) &lt; Personal lore discord   \n\n\n [twitter.com/DBRNUpdates](https://twitter.com/DBRNUpdates) &lt; Diamondlore updates twitter acc   \n\n\nI hope you're all doing well. That'll be all for now. \n\n\\- Faz  \n\n\nPS - I know about Achilles' whole Australia thing, and just know that me and him talk about that relatively regularly. I'm trying to help him not pull a me again and make everyone hate him, or make him end up embarrassing himself, while also having fun and \"continuing my legacy\" or something. Anyways, bye for now, **Mates.**",
                        "user_reports": [],
                        "saved": false,
                        "mod_reason_title": null,
                        "gilded": 0,
                        "clicked": false,
                        "title": "Text (Optional)",
                        "link_flair_richtext": [],
                        "subreddit_name_prefixed": "r/Freebuild",
                        "hidden": false,
                        "pwls": null,
                        "link_flair_css_class": null,
                        "downs": 0,
                        "thumbnail_height": null,
                        "top_awarded_type": null,
                        "parent_whitelist_status": null,
                        "hide_score": false,
                        "name": "t3_ljid8c",
                        "quarantine": false,
                        "link_flair_text_color": "dark",
                        "upvote_ratio": 1.0,
                        "author_flair_background_color": "",
                        "subreddit_type": "public",
                        "ups": 1,
                        "total_awards_received": 0,
                        "media_embed": {},
                        "thumbnail_width": null,
                        "author_flair_template_id": null,
                        "is_original_content": false,
                        "author_fullname": "t2_16p6hj",
                        "secure_media": null,
                        "is_reddit_media_domain": false,
                        "is_meta": false,
                        "category": null,
                        "secure_media_embed": {},
                        "link_flair_text": null,
                        "can_mod_post": false,
                        "score": 1,
                        "approved_by": null,
                        "is_created_from_ads_ui": false,
                        "author_premium": false,
                        "thumbnail": "self",
                        "edited": false,
                        "author_flair_css_class": null,
                        "author_flair_richtext": [],
                        "gildings": {},
                        "post_hint": "self",
                        "content_categories": null,
                        "is_self": true,
                        "mod_note": null,
                        "created": 1613280999.0,
                        "link_flair_type": "text",
                        "wls": null,
                        "removed_by_category": null,
                        "banned_by": null,
                        "author_flair_type": "text",
                        "domain": "self.Freebuild",
                        "allow_live_comments": false,
                        "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I think this goes without saying, but, I&amp;#39;ll admit, I fucked up. Although I feel like I&amp;#39;m on good terms with Zoo and Dante, there&amp;#39;s no changing what I did.   &lt;/p&gt;\n\n&lt;p&gt;This isn&amp;#39;t an appeal, this is an apology, and.. an update, I guess. It&amp;#39;s far too early for me to make an appeal and I&amp;#39;m not sure if I even want to make one.   &lt;/p&gt;\n\n&lt;p&gt;Freddit matters to me. It&amp;#39;s an place for me to just be myself, talk with friends, post art, etc. It&amp;#39;s such a unique little community, and there&amp;#39;s else like it. Some of the people here are really nice, while some.. aren&amp;#39;t.   &lt;/p&gt;\n\n&lt;p&gt;I know that I&amp;#39;m generally talked about in a more negative light in the server, and I know that there are a select few who tend to bring me up when it&amp;#39;s not necessarily relevant. Malka and Moth specifically. My point is, you know who you are. I&amp;#39;m not mad about it, since it&amp;#39;s completely out of my control, and right now I don&amp;#39;t exactly care much about Freddit in general. You people have your reasons.   &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sorry for what I&amp;#39;ve done. WorldSMP I didn&amp;#39;t handle very well, and, because of that I got into multiple arguments about it and said some things I wasn&amp;#39;t proud of. One time I even insulted someone for reporting a portal without even knowing who they were. I mean, if that&amp;#39;s not toxic behavior, what is? After Malka had blown up my base, which, was something that was completely allowed within the rules of the smp. Moth went on to trap my spawn location. During this time, I insulted Zoo, insulted Dante, and came back into the vc to further insult Dante, and everyone else in the vc. I&amp;#39;ve apologized to both Dante and Zoo, and again I believe we&amp;#39;re on good terms right now. They&amp;#39;re good people and I shouldn&amp;#39;t&amp;#39;ve said what I said. I even made a short animatic showing what happened between me and Zoo, and, although I didn&amp;#39;t mean for it to come off mean spirited, it did. It was insensitive for me to make it in the first place. Christ I even genuinely gas-lit Zoo for basically no reason..   &lt;/p&gt;\n\n&lt;p&gt;My point is, I&amp;#39;m sorry. To those of you who I was friends with on Freddit, Kirb, Orb, Tangy, Kirb, Magee, etc. You know who you are, and, I&amp;#39;m sorry if your image of me has changed. You guys are great and I love all of you.   &lt;/p&gt;\n\n&lt;p&gt;During my ban I&amp;#39;ve been trying to catch up with my schoolwork as well as write DiamondLore. Currently I have a Discord server where I post my lore, and a Twitter account where I post Diamondlore updates regularly. If anyone ever needs to reach me, My discord @ is Forever Nailo#2447. My DMs are always open, and you can always talk to me in my lore discord, or even on Twitter.   &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://t.co/G6l7q31jrb?amp=1\"&gt;discord.gg/eG8f2qcUUQ&lt;/a&gt; &amp;lt; Personal lore discord   &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://twitter.com/DBRNUpdates\"&gt;twitter.com/DBRNUpdates&lt;/a&gt; &amp;lt; Diamondlore updates twitter acc   &lt;/p&gt;\n\n&lt;p&gt;I hope you&amp;#39;re all doing well. That&amp;#39;ll be all for now. &lt;/p&gt;\n\n&lt;p&gt;- Faz  &lt;/p&gt;\n\n&lt;p&gt;PS - I know about Achilles&amp;#39; whole Australia thing, and just know that me and him talk about that relatively regularly. I&amp;#39;m trying to help him not pull a me again and make everyone hate him, or make him end up embarrassing himself, while also having fun and &amp;quot;continuing my legacy&amp;quot; or something. Anyways, bye for now, &lt;strong&gt;Mates.&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                        "likes": null,
                        "suggested_sort": null,
                        "banned_at_utc": null,
                        "view_count": null,
                        "archived": false,
                        "no_follow": true,
                        "is_crosspostable": false,
                        "pinned": false,
                        "over_18": false,
                        "preview": {
                            "images": [
                                {
                                    "source": {
                                        "url": "https://external-preview.redd.it/DO3Vwr_UExIgmwwhmjxxUhJH3nQwR0HggBkBAzrjszs.jpg?auto=webp&amp;s=4c7b959797e7781f3c76cbba5e8a28f4a94a8f13",
                                        "width": 223,
                                        "height": 223
                                    },
                                    "resolutions": [
                                        {
                                            "url": "https://external-preview.redd.it/DO3Vwr_UExIgmwwhmjxxUhJH3nQwR0HggBkBAzrjszs.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=8f85e977165ce535712601e9d845763318508767",
                                            "width": 108,
                                            "height": 108
                                        },
                                        {
                                            "url": "https://external-preview.redd.it/DO3Vwr_UExIgmwwhmjxxUhJH3nQwR0HggBkBAzrjszs.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=4d72e6d2d539fb8584b5b57b9bf4a15971054d7e",
                                            "width": 216,
                                            "height": 216
                                        }
                                    ],
                                    "variants": {},
                                    "id": "8e7cctjsjuGadFaZIUSAJI2SlLUvh7OxvsSDZc2my9A"
                                }
                            ],
                            "enabled": false
                        },
                        "all_awardings": [],
                        "awarders": [],
                        "media_only": false,
                        "can_gild": false,
                        "spoiler": false,
                        "locked": false,
                        "author_flair_text": "DIAMONDLORE REFERENCE",
                        "treatment_tags": [],
                        "visited": false,
                        "removed_by": null,
                        "num_reports": null,
                        "distinguished": null,
                        "subreddit_id": "t5_3bg30",
                        "author_is_blocked": false,
                        "mod_reason_by": null,
                        "removal_reason": null,
                        "link_flair_background_color": "",
                        "id": "ljid8c",
                        "is_robot_indexable": true,
                        "num_duplicates": 0,
                        "report_reasons": null,
                        "author": "AdvFaz24",
                        "discussion_type": null,
                        "num_comments": 0,
                        "send_replies": true,
                        "media": null,
                        "contest_mode": false,
                        "author_patreon_flair": false,
                        "author_flair_text_color": "dark",
                        "permalink": "/r/Freebuild/comments/ljid8c/text_optional/",
                        "whitelist_status": null,
                        "stickied": false,
                        "url": "https://old.reddit.com/r/Freebuild/comments/ljid8c/text_optional/",
                        "subreddit_subscribers": 219,
                        "created_utc": 1613280999.0,
                        "num_crossposts": 0,
                        "mod_reports": [],
                        "is_video": false
                    }
                }
            ],
            "before": null
        }
    },
    {
        "kind": "Listing",
        "data": {
            "after": null,
            "dist": null,
            "modhash": "",
            "geo_filter": "",
            "children": [],
            "before": null
        }
    }
]