[
    {
        "kind": "Listing",
        "data": {
            "after": null,
            "dist": 1,
            "modhash": "",
            "geo_filter": "",
            "children": [
                {
                    "kind": "t3",
                    "data": {
                        "approved_at_utc": null,
                        "subreddit": "ReversalHub",
                        "selftext": "#PLEASE READ PART 1 AND PROLOGUE FIRST OR YOU WILL BE COMPLETELY LOST\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPres had been walking for miles following the trail. \"Maybe I'm just wasting my time..\" said Pres. Suddenly, he stumbled upon a sign. \"Reversal City?\" said Pres. \"What the?\" He continued walking forward, until he found himself in the middle of the city. Pres levitated into the air to check out the buildings. \"Well, this place has got decent architecture. That's good.\" He look around, deciding to look at the apartment building. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\"Now this shit looks comfortable..\" Pres looked around. \"Damn, I feel so lone-\" Suddenly, he spotted Noble carrying something up...It had a red blanket over it, but it was shaped like a UFO. He carried it by rope. Curious, Pres followed him.\n\n\n\n\n\n\n\n\nNoble dragged the object into his room, pulling off the blanket. \"It's that idiot's UFO! That means...this guy knows the little shit!\" said Pres, looking through the window.\n\n\n\n\n\n\n\n\n\n\n\"I got your stupid UFO, okay?!\" said Noble. He entered the closet, and saw Dry finishing up a device.\n\n\n\n\n\n\n\n\n\n\n\n\"What in the hell? Where'd you get the materials to build that?!\" asked Noble.\n\n\n\n\n\n\n\nSuddenly, Zoo came in. \"You guys! Someone stole materials from OrbCorp!\" said Zoo.\n\n\n\n\n\n\n\n\n\n\n\n\"No idea what you're talking about. Get out.\" replied Dry.\n\n\n\n\n\n\n\n\n\n\"Fine, jesus.\" said Zoo, closing the door.\n\n\n\n\n\"...Really, uh...\"Dry\"? You had to go and steal it?\" said Noble.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\"Shut up, it's quick. Besides, what else could I have done?\" said Dry.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNoble sighs. \"What even is that thing?\" he asked.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\"It's a signal thingy. It's gonna transmit a signal to my commander, Captain XJ4. Once he receives the signal, he'll give me everything I need via transporter.\" explained Dry. \"Pretty clever, hm?\"\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\"...It actually sounds kinda simple.\" said Noble. \"Wait, if your commander can transport objects, can't he transport you back to the ship so you can leave?\"\n\n\n\n\n\n\n\n\n\n\n\n\n\n\"It would be nice, but no. He can't transport matter.\" replied Dry. \"Alright, let's see how this goes.\" Dry pressed a button. The device showed the words 'SIGNAL SENT'.\n\n\n\n\n\n\n\n\n\n\n\"Message received, baby! OOHHH!\" said Dry.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\"Quiet down, dammit! Now what?\" asked Noble.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\"Now, we wait.\" said Dry.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNoble sighed and exited the room. Dry sat down, watching TV. \"Jesus christ...I'm all alone here..Stranded.\" said Dry. \"Oh well. At least I'll have my shit in a few hours.\" Suddenly, Pres burst through the window.\n\n\n\n\n\n\n\n\n\n\n\n\"What the hell?! What are you?!\" said Dry.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\"You don't remember me, huh?! I'm not surprised! I could NEVER forget you after what you did to me!\" said Pres.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\"I don't know what  you are, and I don't know what you're talking about!\" replied Dry. \n\n\n\n\n\n\n\n\n\n\n\"I'm the guy you marooned on this earth with your shitty UFO!\" said Pres.\n\n\n\n\n\n\n\n\n\n\n\"No, you're a triangle. I didn't do shit to you. So please, do me a favor and go away.\" said Dry.\n\n\n\n\n\n\n\n\nPres, enraged by this, ran Dry into the wall. \"YOUR  UFO HAD SOME KIND OF MAGNET! IT FORCED ME TO FOLLOW YOUR SHIP WHEREVER IT WENT! I had to fly threw space following a shitty ship FOR TWO HOURS, while you were in there not hearing my cries for help. I know that because I have a WATCH!\" said Pres, showing Dry his watch. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\"Hey listen, I wanna go home too!\" replied Dry.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\"IF IT WASN'T FOR YOU, I WOULDN'T BE MAROONED ON THIS GOD FORSAKEN PLANET!\" shouted Pres. Grabbing Dry, Pres threw Dry to the window.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\"You're making a BIG MISTAKE HERE!\" said Dry, throwing a punch. Pres caught his punch very easily, and threw Dry into the closet. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\"I'VE BEEN WAITING TO DO THIS ALL DAY!\" screamed Pres. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDry reached for his blaster, grabbed it, and shot Pres. Pres fell, unconscious. \"If I was a cold-hearted alien, I'd probably wouldn't have changed the setting to 'Stun'.\" said Dry. You're welcome.\"\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nVia feet, Dry rolled Pres out the window...as Pres fell into the dumpster. Dry put on a disguise and left the room. Walking out of the building, Dry climbed a rooftop by ladder, and saw Noble, Ebola, and Zoo drinking at the pub. Climbing down, Dry sprinted into the pub and walked up to the three humans. \n\n\n\n\n\n\n\n\n\n\n\n\n\"Oh, hey, uh...What's your names? I actually never got them.\" asked Dry.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\"I'm Ebola.\" said Ebola.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\"I'm Noble.\" said Noble.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\"Hello, I'm Zoo.\"\n\n\n\n\n\n\n\n\n\n\n\n\n\n\"Oh, hey, Noble, Zoo, Ebola, we gotta get out of here, family emergency or shit like that.\" said Dry.\n\n\n\n\n\n\n\n\n\n\n\n\n\"Hey, they gotta pay the tip!\" said DedicatedWam, the bartender.\n\n\n\n\n\n\n\n\n\nDry rolled his eyes, took out a freeze pistol and froze Dedicated. Walking outside, Dry explained everything that happened.\n\n\n\n\n\n\n\n\n\n\n\"So you weren't alone when you came here?! Jesus!\" said Zoo.\n\n\n\n\n\n\n\n\n\n\n\n\"Yeah. Now he's kind of trying to murder me and anyone I care about, so, yeah.\" said Dry.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\"What are we gonna do?!\" said Ebola.\n\n\n\n\n\n\n\n\n\n\"Calm down, Ebola. All we have to do is negotiate. And protect the balls from being kicked the shit out of.\" said Dry. \"Now, he's currently unconscious in the dumpster, so let's go find his body.\"\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhen they checked on the dumpster, it was empty. \"...Where is the triangle, Dry?\" asked Zoo.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\"...It was right here.\" said Dry. \"Oh crap. I think it might've..\"\n\n\n\n\n\n\n\n\n\n\n\n\"Hey look, a shooting star...In the day?\" said Noble.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThat shooting star turned out to be Pres, as he tackled Dry from the sky.\n\n\n\n\n\n\n\n\n\n\"AAH!\" screamed Dry as Pres punched him across the face. Pres punched him again, and Dry put his hands on Pres's head and threw him off. Pres ripped off Dry's wig, threw it on the ground, and levitated into the sky, holding Dry. When they were outside the last floor, Dry headbutted Pres, and Pres threw him into Noble's room.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\"Oh, shit!! We have to get up there!\" said Zoo. The three humans raced into the building, and entered the elevator.\n\n\n\n\n\n\n\n\n\n\n\n\nMeanwhile, Dry pulled out his freeze pistol and froze Pres' head. Pres walked into walls, trying to crack the ice. Dry grabbed his head, and forced it into the wall, breaking the ice. \n\n\n\n\n\n\n\n\n\n\n\n\n\"JUST LEAVE ME ALONE!\" screamed Dry.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\"NEVER!!\" shouted Pres.\n\n\n\n\n\n\n\n\n\n\n\nPres threw Dry into the closet. Pres' eye was red. Dry crawled into a corner, and looked at the time. \"3...2...1!\" said Dry. Suddenly, a bed materialized in the air, and fell on Pres! \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\"WHAT...THE...HELL!\" screamed Pres, trying to crawl out of it.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\"THANK YOU, COMMANDER XJ4!\" shouted Dry.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\"What the hell's going on here?!\" said Pres.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\"I'm getting everything I need!\" replied Dry. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThen a table appeared. Then a furnace! Then brewing stands, technical things, a computer! In mere seconds, an entire lab was made! Pres crawled out from under the bed, but Dry froze Pres' legs again. \"Oh, great. What now?!\" demanded Pres. Dry appeared to be making a potion. Pres fell on the floor repeatedly, trying to make his ice crack.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFinally, Dry was done with the potion. \"Phosphine gas, don't fail me now!\" said Dry. He ran out of the closet, and threw the potion down, as phosphine gas was synthesized. Dry shut the closet door, but heard no coughing. Breathing heavily, Noble, Zoo and Ebola entered. \n\n\n\n\n\n\n\n\n\n\n\n\"What happened?!\" asked Noble. \"What's going on?!\"\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\"I...I created deadly toxin. He's suffocating in there.\" said Dry.\n\n\n\n\n\n\n\n\n\n\nThey waited a few moments before opening the door. Pres had not been harmed! He was standing right in front of them!\n\n\n\n\n\n\n\n\n\"But...But..How?! Why won't you...\" said Zoo.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\"No lungs, idiots!\" said Pres. \"Deadly toxin can't kill me!\" Pres prepared to end Dry.\n\n\n\n\n\n\n\n\n\n\n\n\"WAIT! STOP! DON'T DO ANYTHING ELSE!\" said Noble.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\"Oh, for god's sake..\" said Pres.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\"Look, we understand how tough it might be to be marooned on a world you have no experience with, but that DOESN'T MEAN YOU CAN GO AROUND TRYING TO MURDER SOMEONE FOR A MISTAKE.\" said Noble.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\"How about you stop acting like a psycho and get to work on getting home yourself?\" said Ebola.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\"And hey, while you're at that, maybe help rainbow here get back home as well? Maybe he can help you-.\" said Zoo.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\"ALRIGHT, jesus! You don't have to bust my balls!\" said Pres. \"I won't try to kill him... for now. But there's no way I'm letting this piece of trash here help me get home. He's sabotaged my life enough.\" said Pres. \"End of story.\"\n\n\n\n\n\n\n\n\n\n\n\n\n\"So I get to live?\" said Dry.\n\n\n\n\n\n\n\n\n\n\n\n\"Yeah...But let me make one thing clear. We are *not* friends. Now if you'll excuse me, I'm gonna go get to work.\" said Pres, exiting the room, floating out.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\"Well?\" asked Ebola. \"Are you gonna thank us or what?\" \n\n\n\n\n\n\n\n\n\n\n\n\"Yeah, no time for thanking. We've got work to do.\" said Dry.\n\n\n\n\n\n\n\n\n\n\n\n\n\"Wait, we? You're gonna let us help you?\" asked Noble.\n\n\n\n\n\n\n\n\n\n\n\n\n\"Yeah, sure, why not. You did save me on the highway, and gave me a place to stay, so uh...Sure.\" said Dry.\n\n\n\n\n\n\n\n\n\n\n\n\"Hell, yeah!\" said Zoo. \"What can we do?\"\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\"You're gonna help me get home.\" said Dry. \"And go on crazy adventures along the way, because I invent things and will kidnap you.\"\n\n\n\n\n\n\n\n\n\n\n\n\n\n\"Alright!\" said Ebola. \"Let's do this!\"\n\n\n\n\n\n\n\n\n\n\n\n#THE END#",
                        "user_reports": [],
                        "saved": false,
                        "mod_reason_title": null,
                        "gilded": 0,
                        "clicked": false,
                        "title": "Homeward Bound - Chapter I Part II - The Visitor",
                        "link_flair_richtext": [],
                        "subreddit_name_prefixed": "r/ReversalHub",
                        "hidden": false,
                        "pwls": null,
                        "link_flair_css_class": null,
                        "downs": 0,
                        "thumbnail_height": null,
                        "top_awarded_type": null,
                        "parent_whitelist_status": null,
                        "hide_score": false,
                        "name": "t3_4vf5gj",
                        "quarantine": false,
                        "link_flair_text_color": "dark",
                        "upvote_ratio": 1.0,
                        "author_flair_background_color": null,
                        "subreddit_type": "restricted",
                        "ups": 3,
                        "total_awards_received": 0,
                        "media_embed": {},
                        "thumbnail_width": null,
                        "author_flair_template_id": null,
                        "is_original_content": false,
                        "author_fullname": "t2_y6opy",
                        "secure_media": null,
                        "is_reddit_media_domain": false,
                        "is_meta": false,
                        "category": null,
                        "secure_media_embed": {},
                        "link_flair_text": null,
                        "can_mod_post": false,
                        "score": 3,
                        "approved_by": null,
                        "is_created_from_ads_ui": false,
                        "author_premium": false,
                        "thumbnail": "self",
                        "edited": 1470522362.0,
                        "author_flair_css_class": null,
                        "author_flair_richtext": [],
                        "gildings": {},
                        "content_categories": null,
                        "is_self": true,
                        "mod_note": null,
                        "created": 1469930405.0,
                        "link_flair_type": "text",
                        "wls": null,
                        "removed_by_category": null,
                        "banned_by": null,
                        "author_flair_type": "text",
                        "domain": "self.ReversalHub",
                        "allow_live_comments": false,
                        "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;h1&gt;PLEASE READ PART 1 AND PROLOGUE FIRST OR YOU WILL BE COMPLETELY LOST&lt;/h1&gt;\n\n&lt;p&gt;Pres had been walking for miles following the trail. &amp;quot;Maybe I&amp;#39;m just wasting my time..&amp;quot; said Pres. Suddenly, he stumbled upon a sign. &amp;quot;Reversal City?&amp;quot; said Pres. &amp;quot;What the?&amp;quot; He continued walking forward, until he found himself in the middle of the city. Pres levitated into the air to check out the buildings. &amp;quot;Well, this place has got decent architecture. That&amp;#39;s good.&amp;quot; He look around, deciding to look at the apartment building. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Now this shit looks comfortable..&amp;quot; Pres looked around. &amp;quot;Damn, I feel so lone-&amp;quot; Suddenly, he spotted Noble carrying something up...It had a red blanket over it, but it was shaped like a UFO. He carried it by rope. Curious, Pres followed him.&lt;/p&gt;\n\n&lt;p&gt;Noble dragged the object into his room, pulling off the blanket. &amp;quot;It&amp;#39;s that idiot&amp;#39;s UFO! That means...this guy knows the little shit!&amp;quot; said Pres, looking through the window.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I got your stupid UFO, okay?!&amp;quot; said Noble. He entered the closet, and saw Dry finishing up a device.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;What in the hell? Where&amp;#39;d you get the materials to build that?!&amp;quot; asked Noble.&lt;/p&gt;\n\n&lt;p&gt;Suddenly, Zoo came in. &amp;quot;You guys! Someone stole materials from OrbCorp!&amp;quot; said Zoo.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;No idea what you&amp;#39;re talking about. Get out.&amp;quot; replied Dry.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Fine, jesus.&amp;quot; said Zoo, closing the door.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;...Really, uh...&amp;quot;Dry&amp;quot;? You had to go and steal it?&amp;quot; said Noble.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Shut up, it&amp;#39;s quick. Besides, what else could I have done?&amp;quot; said Dry.&lt;/p&gt;\n\n&lt;p&gt;Noble sighs. &amp;quot;What even is that thing?&amp;quot; he asked.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;It&amp;#39;s a signal thingy. It&amp;#39;s gonna transmit a signal to my commander, Captain XJ4. Once he receives the signal, he&amp;#39;ll give me everything I need via transporter.&amp;quot; explained Dry. &amp;quot;Pretty clever, hm?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;...It actually sounds kinda simple.&amp;quot; said Noble. &amp;quot;Wait, if your commander can transport objects, can&amp;#39;t he transport you back to the ship so you can leave?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;It would be nice, but no. He can&amp;#39;t transport matter.&amp;quot; replied Dry. &amp;quot;Alright, let&amp;#39;s see how this goes.&amp;quot; Dry pressed a button. The device showed the words &amp;#39;SIGNAL SENT&amp;#39;.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Message received, baby! OOHHH!&amp;quot; said Dry.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Quiet down, dammit! Now what?&amp;quot; asked Noble.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Now, we wait.&amp;quot; said Dry.&lt;/p&gt;\n\n&lt;p&gt;Noble sighed and exited the room. Dry sat down, watching TV. &amp;quot;Jesus christ...I&amp;#39;m all alone here..Stranded.&amp;quot; said Dry. &amp;quot;Oh well. At least I&amp;#39;ll have my shit in a few hours.&amp;quot; Suddenly, Pres burst through the window.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;What the hell?! What are you?!&amp;quot; said Dry.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You don&amp;#39;t remember me, huh?! I&amp;#39;m not surprised! I could NEVER forget you after what you did to me!&amp;quot; said Pres.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I don&amp;#39;t know what  you are, and I don&amp;#39;t know what you&amp;#39;re talking about!&amp;quot; replied Dry. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I&amp;#39;m the guy you marooned on this earth with your shitty UFO!&amp;quot; said Pres.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;No, you&amp;#39;re a triangle. I didn&amp;#39;t do shit to you. So please, do me a favor and go away.&amp;quot; said Dry.&lt;/p&gt;\n\n&lt;p&gt;Pres, enraged by this, ran Dry into the wall. &amp;quot;YOUR  UFO HAD SOME KIND OF MAGNET! IT FORCED ME TO FOLLOW YOUR SHIP WHEREVER IT WENT! I had to fly threw space following a shitty ship FOR TWO HOURS, while you were in there not hearing my cries for help. I know that because I have a WATCH!&amp;quot; said Pres, showing Dry his watch. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Hey listen, I wanna go home too!&amp;quot; replied Dry.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;IF IT WASN&amp;#39;T FOR YOU, I WOULDN&amp;#39;T BE MAROONED ON THIS GOD FORSAKEN PLANET!&amp;quot; shouted Pres. Grabbing Dry, Pres threw Dry to the window.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You&amp;#39;re making a BIG MISTAKE HERE!&amp;quot; said Dry, throwing a punch. Pres caught his punch very easily, and threw Dry into the closet. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I&amp;#39;VE BEEN WAITING TO DO THIS ALL DAY!&amp;quot; screamed Pres. &lt;/p&gt;\n\n&lt;p&gt;Dry reached for his blaster, grabbed it, and shot Pres. Pres fell, unconscious. &amp;quot;If I was a cold-hearted alien, I&amp;#39;d probably wouldn&amp;#39;t have changed the setting to &amp;#39;Stun&amp;#39;.&amp;quot; said Dry. You&amp;#39;re welcome.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Via feet, Dry rolled Pres out the window...as Pres fell into the dumpster. Dry put on a disguise and left the room. Walking out of the building, Dry climbed a rooftop by ladder, and saw Noble, Ebola, and Zoo drinking at the pub. Climbing down, Dry sprinted into the pub and walked up to the three humans. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Oh, hey, uh...What&amp;#39;s your names? I actually never got them.&amp;quot; asked Dry.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I&amp;#39;m Ebola.&amp;quot; said Ebola.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I&amp;#39;m Noble.&amp;quot; said Noble.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Hello, I&amp;#39;m Zoo.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Oh, hey, Noble, Zoo, Ebola, we gotta get out of here, family emergency or shit like that.&amp;quot; said Dry.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Hey, they gotta pay the tip!&amp;quot; said DedicatedWam, the bartender.&lt;/p&gt;\n\n&lt;p&gt;Dry rolled his eyes, took out a freeze pistol and froze Dedicated. Walking outside, Dry explained everything that happened.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;So you weren&amp;#39;t alone when you came here?! Jesus!&amp;quot; said Zoo.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Yeah. Now he&amp;#39;s kind of trying to murder me and anyone I care about, so, yeah.&amp;quot; said Dry.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;What are we gonna do?!&amp;quot; said Ebola.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Calm down, Ebola. All we have to do is negotiate. And protect the balls from being kicked the shit out of.&amp;quot; said Dry. &amp;quot;Now, he&amp;#39;s currently unconscious in the dumpster, so let&amp;#39;s go find his body.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;When they checked on the dumpster, it was empty. &amp;quot;...Where is the triangle, Dry?&amp;quot; asked Zoo.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;...It was right here.&amp;quot; said Dry. &amp;quot;Oh crap. I think it might&amp;#39;ve..&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Hey look, a shooting star...In the day?&amp;quot; said Noble.&lt;/p&gt;\n\n&lt;p&gt;That shooting star turned out to be Pres, as he tackled Dry from the sky.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;AAH!&amp;quot; screamed Dry as Pres punched him across the face. Pres punched him again, and Dry put his hands on Pres&amp;#39;s head and threw him off. Pres ripped off Dry&amp;#39;s wig, threw it on the ground, and levitated into the sky, holding Dry. When they were outside the last floor, Dry headbutted Pres, and Pres threw him into Noble&amp;#39;s room.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Oh, shit!! We have to get up there!&amp;quot; said Zoo. The three humans raced into the building, and entered the elevator.&lt;/p&gt;\n\n&lt;p&gt;Meanwhile, Dry pulled out his freeze pistol and froze Pres&amp;#39; head. Pres walked into walls, trying to crack the ice. Dry grabbed his head, and forced it into the wall, breaking the ice. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;JUST LEAVE ME ALONE!&amp;quot; screamed Dry.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;NEVER!!&amp;quot; shouted Pres.&lt;/p&gt;\n\n&lt;p&gt;Pres threw Dry into the closet. Pres&amp;#39; eye was red. Dry crawled into a corner, and looked at the time. &amp;quot;3...2...1!&amp;quot; said Dry. Suddenly, a bed materialized in the air, and fell on Pres! &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;WHAT...THE...HELL!&amp;quot; screamed Pres, trying to crawl out of it.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;THANK YOU, COMMANDER XJ4!&amp;quot; shouted Dry.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;What the hell&amp;#39;s going on here?!&amp;quot; said Pres.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I&amp;#39;m getting everything I need!&amp;quot; replied Dry. &lt;/p&gt;\n\n&lt;p&gt;Then a table appeared. Then a furnace! Then brewing stands, technical things, a computer! In mere seconds, an entire lab was made! Pres crawled out from under the bed, but Dry froze Pres&amp;#39; legs again. &amp;quot;Oh, great. What now?!&amp;quot; demanded Pres. Dry appeared to be making a potion. Pres fell on the floor repeatedly, trying to make his ice crack.&lt;/p&gt;\n\n&lt;p&gt;Finally, Dry was done with the potion. &amp;quot;Phosphine gas, don&amp;#39;t fail me now!&amp;quot; said Dry. He ran out of the closet, and threw the potion down, as phosphine gas was synthesized. Dry shut the closet door, but heard no coughing. Breathing heavily, Noble, Zoo and Ebola entered. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;What happened?!&amp;quot; asked Noble. &amp;quot;What&amp;#39;s going on?!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I...I created deadly toxin. He&amp;#39;s suffocating in there.&amp;quot; said Dry.&lt;/p&gt;\n\n&lt;p&gt;They waited a few moments before opening the door. Pres had not been harmed! He was standing right in front of them!&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;But...But..How?! Why won&amp;#39;t you...&amp;quot; said Zoo.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;No lungs, idiots!&amp;quot; said Pres. &amp;quot;Deadly toxin can&amp;#39;t kill me!&amp;quot; Pres prepared to end Dry.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;WAIT! STOP! DON&amp;#39;T DO ANYTHING ELSE!&amp;quot; said Noble.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Oh, for god&amp;#39;s sake..&amp;quot; said Pres.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Look, we understand how tough it might be to be marooned on a world you have no experience with, but that DOESN&amp;#39;T MEAN YOU CAN GO AROUND TRYING TO MURDER SOMEONE FOR A MISTAKE.&amp;quot; said Noble.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;How about you stop acting like a psycho and get to work on getting home yourself?&amp;quot; said Ebola.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;And hey, while you&amp;#39;re at that, maybe help rainbow here get back home as well? Maybe he can help you-.&amp;quot; said Zoo.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;ALRIGHT, jesus! You don&amp;#39;t have to bust my balls!&amp;quot; said Pres. &amp;quot;I won&amp;#39;t try to kill him... for now. But there&amp;#39;s no way I&amp;#39;m letting this piece of trash here help me get home. He&amp;#39;s sabotaged my life enough.&amp;quot; said Pres. &amp;quot;End of story.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;So I get to live?&amp;quot; said Dry.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Yeah...But let me make one thing clear. We are &lt;em&gt;not&lt;/em&gt; friends. Now if you&amp;#39;ll excuse me, I&amp;#39;m gonna go get to work.&amp;quot; said Pres, exiting the room, floating out.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Well?&amp;quot; asked Ebola. &amp;quot;Are you gonna thank us or what?&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Yeah, no time for thanking. We&amp;#39;ve got work to do.&amp;quot; said Dry.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Wait, we? You&amp;#39;re gonna let us help you?&amp;quot; asked Noble.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Yeah, sure, why not. You did save me on the highway, and gave me a place to stay, so uh...Sure.&amp;quot; said Dry.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Hell, yeah!&amp;quot; said Zoo. &amp;quot;What can we do?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You&amp;#39;re gonna help me get home.&amp;quot; said Dry. &amp;quot;And go on crazy adventures along the way, because I invent things and will kidnap you.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Alright!&amp;quot; said Ebola. &amp;quot;Let&amp;#39;s do this!&amp;quot;&lt;/p&gt;\n\n&lt;h1&gt;THE END&lt;/h1&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                        "likes": null,
                        "suggested_sort": null,
                        "banned_at_utc": null,
                        "view_count": null,
                        "archived": false,
                        "no_follow": false,
                        "is_crosspostable": false,
                        "pinned": false,
                        "over_18": false,
                        "all_awardings": [],
                        "awarders": [],
                        "media_only": false,
                        "can_gild": false,
                        "spoiler": false,
                        "locked": false,
                        "author_flair_text": null,
                        "treatment_tags": [],
                        "visited": false,
                        "removed_by": null,
                        "num_reports": null,
                        "distinguished": null,
                        "subreddit_id": "t5_3fir2",
                        "author_is_blocked": false,
                        "mod_reason_by": null,
                        "removal_reason": null,
                        "link_flair_background_color": "",
                        "id": "4vf5gj",
                        "is_robot_indexable": true,
                        "num_duplicates": 0,
                        "report_reasons": null,
                        "author": "DrydonTheAlt",
                        "discussion_type": null,
                        "num_comments": 1,
                        "send_replies": true,
                        "media": null,
                        "contest_mode": false,
                        "author_patreon_flair": false,
                        "author_flair_text_color": null,
                        "permalink": "/r/ReversalHub/comments/4vf5gj/homeward_bound_chapter_i_part_ii_the_visitor/",
                        "whitelist_status": null,
                        "stickied": false,
                        "url": "https://old.reddit.com/r/ReversalHub/comments/4vf5gj/homeward_bound_chapter_i_part_ii_the_visitor/",
                        "subreddit_subscribers": 26,
                        "created_utc": 1469930405.0,
                        "num_crossposts": 0,
                        "mod_reports": [],
                        "is_video": false
                    }
                }
            ],
            "before": null
        }
    },
    {
        "kind": "Listing",
        "data": {
            "after": null,
            "dist": null,
            "modhash": "",
            "geo_filter": "",
            "children": [
                {
                    "kind": "t1",
                    "data": {
                        "subreddit_id": "t5_3fir2",
                        "approved_at_utc": null,
                        "author_is_blocked": false,
                        "comment_type": null,
                        "awarders": [],
                        "mod_reason_by": null,
                        "banned_by": null,
                        "author_flair_type": "text",
                        "total_awards_received": 0,
                        "subreddit": "ReversalHub",
                        "author_flair_template_id": null,
                        "likes": null,
                        "replies": "",
                        "user_reports": [],
                        "saved": false,
                        "id": "d5z1tor",
                        "banned_at_utc": null,
                        "mod_reason_title": null,
                        "gilded": 0,
                        "archived": false,
                        "collapsed_reason_code": null,
                        "no_follow": true,
                        "author": "DrydonTheAlt",
                        "can_mod_post": false,
                        "created_utc": 1470016260.0,
                        "send_replies": true,
                        "parent_id": "t3_4vf5gj",
                        "score": 1,
                        "author_fullname": "t2_y6opy",
                        "approved_by": null,
                        "mod_note": null,
                        "all_awardings": [],
                        "collapsed": false,
                        "body": "aw no comments :(",
                        "edited": false,
                        "top_awarded_type": null,
                        "author_flair_css_class": null,
                        "name": "t1_d5z1tor",
                        "is_submitter": true,
                        "downs": 0,
                        "author_flair_richtext": [],
                        "author_patreon_flair": false,
                        "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;aw no comments :(&lt;/p&gt;\n&lt;/div&gt;",
                        "removal_reason": null,
                        "collapsed_reason": null,
                        "distinguished": null,
                        "associated_award": null,
                        "stickied": false,
                        "author_premium": false,
                        "can_gild": false,
                        "gildings": {},
                        "unrepliable_reason": null,
                        "author_flair_text_color": null,
                        "score_hidden": false,
                        "permalink": "/r/ReversalHub/comments/4vf5gj/homeward_bound_chapter_i_part_ii_the_visitor/d5z1tor/",
                        "subreddit_type": "restricted",
                        "locked": false,
                        "report_reasons": null,
                        "created": 1470016260.0,
                        "author_flair_text": null,
                        "treatment_tags": [],
                        "link_id": "t3_4vf5gj",
                        "subreddit_name_prefixed": "r/ReversalHub",
                        "controversiality": 0,
                        "depth": 0,
                        "author_flair_background_color": null,
                        "collapsed_because_crowd_control": null,
                        "mod_reports": [],
                        "num_reports": null,
                        "ups": 1
                    }
                }
            ],
            "before": null
        }
    }
]